[
    {
        "content": "<p>To stay grounded in where I want to go, I returned to the van der Schaft papers on thermodynamics, and I found that any input-state-output port-Hamiltonian system can be seen as a port-Thermodynamical system.</p>\n<p>And by port-Hamiltonian system, he includes a resistive structure! So he is actually describing the resistive structure here as conversion into heat and dumping into a heat bath, which he calls the \"internal energy\".</p>\n<p><a href=\"/user_uploads/21317/ml0SsW6Cfgw9xIuweMJC9etm/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/ml0SsW6Cfgw9xIuweMJC9etm/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/ml0SsW6Cfgw9xIuweMJC9etm/image.png\"></a></div>",
        "id": 272610691,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1645384569
    },
    {
        "content": "<p>This was my dream! To represent resistors as dumping heat into a heat bath!</p>",
        "id": 272610732,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1645384652
    },
    {
        "content": "<p>The thing is, it doesn't look like he does this for general port-Hamiltonian systems; only for those factored into input-state-output form</p>",
        "id": 272610796,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1645384706
    },
    {
        "content": "<p>It seems like his formulation of port-Thermodynamic system is restricted to this explicit factoring, as far as I can tell</p>",
        "id": 272610810,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1645384739
    },
    {
        "content": "<p>That's good in a way because it leaves you something to do.   In real-world systems the so-called \"output\" can often affect the so-called \"input\".   Jan Willems has some important rants about this.</p>",
        "id": 272611268,
        "sender_full_name": "John Baez",
        "timestamp": 1645385335
    },
    {
        "content": "<p>I feel like at some point it might be a good idea to reach out to Arjan and talk to him about this stuff, though after I understand enough of it that I won't make a fool out of myself</p>",
        "id": 272611355,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1645385446
    },
    {
        "content": "<p>I.e., I bet he's thought about a more general definition of port-Thermodynamical systems</p>",
        "id": 272611441,
        "sender_full_name": "Owen Lynch",
        "timestamp": 1645385529
    },
    {
        "content": "<p>Yes, it would be good to talk to him.</p>",
        "id": 272614696,
        "sender_full_name": "John Baez",
        "timestamp": 1645389422
    }
]