[
    {
        "content": "<p>Would it make sense for there to be a North American SYCO and a European SYCO that run in parallel?</p>",
        "id": 289045479,
        "sender_full_name": "Chad Nester",
        "timestamp": 1657378103
    },
    {
        "content": "<p>(Not literally at the same time)</p>",
        "id": 289045489,
        "sender_full_name": "Chad Nester",
        "timestamp": 1657378123
    },
    {
        "content": "<p>As a sort of community meeting I don't think online participation makes a lot of sense.</p>",
        "id": 289045498,
        "sender_full_name": "Chad Nester",
        "timestamp": 1657378153
    },
    {
        "content": "<p>Making events accessible online is such a basic gesture to make meetings more accessible, even if it means people missing out on the social aspect of meetings. Why not allow online participation?</p>",
        "id": 289048931,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1657382182
    },
    {
        "content": "<p>My opinion is that the social aspect of meetings is like %90 of the point of having them.</p>",
        "id": 289049472,
        "sender_full_name": "Chad Nester",
        "timestamp": 1657382806
    },
    {
        "content": "<p>That's not an acceptable excuse for excluding people from the research content of the meetings.</p>",
        "id": 289050042,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1657383508
    },
    {
        "content": "<p>We have papers...</p>",
        "id": 289050382,
        "sender_full_name": "Chad Nester",
        "timestamp": 1657383972
    },
    {
        "content": "<p>Due to the climate crisis, we need to stop flying around to conferences.... at least until they develop airplanes that don't run on fossil fuels.    We can have local conferences, that's good, and maybe that's what SYCO aims to be - but there are also reasons for people who are geographically far apart to communicate verbally, not just write and read papers.  So, we need to get good at conferences where we give talks and even do some of the social part online.  </p>\n<p>The pandemic was a powerful nudge in the right direction: hybrid conferences.   It would be sad to see this progress lost.</p>\n<p>Anyway, if SYCO9 is not hybrid, I will have to withdraw my talk.</p>",
        "id": 289063064,
        "sender_full_name": "John Baez",
        "timestamp": 1657401252
    },
    {
        "content": "<p>In part I agree. On the other hand being able to travel around is one of the few perks of working in academia.  This, and the freedom in pursuing one's research interests. These two things have been constantly eroded away year after year, because of the pandemic and the climate crisis the former, because of the increasing amount of admin work put on faculty the latter. So, given this, why should one even stay in academia? I understand how \"we have to fly less\" makes a lot of sense rationally and ideologically, but the practical consequence of this will be, imho, nudging even more people towards the corporate environment.</p>",
        "id": 289065730,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1657404631
    },
    {
        "content": "<p>All this to say that \"organizing virtual events while we wait for electric planes to be invented (if ever)\" doesn't seem to me like a practicable solution.</p>",
        "id": 289065803,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1657404725
    },
    {
        "content": "<p>People riding on the Titanic found it inconvenient to leave their deck chairs, too.</p>",
        "id": 289065841,
        "sender_full_name": "John Baez",
        "timestamp": 1657404809
    },
    {
        "content": "<p>If we're worried about the encroaching burden of administrators and administrative work - and I'm sure most of us are - we should tackle that directly, not say \"here, go burn some carbon and fly to a nice destination - you'll feel better.\"</p>",
        "id": 289065937,
        "sender_full_name": "John Baez",
        "timestamp": 1657404921
    },
    {
        "content": "<p>By the way, I'm not saying changes in individual behavior are the most important way to cut carbon emissions.  But it's part of changing the culture.   Treating carbon emissions as an attractive perk, rather than something embarrassing, has got to go.</p>",
        "id": 289066513,
        "sender_full_name": "John Baez",
        "timestamp": 1657405646
    },
    {
        "content": "<p>Don't get me wrong, personally I'm also trying to do my part. One thing I did was investing into a nice VR set in the hope that better virtual reality meeting experiences are eventually developed</p>",
        "id": 289066943,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1657406182
    },
    {
        "content": "<p>But still, atm all the virtual conference experiences I've tried were quite disappointing, and didn't really manage to re-create any of the perks of an in-person experience</p>",
        "id": 289066974,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1657406232
    },
    {
        "content": "<p>Yes, it's true.   We need to invent new low-carbon perks.</p>",
        "id": 289067346,
        "sender_full_name": "John Baez",
        "timestamp": 1657406730
    },
    {
        "content": "<p>I agree that the system of conferences we have now is ecologically irresponsible and that we have to replace it with something. I certainly take your point, and can see a place for virtual events. I also want there to be a place for smaller local events. We can have both :)</p>",
        "id": 289084460,
        "sender_full_name": "Chad Nester",
        "timestamp": 1657432457
    },
    {
        "content": "<p>17 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"229141\" href=\"/#narrow/stream/229141-general.3A-events/topic/SYCO.209.2C.20Como\">#general: events &gt; SYCO 9, Como</a> by <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span>.</p>",
        "id": 289084589,
        "sender_full_name": "Notification Bot",
        "timestamp": 1657432684
    },
    {
        "content": "<p>I've moved this thread since we're not really talking about SYCO 9 anymore, but rather general issues about conferences.</p>",
        "id": 289084611,
        "sender_full_name": "John Baez",
        "timestamp": 1657432778
    },
    {
        "content": "<p>Okay, so we don't disagree, Chad.   Perhaps despite appearances, I wasn't trying to bully SYCO 9 into being other than a local conference.   think it's great to have lots of hybrid or fully virtual conferences, but I also like the idea of local in-person conferences.  They help build communities.</p>",
        "id": 289084763,
        "sender_full_name": "John Baez",
        "timestamp": 1657432939
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/conferences/near/289065730\">said</a>:</p>\n<blockquote>\n<p>In part I agree. On the other hand being able to travel around is one of the few perks of working in academia.  This, and the freedom in pursuing one's research interests.</p>\n</blockquote>\n<p>I'm not arguing that people should have to stop travelling, I'm arguing that people shouldn't have to travel in order to participate. I got into topos theory as a masters student by going to a topos theory school in Nice. There was no funding for this; I got cheap flights and a cheap airbnb to participate. Most people would not have that opportunity. It is great that many academics get generous travel funding, but that's never going to be true of everyone that could benefit from participation in our events and conferences.</p>",
        "id": 289091809,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1657444215
    },
    {
        "content": "<p>I think the idea of the SYCO meetings was to have them so often that if one is inconvenient for you, then you just go to the next one in 3-4 months; and ideally that would mean having them in locations far enough from each other that every community gets a \"local\" SYCO meeting; sadly only SYCO 4 has ever been in North America as opposed to Europe, and of course covid has been a spanner in the \"rolling\" model</p>",
        "id": 289098547,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1657453740
    },
    {
        "content": "<p>Personally I'm in favour of \"full hybrid\" if that model cannot be realised, and indeed in SYCO 8 which I locally organised we had both in-person and online talks, in a 1:1 ratio approximately. But it's ok for organisers to make their own choices each time.</p>",
        "id": 289098631,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1657453892
    },
    {
        "content": "<p>(Currently the SYCO steering committee includes only Europe-based academics which probably is not ideal if it's not supposed to be a \"European\" conference)</p>",
        "id": 289098857,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1657454178
    },
    {
        "content": "<p>I think all of this makes sense to me. I start from a baseline of considering as a hard requirement being properly hybrid for ACT22 (including making a <em>good</em> experience for people online as far as possible). But SYCO is designed to be very frequent and franchise-able, there should really be parallel events happening on every continent so nobody has to travel far to their nearest one</p>",
        "id": 289099414,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1657454979
    },
    {
        "content": "<p>Just to drive <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> ‘s point home, here are my two cents: I think that in-person only conferences only make sense nowadays if they’re workshops or something to that affect. Otherwise, making a conference entirely in person does indeed feel like gatekeeping. <br>\nAs a personal anecdote, the pandemic allowed me (a few others I know, and I bet many others still) to interact with disciplines, fields and people that I  otherwise would not have had access to. <br>\nAlso there are plenty of people who also, due to family, personal or other reasons cannot commit to traveling as as often as they’d like, so I bet many of us would really appreciate the option to still interact and see live talks… Not to mention John’s very valid point about fossil fuel usage and us not wanting the planet to burn up.. </p>\n<p>I think that, as a community, we should be thinking of ways to make online/hybrid conferences more engaging, fun and productive.</p>",
        "id": 289148871,
        "sender_full_name": "Benjamin Merlin Bumpus",
        "timestamp": 1657520755
    },
    {
        "content": "<p>Not in particular for SYCO, but Chad's initial idea of having two parallel conferences, one in Europe and one in America (or other places too) in principle seems a workable compromise between \"still traveling\" and \"cutting carbon emissions\". <br>\nOne would have to organize it right though (each talk is visible online for everyone, no overlaps, etc).</p>",
        "id": 289152948,
        "sender_full_name": "Paolo Perrone",
        "timestamp": 1657523866
    },
    {
        "content": "<p>Adding to the pile of pros for hybrid conferences, talking at conferences gives career points so if one can make it easier to deliver a talk without having to spend money, that is, in the interest of inclusivity, would be great regardless of pandemics, climate change or any other factor. Let's remember attending a conference is costly and as far as my experience goes, you need to be quite well off to afford it, even if uni reimburses you.</p>",
        "id": 289165784,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1657531748
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276438\">Fabrizio Genovese</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/conferences/near/289065730\">said</a>:</p>\n<blockquote>\n<p>On the other hand being able to travel around is one of the few perks of working in academia.</p>\n</blockquote>\n<p>That's true and I see the point that given the option to deliver talks online, it's only a matter of time for admin to realize they can stop paying travelling money.<br>\nThis could actually be for the good: it's bad policy to regularly send people across the ocean for networking purposes (or even across a continent). It's good in some measure when you're at an early stage in your career, but then should be more policed. That said, that conversation should happen in uni departments. Externalizing this decision to second-order effects deriving from very specific incentive structures seems ill-advised and, eventually, doomed to fail.</p>",
        "id": 289166482,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1657532181
    },
    {
        "content": "<p>I used to advocate the idea that some hotel chain should have restaurants where you can sit in a booth equipped with a video display that lets you eat dinner with someone in a restaurant in some other branch of the chain.    </p>\n<p>Some people would sit at a table facing a video display that would show another half of a table, which would be the table in the other branch.</p>",
        "id": 289209181,
        "sender_full_name": "John Baez",
        "timestamp": 1657553869
    },
    {
        "content": "<p>In fact I still advocate this, even though most people now have cell phones and laptops that do video calls.</p>",
        "id": 289209434,
        "sender_full_name": "John Baez",
        "timestamp": 1657553953
    },
    {
        "content": "<p>It's still hard to talk and eat a meal with some people far away.</p>",
        "id": 289209540,
        "sender_full_name": "John Baez",
        "timestamp": 1657553984
    },
    {
        "content": "<p>(Change \"restaurant\" to \"bar\" if that's more your thing.)</p>",
        "id": 289209654,
        "sender_full_name": "John Baez",
        "timestamp": 1657554017
    },
    {
        "content": "<p>uhm I remember a big tech company revealing a full-immersive video call setup like that last year</p>",
        "id": 289214116,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1657555719
    },
    {
        "content": "<p>your idea is great btw!</p>",
        "id": 289214136,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1657555733
    },
    {
        "content": "<p>I agree with the general principle that we should make the online component of a hybrid conference more like the actual conference. Meaning: somehow make it more social. The question is, how do we do this? Did anyone feel like they were at an online conference where this was better than at other conferences?</p>",
        "id": 289230450,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1657563675
    },
    {
        "content": "<p>For me, the one that came closest was QPL2021, where they had everyone in Gathertown, so that you could walk around virtually and talk to people if you wanted. The problem there was that not everyone actually was in Gathertown, so that you couldn't do the thing where you hunt down the speaker of the last talk in order to ask them a couple more questions</p>",
        "id": 289230598,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1657563737
    },
    {
        "content": "<p>Would the long-term thing to do be to invest in virtual reality type solutions together with  telepresence robots, so that you can actually \"be\" at the conference?</p>",
        "id": 289230928,
        "sender_full_name": "John van de Wetering",
        "timestamp": 1657563897
    },
    {
        "content": "<p>I’ve had good experiences with gathertown (the paid version is apparently much better). For example I attended a  Dagstuhl conference in 2021 which was entirely on Gathertown and it worked quite well.</p>",
        "id": 289235902,
        "sender_full_name": "Benjamin Merlin Bumpus",
        "timestamp": 1657566447
    }
]