[
    {
        "content": "<p>In relation to <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/310428328\">this topic</a>, I'd like to open the floor on open access, and adjacent \"not so open\" publication options.<br>\nResearcher-directed online publication models exist; in particular, [insert appropriate precious material here] open access doesn't involve transfer of funds. On the other hand, managing a journal or a conference takes resources! For online journals, that's a minimum of hardware or cloud space and the hours required to manage that, but physical publication carries a much wider array of costs. So where do funds come from, and where do they go?</p>",
        "id": 310436878,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1668612814
    },
    {
        "content": "<p>(I am happy for this discussion to encompass the finer points of the publication pipeline in general, but will branch the discussion if it gets hard to follow).</p>",
        "id": 310437688,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1668613048
    },
    {
        "content": "<p>Looks like the perfect place to advertize this: <a href=\"https://nofreeviewnoreview.org/\">https://nofreeviewnoreview.org/</a></p>",
        "id": 310519032,
        "sender_full_name": "Lê Thành Dũng (Tito) Nguyễn",
        "timestamp": 1668640591
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308397\">Sam Staton</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Logic.20in.20Computer.20Science.20conference/near/310428328\">said</a>:</p>\n<blockquote>\n<p>Also, if you do complain about OA, please do be very clear what you think about \"Gold OA\", which as Jules said, may be regarded as a red herring (but which some people like). There's a tendency for publishers to say \"OK you all want OA, let's charge 1.5k per paper, then it's gold OA, great, sorted\". Currently that's done at several ACM conferences and you can pay at LICS too on ACM years. At POPL iirc there's a subsidy for all papers, and authors are asked to contribute $400 but that's still subsidized compared to (iirc) $900. The subsidy seems to indirectly come from other sources e.g. registration fees. I hear that there is a drive to ask universities to pay annual fees to publishers instead, which might be much more than the library access fees that they were already paying. There is a whole long debate about how much it should all really cost, who should pay, etc, which is probably another thread!</p>\n</blockquote>\n<p>The only way for this sort of cancer to be removed is for the whole editorial board of such journals/conferences to unilaterally resign, and start a cloned venue, along with pulbic statements of cooperation by prominent professors in the relevant field.</p>",
        "id": 310524501,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1668643642
    },
    {
        "content": "<p>What is actually stopping these professors from emailing each other and just doing this?  They aren't getting paid either, it seems like a simple solution... and it is morally reprehensible that these systems continue to extract resources with no added value to society.</p>",
        "id": 310524988,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1668643934
    },
    {
        "content": "<p>If you're interested in these issues, you might enjoy my blog post / manifesto \"free publishing\" <a href=\"https://julesh.com/2021/02/16/free-publishing/\">https://julesh.com/2021/02/16/free-publishing/</a></p>",
        "id": 310587378,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1668683273
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277391\">@Cole Comfort</span> wrote:</p>\n<blockquote>\n<p>What is actually stopping these professors from emailing each other and just doing this?</p>\n</blockquote>\n<p>It's a lot of work to start a journal and even more work to keep one running, compared to being an editor for a corporate journal where the corporation pays people to do a lot of stuff.  So, editors have to be quite committed to open access to break free of the corporation-run journal and set up their own journal.  Of course it happens, like in the case of the Springer journal <em>K-Theory</em> - which was <a href=\"https://mathoverflow.net/questions/136465/what-happened-to-online-articles-published-in-k-theory-springer-journal\">quite a fiasco</a> since Springer stopped making the old journal issues available on its website, and apparently the new <em>Journal of K-Theory</em> also stopped publishing.</p>",
        "id": 310989826,
        "sender_full_name": "John Baez",
        "timestamp": 1668852763
    },
    {
        "content": "<p>There are probably cases that worked out better - I'm not trying to say these efforts are doomed! - but I'm not remembering them right now.</p>",
        "id": 310989882,
        "sender_full_name": "John Baez",
        "timestamp": 1668852821
    },
    {
        "content": "<p>Some examples which worked out better:</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Algebraic_Combinatorics_(journal)\">https://en.wikipedia.org/wiki/Algebraic_Combinatorics_(journal)</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Journal_of_Machine_Learning_Research\">https://en.wikipedia.org/wiki/Journal_of_Machine_Learning_Research</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Glossa_(journal)\">https://en.wikipedia.org/wiki/Glossa_(journal)</a></li>\n</ul>",
        "id": 311012239,
        "sender_full_name": "Antonin Delpeuch",
        "timestamp": 1668861871
    }
]