[
    {
        "content": "<p>This Thursday (12th of May) at 17:00 UTC</p>\n<p><strong>Andrej Bauer</strong>: <em>The countable reals</em></p>\n<p>Joint work with James E. Hanson from the University of Maryland, <a href=\"http://james-hanson.github.io\">james-hanson.github.io</a>.</p>\n<p>In 1874 Georg Cantor published a theorem stating that every sequence of reals is avoided by some real, thereby showing that the reals are not countable. Cantor's proof uses classical logic. There are constructive proofs, although they all rely on the axiom of countable choice. Can the real numbers be shown uncountable without excluded middle and without the axiom of choice? An answer has not been found so far, although not for lack of trying.</p>\n<p>We show that there is a topos in which the real numbers are countable, i.e., there is an epimorphism from the object of natural numbers to the object of Dedekind reals. Therefore, higher-order intuitionistic logic cannot show the reals to be uncountable.</p>\n<p>The starting point of our construction is a sequence of reals, shown to exist by Joseph S. Miller from University of Wisconsin–Madison, with a strong counter-diagonalization property: if an oracle Turing machine computes a specific real number, when given any oracle representing Miller's sequence, then the number appears in the sequence. One gets the idea that the reals ought to be countable in a realizability topos built from Turing machines with oracles for Miller's sequence. However, we cannot just use ordinary realizability, because all realizability toposes validate countable choice and consequently the uncountability of the reals.</p>\n<p>To obtain a topos with countable reals, we define a variant of realizability which we call parameterized realizability. First we define parameterized partial combinatory algebras (ppca), which are partial combinatory algebras whose evaluation depends on a parameter. We then define parameterized realizability toposes. In these realizers witness logical statements uniformly in the parameters. The motivating example is the parameterized realizability topos built from the ppca of oracle Turing machines parameterized by oracles for Miller's sequence. In this topos, Miller's sequence is the desired epimorphism from natural numbers to Dedekind reals.</p>\n<p>Zoom: <a href=\"https://topos-institute.zoom.us/j/84392523736\">https://topos-institute.zoom.us/j/84392523736</a><br>\nYouTube: <a href=\"https://youtu.be/4CBFUojXoq4\">https://youtu.be/4CBFUojXoq4</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"4CBFUojXoq4\" href=\"https://youtu.be/4CBFUojXoq4\"><img src=\"https://uploads.zulipusercontent.net/60f9c7e936e71a16ee921bd3fffb69332929ce62/68747470733a2f2f692e7974696d672e636f6d2f76692f34434246556f6a586f71342f64656661756c742e6a7067\"></a></div>",
        "id": 281744790,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1652129911
    },
    {
        "content": "<p>This is great, Ingo Blechschmidt mentioned to me last year that he had been searching for a topos where the reals are countable. Mind-bending stuff..!</p>",
        "id": 281789154,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1652169073
    }
]