[
    {
        "content": "<p>Our tutorial paper, with <span class=\"user-mention\" data-user-id=\"351836\">@Fabio Zanasi</span>, on hierarchical string diagrams for monoidal closed categories is now on ArXiv. ( <a href=\"https://arxiv.org/abs/2305.18945\">https://arxiv.org/abs/2305.18945</a> ) It is intended for a PL audience. Your comments and suggestions would be highly appreciated.</p>",
        "id": 362781842,
        "sender_full_name": "Dan Ghica",
        "timestamp": 1685630846
    },
    {
        "content": "<p>I'm curious.  Why does it seem that computer science folk really like two letter abbreviations?  Mathematicians say category theory, computer scientists say CT; mathematicians say computer science, computer scientists say CS.</p>\n<p>This is apropos of the fact that I don't know what PL stands for. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 362848937,
        "sender_full_name": "Simon Willerton",
        "timestamp": 1685644810
    },
    {
        "content": "<p>It must have to do with typing program code so much.  PL = \"programming languages\", which includes type theory, compiler construction, security, performance etc</p>",
        "id": 362849266,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1685644905
    },
    {
        "content": "<p>I also could not have guessed that without looking at the paper...<br>\n<span class=\"user-mention\" data-user-id=\"276935\">@Simon Willerton</span> a lot worse for me are emails I get advertising conferences and events in research groups without saying what the initialism stands for. How am I supposed to quickly identify whether I could be interested without that information!? Unfortunately, my default has become \"if you don't know what it stands for, assume it isn't for you\", which I also applied to this case <span class=\"user-mention\" data-user-id=\"620219\">@Dan Ghica</span> , so beware.</p>",
        "id": 362863415,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1685648308
    }
]