[
    {
        "content": "<p>There are lots of papers on formalizing category theory in ZFC or NBG set theory, or ZFC+ some number of universes.<br>\nThere are also lots of papers on formalizing category theory in Coq, Lean or other dependent type theories.</p>\n<p>I am interested in what has been done theoretically regarding the possibility of carrying out the development of category theory in HOL, perhaps + extra axioms. HOL is a weaker logic than the calculus of constructions and dependent types are very natural for encoding category theory, so this is arguably an uphill battle, but I think the question is still interesting because automation in HOL leads automation in dependent type theory by a considerable margin at the moment. Reasoning in category theory is often very simple (equational reasoning is often all that is necessary for proving a diagram commutes) and so one would like to be able to take advantage of automation.</p>",
        "id": 324485106,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675023431
    },
    {
        "content": "<p>There are papers in the Isabelle/HOL archive of formal proofs. i have been reading the papers by Eugene Stark. it is very interesting but honestly his conception of a \"category of sets\" is utterly foreign to me, I am very taken aback. I am wondering if there has been much other theoretical work on this topic</p>",
        "id": 324485249,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1675023519
    },
    {
        "content": "<p>Which paper has the unexpected definition of the category of sets?  The \"Types\" mailing list is probably a good place to ask this question.  <a href=\"https://lists.seas.upenn.edu/mailman/listinfo/types-list\">https://lists.seas.upenn.edu/mailman/listinfo/types-list</a></p>",
        "id": 324513964,
        "sender_full_name": "Ryan Wisnesky",
        "timestamp": 1675046158
    },
    {
        "content": "<p>Maybe not exactly what you are asking for, but this describes a development of some category theory in Isabelle/HOL: <a href=\"https://link.springer.com/chapter/10.1007/3-540-44755-5_11\">https://link.springer.com/chapter/10.1007/3-540-44755-5_11</a></p>",
        "id": 324788392,
        "sender_full_name": "Max New",
        "timestamp": 1675117199
    },
    {
        "content": "<p>Now I'm curious about what an utterly foreign concept of \"a category of sets\" could look like!</p>",
        "id": 324799419,
        "sender_full_name": "John Baez",
        "timestamp": 1675121945
    }
]