[
    {
        "content": "<p>We've started talking about some problems to work on.  Here are some I suggested:</p>\n<p>1) coding - features that we could add to the <a href=\"https://algebraicjulia.github.io/AlgebraicPetri.jl/dev/\">AlgebraicPetri</a> package for dealing with open Petri nets.</p>\n<p>2) studying \"motifs\" - basically, Petri nets that commonly show up in chemical reaction networks because they have good properties.  Maybe we could use AlgebraicPetri to create a library of motifs, and study their behavior, alone and composed with each other.   For more on motifs, see:</p>\n<ul>\n<li>John J. Tyson and Béla Novák, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3773234/\">Functional motifs in biochemical reaction networks</a>.</li>\n</ul>\n<p>3) studying \"absolute concentration robustness\" - certain Petri nets with rates have equilibria where the amount of certain chemicals is independent of initial conditions.  There are theorems about this, so far only for \"closed\" Petri nets.  For example:</p>\n<ul>\n<li>\n<p>Martin Feinberg and Guy Shinar, <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3086454/\">Design principles for robust biochemical reaction networks: What works, what cannot work, and what might almost work</a>.</p>\n</li>\n<li>\n<p>Badal Joshi and Gheorghe Craciun, <a href=\"https://arxiv.org/abs/2201.08428\">Reaction network motifs for static and dynamic absolute concentration robustness</a>.</p>\n</li>\n</ul>\n<p>4) studying \"detailed balanced\" open Petri nets with rates.  This is a constraint from thermodynamics that holds for \"realistic\" systems, but is violated by most open Petri nets with rates.   I wrote a paper touching on this with the students at ACT2018, but we never published it.  There's more to do!</p>\n<p>*John C. Baez, Blake S. Pollard, Jonathan Lorand and Maru Sarazola,  <a href=\"https://arxiv.org/abs/1806.10764\">Biochemical coupling through emergent conservation laws</a>.</p>\n<p>5) studying the relation between open Petri nets with rates and stock-flow diagrams.   Evan, Sophie and I have already been thinking about this.    This could easily pull us into topics like this:</p>\n<ul>\n<li>John Baez, Kenny Courser and Christina Vasilakopoulou, <a href=\"https://arxiv.org/abs/2101.09363\">Structured versus decorated cospans</a>.</li>\n</ul>",
        "id": 280587174,
        "sender_full_name": "John Baez",
        "timestamp": 1651208780
    }
]