[
    {
        "content": "<p>I've heard and believed for some time that category theory is <strong>overrepresented</strong> online meaning we see it pop up more often than it should compared to the actual proportions of mathematicians studying category theory. This is obviously my experience too, but I am clearly biased. I looked at the submissions for this year's <a href=\"https://www.youtube.com/hashtag/some3\">SoME</a>, and there is only one video on CT, <a href=\"https://www.youtube.com/hashtag/some2\">last year's</a> had three. So I am not convinced category theory has a bigger place than it should.</p>\n<p>Have you seen evidence of CT being overrepresented or underrepresented online?<br>\nHave you felt that CT is overrepresented or underrepresented online?</p>",
        "id": 387536972,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1693148273
    },
    {
        "content": "<p>I get the impression that category theory has a level of hype/evangelism that other areas of research maths don't receive, I think partially due to the popularity online of Haskell, and the fact that the basics of category theory are easier to learn than other \"advanced\" topics in maths (or at least are more standalone). That said, I don't know how much this translates into actual novel category theory content - for example because the amount of category theory one encounters when learning the main concepts of Haskell is fairly surface level. </p>\n<p>I would guess this is what we see reflected in the SoME submissions: it's more reflective of the proportion of people who work deeply enough with category theory that they have the depth of knowledge to make novel expository content as opposed to the proportion of people who have dipped their toes in category theory and are talking about it online.</p>",
        "id": 387540002,
        "sender_full_name": "Dylan Braithwaite",
        "timestamp": 1693150740
    },
    {
        "content": "<p>One of my theories about this is that category theorists, much more than say analysts, are able to state exciting snappy results that fit in a tweet, which become obvious when you just think about them, if you understand the relevant concepts.</p>",
        "id": 387541351,
        "sender_full_name": "John Baez",
        "timestamp": 1693151927
    },
    {
        "content": "<p>I think some people more than others are responsible for this (toxic) culture.</p>",
        "id": 387632167,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1693215254
    },
    {
        "content": "<p>I'm curious what you think is toxic about it.  If this is true, then I'm inclined to view it as a welcome correction from the days of the late 20th century when category theory tended to be deprecated (especially in the U.S.) as useless abstraction or \"just a language\".  Maybe an overcorrection, but (as a category theorist) it doesn't seem intrinsically bad.  In my own opinion, there's a lot more room for categorical concepts to usefully infuse, say, an undergraduate math curriculum than has yet happened across the board.</p>",
        "id": 387708013,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1693240152
    },
    {
        "content": "<p>CT gets a bad rap not least because of the astonishing amount of jargon that obscures things when deployed by a majority of its proponents (!= experts). </p>\n<p>For example I remember joking with some folks I know about an episode (can't recall precise details, I think it was actually on Zulip) wherein some categorical construct was discussed and someone asked something to the effect of \"well what is this in the case of Set\" and it turned out that the answer was \"it's a function\". </p>\n<p>There are very few or zero nontrivial examples of constructions in many cases and the culture is not geared towards producing or exploring them. Arnol'd of course would say that (paraphrasing again) one's understanding of a concept is bounded by the examples that can be exhibited, and many folks (myself included) are deeply sympathetic to that viewpoint. </p>\n<p>This is all manifested online more than in personal interactions, which heightens perceptions.</p>\n<p>The net result is a sense--at times justified by experience and at other times ironically buttressed by seeing what can be done with the tools in the hands of a master that also has facility in \"ordinary\" mathematics--that many proponents of CT don't understand very much at all and that it is a grift.</p>\n<p>FWIW, I don't share this opinion but I understand it as a reasonable conclusion for folks who haven't been immersed in the subject. Still I understand much CT at all but find it extremely useful in some infrequent and narrow circumstances.</p>",
        "id": 387725445,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1693244961
    },
    {
        "content": "<p>Part of that is just a conflict of cultures and ways of thinking.  As John famously said, category theorists are dual to ordinary people: they get more confused when you surround an abstract concept with lots of distracting specifics.  But CT does definitely tempt a certain sort of person to be overly dismissive of examples, which can certainly lead to bad mathematics and bad exposition.  I think this is part of what led to the original backlash against CT that I mentioned.</p>\n<p>However, I would tend to think that more online exposition of category theory ought to help alleviate this problem rather than exacerbate it.</p>",
        "id": 387727332,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1693245521
    },
    {
        "content": "<p>By the way, this:</p>\n<blockquote>\n<p>the basics of category theory are easier to learn than other \"advanced\" topics in maths (or at least are more standalone).</p>\n</blockquote>\n<p>is an interesting perspective to hear.  I generally think of category theory as requiring <em>more</em> background than most other fields of higher math, because in order to really understand what it's doing and why, you tend to need to already know about multiple examples from multiple <em>other</em> subjects.</p>",
        "id": 387727736,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1693245613
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/CT.20representation.20online/near/387725445\">said</a>:</p>\n<blockquote>\n<p>CT gets a bad rap not least because of the astonishing amount of jargon that obscures things when deployed by a majority of its proponents (!= experts). </p>\n<p>For example I remember joking with some folks I know about an episode (can't recall precise details, I think it was actually on Zulip) wherein some categorical construct was discussed and someone asked something to the effect of \"well what is this in the case of Set\" and it turned out that the answer was \"it's a function\". <br>\n</p>\n</blockquote>\n<p>I recall this, you might have been thinking of \"what is an adjunction in the bicategory of spans\"<br>\n<a href=\"#narrow/stream/229199-learning.3A-questions/topic/Adjunction.20of.20spans/near/351698870\">https://categorytheory.zulipchat.com/#narrow/stream/229199-learning.3A-questions/topic/Adjunction.20of.20spans/near/351698870</a></p>",
        "id": 387744200,
        "sender_full_name": "Patrick Nicodemus",
        "timestamp": 1693251567
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/CT.20representation.20online/near/387727332\">said</a>:</p>\n<blockquote>\n<p>But CT does definitely tempt a certain sort of person to be overly dismissive of examples, which can certainly lead to bad mathematics and bad exposition.  </p>\n</blockquote>\n<p>There is a famous urban legend about this sort of bad mathematics: <a href=\"https://blog.computationalcomplexity.org/2010/09/mathematical-urban-legend.html\">https://blog.computationalcomplexity.org/2010/09/mathematical-urban-legend.html</a></p>",
        "id": 387751630,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1693254614
    },
    {
        "content": "<p>I spent some time in 2020/2021 trying to insert myself into the online communities for representation theorists. I found almost nothing. I have several rep theory friends, and nobody could point me to anything.</p>",
        "id": 387760274,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1693258389
    },
    {
        "content": "<p>Steve, I'm not so sure that CT has an astonishing amount of jargon more so than other fields. What I often see in CT is a few basic concepts being used and reused in an astonishing number of ways. To me, this is where a lot of its power comes from. I think I use the Yoneda lemma just about every day of my life. </p>\n<p>I hope, after the laughter died down, some of those folks might be prepared to believe that a statement like \"functions are left adjoints in the bicategory of relations\" might have a point to it after all, even a substantial point, as opposed to being an exercise in intellectual wankery. </p>\n<p>Incidentally: more urban legends <a href=\"https://mathoverflow.net/questions/53122/mathematical-urban-legends\">here</a>.</p>",
        "id": 387763453,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1693260067
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/CT.20representation.20online/near/387763453\">said</a>:</p>\n<blockquote>\n<p>Steve, I'm not so sure that CT has an astonishing amount of jargon more so than other fields.</p>\n</blockquote>\n<p>I am. Maybe my sense of number is off but the ratio of theorems to definitions seems to me to be lower than in any other field I can think of (for the other extreme, consider areas like numerical analysis, PDE, or probability). The nLab seems to exemplify this.</p>",
        "id": 387789736,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1693273758
    },
    {
        "content": "<p>I agree that CT probably has a lower ratio of theorems to definitions, but I would tend to say that's because it has fewer theorems rather than because it has more definitions.  And the reason it has fewer theorems, I would say, may be partly because it just has fewer results, but als partly because the most important facts tend to be so easy to prove that people don't bother calling them theorems.</p>",
        "id": 387795921,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1693277225
    },
    {
        "content": "<p>Another thing to keep in mind is that a bunch of results in category theory are constructions, and even definitions are results. How often do you see a paper where the main contribution is a novel definition that manages to re-prove a known result?</p>\n<p>Further, areas like numerical analysis, PDE etc, the results are often techniques, and one might in a parallel universe make a formal definition that outlines a technique, but that's now how those fields work.</p>\n<p>Algebraic geometry surely has much more jargon than category theory, in any case. But it is a lot older, and that's a field where there are a large number of concrete examples. One could similarly make a formal definition of an example (this is true for some, eg the Hilbert scheme, or even as low-brow as projective space), but this doesn't happen.</p>",
        "id": 387798182,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1693278664
    },
    {
        "content": "<p>The representation of category theory online was no doubt helped by the attitude of the category theory community to the internet, which had the mailing list, do doubt because of its geographic sparseness, and then TAC started in the early days - and people like John B who was chronically online before that was a phrase, and willing to talk about categories to anyone. Being a younger subject no doubt helped (another early electronic-journal-adopting community was that of combinatorics, to some extent, and that is also a relatively young field).</p>\n<p>The over-representation of CT online balances out the over-representation of certain traditional fields in some of the fancy \"generalist\" journals that nevertheless somehow focus largely on relatively few topics. <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 387798647,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1693278974
    },
    {
        "content": "<p>Shameless plug: I've been working on techniques for studying general cases and particular cases - usually in Set - in parallel, using diagrams \"with the same shape\", and I've been trying to find other people who are also interested in that... but they seem to be very few. My best paper about that is the one in the link below, and if you find it interesting, drop me a line! Cheers and sorry for noise! =P</p>\n<p><a href=\"http://anggtwu.net/math-b.html#2022-md\">http://anggtwu.net/math-b.html#2022-md</a></p>",
        "id": 387798716,
        "sender_full_name": "Eduardo Ochs",
        "timestamp": 1693279056
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/CT.20representation.20online/near/387795921\">said</a>:</p>\n<blockquote>\n<p>I agree that CT probably has a lower ratio of theorems to definitions, but I would tend to say that's because it has fewer theorems rather than because it has more definitions.  And the reason it has fewer theorems, I would say, may be partly because it just has fewer results, but als partly because the most important facts tend to be so easy to prove that people don't bother calling them theorems.</p>\n</blockquote>\n<p>Now imagine you don’t know CT but you see that sort of stuff whenever you glance at a CT paper. You might think nothing much is being done. (You might think the same thing about EGA too, or Spivak’s Calculus on Manifolds as a youngster.)</p>",
        "id": 387799877,
        "sender_full_name": "Steve Huntsman",
        "timestamp": 1693279892
    },
    {
        "content": "<p>Sure.  But that doesn't mean that category theory intrinsically has more jargon than any other field.</p>",
        "id": 387801441,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1693280959
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277578\">Steve Huntsman</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/CT.20representation.20online/near/387789736\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"277611\">Todd Trimble</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/CT.20representation.20online/near/387763453\">said</a>:</p>\n<blockquote>\n<p>Steve, I'm not so sure that CT has an astonishing amount of jargon more so than other fields.</p>\n</blockquote>\n<p>I am. Maybe my sense of number is off but the ratio of theorems to definitions seems to me to be lower than in any other field I can think of (for the other extreme, consider areas like numerical analysis, PDE, or probability). The nLab seems to exemplify this.</p>\n</blockquote>\n<p>Of course the nLab would exemplify this, that's to be expected where almost every page is titled by a name of a concept, and not by the announcement of a theorem.  I'm pretty familiar with the nLab, having made many contributions to it, and I'm familiar with how the pages get generated. I doubt the nLab is all that representative. </p>\n<p>For a more balanced assessment, I'd suggest looking at journal articles, and examine the ratio of assertions (theorems, propositions) to definitions there.</p>",
        "id": 387804693,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1693282694
    },
    {
        "content": "<p>I think any branch of math one is just learning seems to have an annoyingly large amount of jargon.  Then, later, once you've mastered a lot of the jargon and are digging deeper, it seems to have an annoyingly number of theorems.  <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 387824807,
        "sender_full_name": "John Baez",
        "timestamp": 1693294736
    },
    {
        "content": "<p>I'm at the second stage with category theory:  I can remember enough definitions to know what the theorems are saying, but I can't remember all the theorems.  The theorems I remember best are only the ones I've actually used.</p>",
        "id": 387825167,
        "sender_full_name": "John Baez",
        "timestamp": 1693294888
    },
    {
        "content": "<p>Here's a theorem I learned yesterday from Tom Leinster.   Take the definition of monoid written out using commutative diagrams, where the associative law becomes a commutative square.   What's a monoid where this commutative square is a pullback?   It's a <em>group.</em></p>",
        "id": 387825440,
        "sender_full_name": "John Baez",
        "timestamp": 1693294998
    },
    {
        "content": "<p>I may forget this, because even though it's utterly amazing (and it gives a way to define a group in any monoidal category), I don't have any need for it - at least, not now.</p>",
        "id": 387825712,
        "sender_full_name": "John Baez",
        "timestamp": 1693295106
    },
    {
        "content": "<p>But it is the kind of result that would make a good tweet: it's short, snappy and ends in a surprising punchline.</p>",
        "id": 387825800,
        "sender_full_name": "John Baez",
        "timestamp": 1693295148
    },
    {
        "content": "<p>Now, someone who doesn't know category theory might think this result epitomizes the pointlessness of category theory: \"oh, he's defining a group in terms I don't understand\".</p>",
        "id": 387826071,
        "sender_full_name": "John Baez",
        "timestamp": 1693295271
    },
    {
        "content": "<p>But if you know category theory you see right away that's not what's going on here: the amazing thing is that we're defining a group without using the fact that Set has finite products, just its monoidal structure and pullbacks.   This is the sort of thing you tend to think is impossible!</p>",
        "id": 387826244,
        "sender_full_name": "John Baez",
        "timestamp": 1693295357
    },
    {
        "content": "<p>So if you dug into the proof of this result - which I haven't - you might learn a lot.  What else can actually you do in monoidal categories that we tend to think requires cartesianness?</p>",
        "id": 387827066,
        "sender_full_name": "John Baez",
        "timestamp": 1693295750
    },
    {
        "content": "<p>Lawvere's fixed point theorem, for one :-)</p>",
        "id": 387830418,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1693297037
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/CT.20representation.20online/near/387708013\">said</a>:</p>\n<blockquote>\n<p>I'm curious what you think is toxic about it.  If this is true, then I'm inclined to view it as a welcome correction from the days of the late 20th century when category theory tended to be deprecated (especially in the U.S.) as useless abstraction or \"just a language\".  Maybe an overcorrection, but (as a category theorist) it doesn't seem intrinsically bad.  In my own opinion, there's a lot more room for categorical concepts to usefully infuse, say, an undergraduate math curriculum than has yet happened across the board.</p>\n</blockquote>\n<p>This is going to be a very long reply, because your comment is wrong on a multitude of levels in my opinion, and I will try to address at least some of them.</p>\n<p>The following is a quote from Rota 1993 on the proceedings of the Category Theory conference held in 1991:</p>\n<p>It is good to know that category theory is alive and well after all these years. We were turned off to category theory by the excesses of the sixties, when a small but loud crowd pretended to reduce all of mathematics to the language of categories. Now at least they have toned down their claims, and category theory has taken its modest place in the mathematical spectrum side by side with lattice theory, more pretentious perhaps than the latter, but with a good pedigree. [...]</p>\n<p>What stems from the quote is that the CT community always had a kind of evangelic attitude, and like many minorities, it had to work in order to assess/conquer its relevance and importance. For the lack of counterfactuals,  it is hard to claim that this behavior has brought success to the community. Maybe the community has gained some success, <em>despite</em> this behavior?! It's hard to say. It is a fact though that between 1945 and the late 2000s the community has grown in size and prestige. Some pieces of evidence of this are JPAA, which has found its place among the most relevant specialist journals in algebra, Street joining the EB of Advances, and some prestigious publications, say by Moerdijk, in journals of the level of Compositio. These three examples, which are far from being cherry-picked, all happened before what I would call \"the blog post era\", and ages before the \"Twitter era\".</p>\n<p>Since 2010, if anything, the community has lost in prestige and academic relevance, despite (I totally admit it) having reached a much broader audience in popularization and pop culture. The number of prestigious journals we have access to has drastically declined and is now totally restricted to Advances, JPAA is losing quite some prestige and is less and less controlled by CT-sts, it would be unimaginable nowadays to see a CT paper appear on Compositio. Yes, the community has had the HoTT sprint for a while, but that has lost quite some of its initial momentum too and -- I think --, overall, if we compare generation by generation, yours (Mike) is less prestigious than its parents, and mine is even less prestigious than yours.</p>\n<p>Now, on a more \"pop-culture\" side of the story, I agree we have gained a lot in visibility, and this is mostly due to the twitting/blogging thing I touched on previously. Has this truly benefitted our community?! That's unclear. And let me stress, this is the behavior I was calling toxic, not the one of the elder generation. In order to discuss it, let me describe it better.</p>\n<p>John, who is the person I was responding to, wrote \"category theorists, much more than say analysts, are able to state exciting snappy results that fit in a tweet\". This is indeed what happens all the time, a somewhat young and often not very expert PhD student that was nourished in mottos and nlab stories writes on Twitter that whatever all mathematicians are doing is, in fact, all trivial and reduces to the bright and somewhat magical fact that a monad is a monoid in the category of endofunctors. The result? A number of narcissist crackpots enter this very zulip for a couple of weeks and then leave it, a number of young PhD students in other areas think that the PhD student is just an annoying prick (deservedly), and the PhD student grows with a strange complex of superiority which is incredibly hard to heal later in their studies. How is this <em>not</em> supposed to be toxic, I wonder. Now, I have mentioned PhD students here, but I honestly believe that a number of more senior searchers are not only themselves part of what I described, but also responsible for the behavior of their PhD students, who just repeated their attitude. </p>\n<p>All in all, am I saying that we should not try to make category theory broader in scope and more impactful on the category theory community? Of course not! We should! And I think my actions show that I am very much invested in that. Twitting \"ah-ah, you are all my pawns, because universal algebra is just a monoid in the category of endofunctors and I rule them all. Am I not the smartest?\", instead, may not be the best way to actively do healthy popularization, let alone dissemination of category theory.</p>",
        "id": 387839506,
        "sender_full_name": "Ivan Di Liberti",
        "timestamp": 1693300511
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/233322-practice.3A-communication/topic/CT.20representation.20online/near/387825440\">said</a>:</p>\n<blockquote>\n<p>Here's a theorem I learned yesterday from Tom Leinster.   Take the definition of monoid written out using commutative diagrams, where the associative law becomes a commutative square.   What's a monoid where this commutative square is a pullback?   It's a <em>group.</em></p>\n</blockquote>\n<p>Oh, nice!  That may be the first time I've heard it, but it resonates. When you think of the Beck-Chevalley condition derived from a pullback, it looks like it's going to be connected to Frobenius equations (as in Frobenius algebras).</p>",
        "id": 387856716,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1693306346
    },
    {
        "content": "<p>Wow, I hadn't thought of that.  I may want to reprove this result myself sometime.   Btw, Tom said when you define a \"group object in a monoidal category\" this way, the group object <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>G</mi></mrow><annotation encoding=\"application/x-tex\">G</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\">G</span></span></span></span> automatically gets its own \"personal symmetry\" <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>σ</mi><mo>:</mo><mi>G</mi><mo>⊗</mo><mi>G</mi><mo>→</mo><mi>G</mi><mo>⊗</mo><mi>G</mi></mrow><annotation encoding=\"application/x-tex\">\\sigma: G \\otimes G \\to G \\otimes G</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">σ</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.7667em;vertical-align:-0.0833em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">⊗</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">→</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.7667em;vertical-align:-0.0833em;\"></span><span class=\"mord mathnormal\">G</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">⊗</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\">G</span></span></span></span>.   I'm just noting that in case anyone wants to dig into this.</p>",
        "id": 387861982,
        "sender_full_name": "John Baez",
        "timestamp": 1693308296
    },
    {
        "content": "<p>I asked Tom if this was really a symmetry or just a braiding and he said he forgets.</p>",
        "id": 387862038,
        "sender_full_name": "John Baez",
        "timestamp": 1693308323
    }
]