[
    {
        "content": "<p>Anticipate potential travel delays due to construction, especially on the DC Metro Green line connecting DC and College Park. Please note that there is ongoing construction on this line. While there are shuttles available every 10 minutes, it is advisable to expect some delays during your journey.</p>\n<p><a href=\"https://wmata.com/initiatives/plans/2023-Major-Construction/\">https://wmata.com/initiatives/plans/2023-Major-Construction/</a></p>\n<p>The UMD campus also has some construction on the internal roads. They do allow pedestrian crossing though, and we don’t expect it to impact access to the conference venue.</p>",
        "id": 379610306,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1690571050
    },
    {
        "content": "<p>Is it very difficult to purchase a SmarTrip card to use for transport during the week? <br>\nMy understanding is that they can just be purchased and topped-up at vending machines in stations?</p>",
        "id": 379610808,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1690571171
    },
    {
        "content": "<p>It's very easy. At the entrance of every metro stop, there several card vending machines. Adding more money is also easy.</p>",
        "id": 379611076,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1690571243
    },
    {
        "content": "<p>I've obviously never done this with a foreign credit card though. So I can only speak to the experience with a US card. But DC has monstrous amounts of tourism, so I can't imagine they didn't think of this.</p>",
        "id": 379611273,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1690571292
    },
    {
        "content": "<p>Wonderful, thank you!<br>\nI have about four transfers to get from the Dulles airport to my hotel tomorrow, so hopefully it all goes smoothly :)</p>",
        "id": 379611534,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1690571363
    },
    {
        "content": "<p>For anyone taking public transit to College Park, the Green line train is out of service for the summer. </p>\n<p>It has been replaced by free bus service from the Fort Totten metro station. There are two bus lines running, so make sure to take the express to College Park/Greenbelt, not the one to Hyattsville.</p>\n<p>There is also a free shuttle for the ~1 km from the College Park metro/bus drop off to the university campus (104 bus line), but it only runs M-F. Check online for weekend lines or try Lyft/Uber for the last leg.</p>",
        "id": 379668497,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1690592963
    }
]