[
    {
        "content": "<p>Another reason containers are not used in proof assistants is that the direct implementation isn't very efficient. Using a function to represent a small tuple is usually going to be worse, and involve more unnecessary recomputation, than just storing the values.</p>",
        "id": 283223715,
        "sender_full_name": "Bob Atkey",
        "timestamp": 1653213040
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"277308\">@Bob Atkey</span> and <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> , this makes sense. but  I wish <span class=\"user-mention\" data-user-id=\"277574\">@Conor McBride</span>  would comment, as when this zulip started he seemed to have high hopes for the implementation of polynomials, if I understood correctly what he was saying then. (always a big if...)</p>",
        "id": 283235161,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1653230237
    },
    {
        "content": "<p>There's combinatorial species which is very similar to datataypes-as-functors.Maybe this may be of use since from the abstract it tries to reconcile ADTs and species through HoTT? Don't know about nesting though. Is there any reason it couldn't just be regular composition of functors?</p>\n<p><a href=\"https://www.cis.upenn.edu/~sweirich/papers/yorgey-thesis.pdf\">https://www.cis.upenn.edu/~sweirich/papers/yorgey-thesis.pdf</a></p>",
        "id": 283281733,
        "sender_full_name": "Simonas Tutlys",
        "timestamp": 1653291743
    },
    {
        "content": "<p>The idea is the formalize the interplay between the schema category defined by <span class=\"user-mention\" data-user-id=\"276049\">@David Spivak</span> , and a representation of the data as a nested collection. David formalized the notion of a database schema, where one defines the schema as a category <code>S</code> and the instance of a database is a functor (everyone here probably knows this better than me). So what I'm seeking is a way to represent the nested collection  in a similar way, such that one can translate an instance from a relational db to a nested collection.<br>\nI'm still very new to category theory (started studying this year actually), so it's very likely that the solution might not at all complicated, and I'm just unable to grasp it. Or it might be quite complicated, and I just have no idea what I'm getting into.</p>",
        "id": 283304124,
        "sender_full_name": "Davi Sales Barreira",
        "timestamp": 1653305178
    }
]