[
    {
        "content": "<p>Has anyone read Alain Badiou's work <a href=\"http://www.elimeyerhoff.com/books/Badiou/Badiou-Being_and_Event_Searchable.pdf\">being and event</a>? I seem to have a similar view of the world, however I consider myself mathematics first, philosophy second (or third, after physics). </p>\n<p>His thesis is that ontology = mathematics. I'm unsure exactly how he sees ontology, it seems somewhere in between Heidegger and Spivak. I lean heavily towards Spivak, i.e. that categories are ontologies (<a href=\"https://math.mit.edu/~dspivak/informatics/olog.pdf\">ologs</a>). In my view, <em>any</em> structured collection of things form an ontology. So categories, but also spaces, groups, sSets, etc. In this sense, I naively agree with the notion that \"mathematics = ontology\". Again, I'm not actually sure this is how Badiou sees ontology, and to be perfectly transparent I have not yet finished the book.</p>\n<p>It seems to me that the goal of HoTT, and other modern foundations, is to ontologize mathematics: Turning the nebulous \"proof statements\" of math, into <em>things</em> (objects, like spaces) inside of ontologies (higher/formal categories). </p>\n<p>In this sense, would you agree or disagree with the statement that \"Ontology = Mathematics\" or even \"Ontology <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>≃</mo></mrow><annotation encoding=\"application/x-tex\">\\simeq</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4637em;\"></span><span class=\"mrel\">≃</span></span></span></span> Mathematics\"?</p>",
        "id": 390548683,
        "sender_full_name": "Noah Chrein",
        "timestamp": 1694533787
    },
    {
        "content": "<p>I like Badiou but I haven’t finished Being and Event. I somewhat disagree with the association he makes: I assume ontology and epistemology (ways of knowing) are equal, something which I’m not quite ready to divorce from mathematics.</p>\n<p>I don’t place philosophy second to mathematics. I think rather they are “dual” ways of thinking and explaining that are forced to be separate by historical and material processes (the different priorities of societies in which each developed, changing ways of organizing knowledge, the priorities and organization of the academy)</p>",
        "id": 390564345,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1694539234
    },
    {
        "content": "<p>ultimately i think Badiou is making an effort into mathematics not many other philosophers else did and should be encouraged, but i was confused after my first pass at his formalism. i think he has something to say, and then looks to mathematics to say it, rather than examine the differences between both ways of explanation. from what I remember, this is capital-F Formalism: using formal expression to replace the content of your argument. </p>\n<p>a caveat: a lot of this is based off of my memory from when i wanted to take a critical look from a mathematical and philosophical point of view.</p>",
        "id": 390564999,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1694539516
    },
    {
        "content": "<p>When I say \"mathematics first\" I mean I'm more praticed in math than philosophy.</p>\n<p>I too encourage philosophers to brave into mathematics.</p>\n<p>Yes this capital F-Formalism is where category theory helps, identifying certain  statements with structure. </p>\n<p>Does Epistemology=ontology=math? this seems to imply that the mind is purely physical.</p>",
        "id": 390584292,
        "sender_full_name": "Noah Chrein",
        "timestamp": 1694547373
    },
    {
        "content": "<p>I recognize formalism has handy for, as you say, identifying structure in certain statements, but I recognize capital-F Formalism as an error: for me, it means an over-valuation of formal presentation. I think that’s why a lot of mathematicians reading Badiou find it somewhat distasteful.  some philosophers (Lacan, e.g,) have had a tendency to be formalistic in this way.</p>",
        "id": 390585146,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1694547782
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277976\">Noah Chrein</span> <a href=\"#narrow/stream/229134-philosophy/topic/Mathematics.20.3D.20Ontology.20.28Badiou.29/near/390584292\">said</a>:</p>\n<blockquote>\n<p>When I say \"mathematics first\" I mean I'm more praticed in math than philosophy.</p>\n<p>I too encourage philosophers to brave into mathematics.</p>\n<p>Yes this capital F-Formalism is where category theory helps, identifying certain  statements with structure. </p>\n<p>Does Epistemology=ontology=math? this seems to imply that the mind is purely physical.</p>\n</blockquote>\n<p>Good q, but I don’t think of epistemology and ontology as “equal,” but in a constant tension with one another. whether ontology “equals” or is “equivalent” to math is another question</p>",
        "id": 390585462,
        "sender_full_name": "Matt Cuffaro (he/him)",
        "timestamp": 1694547949
    },
    {
        "content": "<p>Okay good, it's yet to be settled for me as well. </p>\n<p>It seems from my perspective that Philosophy has a bad taste for \"Formalism\" because past formalisms usually meant tons of error and hence loss of human life. Maybe in the future, our models will accommodate for all the small complexities. Maybe even those that govern the mind. </p>\n<p>Maybe after we solve for the mind, we will find there to be a zoo of cognitive structures. Whence <br>\nmath &amp; epistomogy <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>↪</mo></mrow><annotation encoding=\"application/x-tex\">\\hookrightarrow</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.522em;vertical-align:-0.011em;\"></span><span class=\"mrel\">↪</span></span></span></span> ontology</p>",
        "id": 390587848,
        "sender_full_name": "Noah Chrein",
        "timestamp": 1694548985
    },
    {
        "content": "<p>I read some of Badiou's later stuff, where he incorporates elements of topos theory, years ago during my Masters. I was very critical of it, not just for the Formalism problem <span class=\"user-mention\" data-user-id=\"275940\">@Matt Cuffaro (he/him)</span> describes but because he imports concepts from topos theory as-is, without due consideration for whether they are appropriate. That is, he talks about why the ingredients of topos theory are important for his philosophical development without properly addressing how they're relevant.</p>",
        "id": 390671031,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1694593157
    }
]