[
    {
        "content": "<p>I'm looking to form a research network, called something like PhACT (Philosophically-Applied Category Theory), aimed at encouraging dialogue between the ACT and philosophical communities. So, for instance, where there is plenty of ACT work looking to capture causal relations in causal network, there is also decades of work in philosophy on causality, e.g., discussion on different conceptions in Regularity theory, Probabilistic theory, Counterfactual theory, Interventionist theory, Process theory,... The idea then is for some mutually beneficial exchange, where philosophy gains by taking on a powerful formalism. Anyone interested in such a network?</p>",
        "id": 343094203,
        "sender_full_name": "David Corfield",
        "timestamp": 1679312528
    },
    {
        "content": "<p>It's an interesting idea.  Since you and I are both on the n-Cafe and we're both interested in ACT and philosophy it would theoretically make sense for us to work on this.  However, since retirement I've been trying to hole up and finish half-finished projects.  I try to be on 'steering boards' where I give occasional advice and don't do any actual work... but sometimes this backfires, as you  can see on thread about <em>Compositionality</em>, where I've gotten pulled in to help the journal: some actual work.</p>",
        "id": 343248802,
        "sender_full_name": "John Baez",
        "timestamp": 1679356791
    },
    {
        "content": "<p>It would be great if there were some younger, more ambitious ACTists who wanted to organize interactions with philosophers.   It feels like there should be some!  But I won't name names here, for fear of putting them on the spot.</p>",
        "id": 343249187,
        "sender_full_name": "John Baez",
        "timestamp": 1679356972
    },
    {
        "content": "<p>Do you have ideas for what the research network might do, concretely?</p>",
        "id": 343249247,
        "sender_full_name": "John Baez",
        "timestamp": 1679357031
    },
    {
        "content": "<p>Apply for grants?   Hold workshops?   Talk online?   Talk about what to do?</p>",
        "id": 343249619,
        "sender_full_name": "John Baez",
        "timestamp": 1679357202
    },
    {
        "content": "<p>Some concrete suggestions might get some people energized.</p>",
        "id": 343249741,
        "sender_full_name": "John Baez",
        "timestamp": 1679357277
    }
]