[
    {
        "content": "<p>I'm looking to form a research network, called something like PhACT (Philosophically-Applied Category Theory), aimed at encouraging dialogue between the ACT and philosophical communities. So, for instance, where there is plenty of ACT work looking to capture causal relations in causal network, there is also decades of work in philosophy on causality, e.g., discussion on different conceptions in Regularity theory, Probabilistic theory, Counterfactual theory, Interventionist theory, Process theory,... The idea then is for some mutually beneficial exchange, where philosophy gains by taking on a powerful formalism. Anyone interested in such a network?</p>",
        "id": 343094203,
        "sender_full_name": "David Corfield",
        "timestamp": 1679312528
    },
    {
        "content": "<p>It's an interesting idea.  Since you and I are both on the n-Cafe and we're both interested in ACT and philosophy it would theoretically make sense for us to work on this.  However, since retirement I've been trying to hole up and finish half-finished projects.  I try to be on 'steering boards' where I give occasional advice and don't do any actual work... but sometimes this backfires, as you  can see on thread about <em>Compositionality</em>, where I've gotten pulled in to help the journal: some actual work.</p>",
        "id": 343248802,
        "sender_full_name": "John Baez",
        "timestamp": 1679356791
    },
    {
        "content": "<p>It would be great if there were some younger, more ambitious ACTists who wanted to organize interactions with philosophers.   It feels like there should be some!  But I won't name names here, for fear of putting them on the spot.</p>",
        "id": 343249187,
        "sender_full_name": "John Baez",
        "timestamp": 1679356972
    },
    {
        "content": "<p>Do you have ideas for what the research network might do, concretely?</p>",
        "id": 343249247,
        "sender_full_name": "John Baez",
        "timestamp": 1679357031
    },
    {
        "content": "<p>Apply for grants?   Hold workshops?   Talk online?   Talk about what to do?</p>",
        "id": 343249619,
        "sender_full_name": "John Baez",
        "timestamp": 1679357202
    },
    {
        "content": "<p>Some concrete suggestions might get some people energized.</p>",
        "id": 343249741,
        "sender_full_name": "John Baez",
        "timestamp": 1679357277
    },
    {
        "content": "<p>Hmm honestly, I'm super motivated by this project so I'm a young person who is ready to help but I know nothing about managing something like this. But I'm willing to learn and have already dreamt of something like this recently. We could do an online seminar with alternate talks by mathematicians and philosophers and then maybe it will lead to new philosophico-mathematical works!</p>",
        "id": 343259677,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679363573
    },
    {
        "content": "<p>Each time I learn something from a friend who knows more than me about philosophy, I'm so excited and I want to know more about philosophy and how it can help me to understand math!</p>",
        "id": 343260393,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1679364130
    },
    {
        "content": "<p>I'll be looking to apply for some money from my side for networks and research time. Access to non-Humanities funding would certainly be welcome.</p>\n<p>I had a really interesting chat with Evan Patterson yesterday. Plenty of overlap there. I really don't think parts of the shared activity need to look ever so different from just doing ACT.</p>\n<p>One dimension that certainly interests me is a tension between philosophers as to whether scientific theories and scientific inference should be seen as neat or messy. More attention these days is paid to the messy \"middle-range theory\", e.g., epidemiology, ecology. Here there's a robust tangle of practices (for the messy tangle, see p. 313 of Nancy Cartwright's ' Middle-range theory: Without it what could anyone do?' <a href=\"https://ojs.ehu.eus/index.php/THEORIA/article/download/21479/19859\">https://ojs.ehu.eus/index.php/THEORIA/article/download/21479/19859</a>).</p>\n<p>The compositionality inherent in the ACT approaches to networks might provide just the right tools.</p>",
        "id": 343322856,
        "sender_full_name": "David Corfield",
        "timestamp": 1679392946
    },
    {
        "content": "<p>You might try talking a bit more to Brendan Fong.  He tends to be full of good ideas.</p>\n<p>For example, did you know Topos is planning to hire an <a href=\"https://topos.site/files/Topos_Research_Ethicist_Posting.pdf\">ethicist</a>?</p>",
        "id": 343489488,
        "sender_full_name": "John Baez",
        "timestamp": 1679423092
    },
    {
        "content": "<p>An interesting thing about epidemiology is that they make a lot of models that are only supposed to be good enough to provide useful guidance to governments over the next few weeks; they fully accept that such models need to be tinkered with and updated constantly, so it's utterly different than, say, physics.</p>",
        "id": 343490050,
        "sender_full_name": "John Baez",
        "timestamp": 1679423266
    },
    {
        "content": "<p>An interesting pointer is this interview with Tim Berners-Lee on the subject of the Web as philosophical Engineering. If you take it, as I do that the web should have a CT model, you'd end up with a an applied philosophy of the Web using CT.<br>\n<a href=\"https://www.dailymotion.com/video/xfisjf\">https://www.dailymotion.com/video/xfisjf</a></p>",
        "id": 343514845,
        "sender_full_name": "Henry Story",
        "timestamp": 1679430772
    },
    {
        "content": "<blockquote>\n<p>For example, did you know Topos is planning to hire an <a href=\"https://topos.site/files/Topos_Research_Ethicist_Posting.pdf\">ethicist</a>?</p>\n</blockquote>\n<p>By the way, <span class=\"user-mention\" data-user-id=\"302507\">@David Corfield</span> - maybe you've already noticed, but the most violent arguments here on Zulip involve the ethics of applied category theory.   So while ACT can probably help philosophy in various ways, perhaps the main way ACT needs help from philosophy involves ethics.    (Or perhaps we're doomed to settle ethical questions by mud-wrestling, and wise philosophers will avoid the mud-pit.)</p>",
        "id": 343516597,
        "sender_full_name": "John Baez",
        "timestamp": 1679431232
    }
]