[
    {
        "content": "<p>A behavioral pattern of a being is a directed-graph of events (morphisms) in a topos of situations (objects). The topos is generated by \"dimensions,\" i.e., ground-symbol types in Bell's terminology. These include, e.g., time and space and any other kind of values needed for expressing an intuitive-model. A situation is basically a point in a finite product of dimensions, so could include the positions, orientations, and shapes of chunks of matter. Chunks could be things, or they could be beings. The topos is equipped with additional structure, including enough for a real numbers object, and its unit interval. That provides enough formulas for stochastic processes to be defined. In particular, each event has a \"propensity\" leading from the domain situation to the codomain situation with a certain probability in a certain amount of time. (This is enough for a categorical generalization of the Gillespie Stochastic Simulation Algorithm.) That is called a propensity. In other words, every situation has a propensity to transition to some subsequent situation.  What makes a being a being and not a thing is that beings have a non-zero probability (but no guarantee) of reproducing. Reproduction is the result of breaking bonds between chunks (e.g., cutting the umbilical cord). Development (e.g., the Life Cycle) is determined by DNA, in the sense that all the macromolecules in a being are generated according to the genotype. The events in a behavioral pattern are called its \"means.\" Beings are the meaning of Life, and the purpose of Life is more beings. </p>\n<p>Let me know if anyone would like to download the glossary (4 pages) of the draft research report , \"Microlectics, Mathematics, and Life.\" Microlectics and the intuitive-model it expresses requires some mastery of its microlect, hence the glossary.</p>",
        "id": 294431550,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1660996736
    },
    {
        "content": "<p>Theorem. If Life is all beings, and Life must persist, and all beings die, and the physical development of a being is determined by a particular DNA macromolecule, then there exists Darwinian Evolution of beings (blind variation, selective retention, and reproduction).</p>\n<p>Proof. FIRST TRY. If there must be beings, and all beings die, then beings must replicate. The probability of replicating could be thwarted by the situation. For example, situations resulting from encounters of beings with other chunks (especially other beings). The more beings, the more encounters. Yet Life must keep going, so different variations of the same starting DNA are more or less selected for reproduction. It is not only that Life must keep going, it must keep going in any way it can. Different kinds of beings result from the different ways. More encounters with more different kinds of beings (and things) select for greater complexity of intuitive-models in minds of beings, and hence of their expression. (Did dance predate speech in some way?) End FIRST TRY.</p>\n<p>Today we have macrolects (i.e., natural language) and microlects (specialized key-terms plus special-symbols plus special equations or diagrams). Mathematical-microlects include proofs. Formal-microlects are without inference-rules. Symbolic-microlects are verbal-microlects plus special symbols. Verbal-microlelcts are sub-languages of macrolects, plus key-term declarations. Then, there are diagrammatic- microlects, and there are behavioral-microlects (e.g., dance styles such as rhumba and flamenco,...; e.g., sports,...; e.g., laboratory protocols;...).</p>\n<p>SECOND TRY. The assumption that Life is infinite while beings are finite, implies that somehow new beings are created. One way would be that they come out of thin air. Another way, the preferred way to think about it, is that somehow one being becomes two beings by breaking physical bonds. This is preferred because here we are in that way. Every kind of Life can occur, modulo fatalities due to encounters. The more kinds of Life there are, the more varied are the encounters. Hence, the evolution of complex Life. So complex, indeed, that it can resonate with the intuitive-model expressed by what you are reading in its verbal-microlect. End SECOND TRY.</p>\n<p>Whether there is or could be a physical theory that predicts that Life according to the postulates (or \"Laws\") predicated herein, is a hard question. That goes to the questions of \"reductionism.\"</p>\n<p>Another question is whether morality of some kind is derivable from postulating only that Life must persist even though beings are finite. Is it enough to say that whatever thwarts Life on the whole is \"bad,\" and that whatever enhances Life on the whole is \"good\"? How could one tell the good from the bad from such a view of Life, which is on time-scales from the cosmological to the macromolecular? Perhaps the best one can do is make guesses based on using a major part of one's finite being to learn as much as possible about Life as a whole. The more intuitive-models, the wider the options for expressing oneself.</p>",
        "id": 294540732,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1661086277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-theory.3A-biology/topic/microlectics.2C.20mathematics.2C.20and.20life/near/294540732\">said</a>:</p>\n<blockquote>\n<p>Proof. FIRST TRY. If there must be beings, and all beings die, then beings must replicate. </p>\n<p>SECOND TRY. The assumption that Life is infinite while beings are finite, implies that somehow new beings are created. One way would be that they come out of thin air. Another way, the preferred way to think about it, is that somehow one being becomes two beings by breaking physical bonds. This is preferred because here we are in that way.</p>\n</blockquote>\n<p>This isn't how proof works. Observing that \"we are in that way\" or that one option is \"preferred\" doesn't cut it; you have to incorporate that constraint into your assumptions in order to rule out the others. How have you eliminated the possibility that beings are spontaneously created? If there was a first being, how did it arise other than spontaneous creation?</p>\n<p>You also haven't imposed the constraint that there are finitely many beings, which leaves open the possibility that although each being has a finite existence, the length of that existence is unbounded: there could be an infinite number of beings starting life at the same time, such that being <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> lasts at least <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> seconds, and that still satisfies infinite extent in time, even though each individual eventually dies.</p>",
        "id": 294543095,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1661087714
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> <br>\n&lt;&lt;Observing that \"we are in that way\" or that one option is \"preferred\" doesn't cut it; you have to incorporate that constraint into your assumptions in order to rule out the others.&gt; &gt;</p>\n<p>Fine, thank you, that rhetorical, facetious flourish should and shall be removed with prejudice.</p>\n<p>&lt;&lt;How have you eliminated the possibility that beings are spontaneously created? &gt;&gt;</p>\n<p>The way I am proceeding is inspired by Imre Lakatos. \"Imre Lakatos’ influential essay Proofs and Refutations. It’s written as a dialogue between fictional students and teacher, as they discover and prove (and disprove?) Euler’s V − E + F = 2 formula ... One of Lakatos’ goals in writing this dialogue was to argue that mathematics is a dynamic process and that proofs and discoveries are not final, immutable, bulletproof kernels of truth. Mathematics proceeds through a dialogue.\" (<a href=\"https://math.berkeley.edu/~kpmann/Lakatos.pdf\">https://math.berkeley.edu/~kpmann/Lakatos.pdf</a>)</p>\n<p>My postulates are supposed to express an intuitive-model of Life as a whole. It is obvious to me that \"spontaneous generation\" is a non-starter. It is also obvious to me that I had parents and that I am a parent. And that every being I ever heard of was and is and will be like that. Some postulates are supposed to (ultimately formally) express the obvious. Like, \"two distinct points determine a straight line\" in Hilbert's axiomatization of Euclidean geometry. He didn't have to eliminate the possibility that one point determines a straight line. Then again, the parallel postulate has not been so obvious, but it is a really good assumption for many deductions. Nor is my \"law\" that \"multiple-realizability is ubiquitous in Life and implies strong-emergence of purpose\" at all obvious, even if one had careful definitions of the key-terms (as yet there is no mathematical-microlect in which those key-terms are well-defined, but that is one objective of my work).</p>\n<p>&lt;&lt;If there was a first being, how did it arise other than spontaneous creation?&gt;&gt;<br>\nThe \"laws\" I propose are not about origins but about what is. Life is all beings, however it started. The axioms that define a topos, for example, tell you nothing about a \"first topos.\"</p>\n<p>&lt;&lt;You also haven't imposed the constraint that there are finitely many beings, which leaves open the possibility that although each being has a finite existence, the length of that existence is unbounded: there could be an infinite number of beings starting life at the same time, such that being <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> lasts at least <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> seconds, and that still satisfies infinite extent in time, even though each individual eventually dies.&gt;&gt;</p>\n<p>Right. How about this: \"In any finite interval of time there are at most a finite number of beings.\"</p>",
        "id": 294564018,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1661100742
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"319799\">Ellis D. Cooper</span> <a href=\"#narrow/stream/336415-theory.3A-biology/topic/microlectics.2C.20mathematics.2C.20and.20life/near/294564018\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>How have you eliminated the possibility that beings are spontaneously created?</p>\n</blockquote>\n<p>The way I am proceeding is inspired by Imre Lakatos’ influential essay Proofs and Refutations.</p>\n</blockquote>\n<p>I like that dialogue very much, and I am happy to act as the students do in attacking your attempts at proof. On the other hand, I do not like the teacher's identification of the term \"proof\" with \"thought experiment\". The standard for proofs has been raised to a demand of rigour in the time since Cauchy's \"proof\" of Euler's formula in the 19th century.</p>\n<blockquote>\n<p>My postulates are supposed to express an intuitive-model of Life as a whole. It is obvious to me that \"spontaneous generation\" is a non-starter. It is also obvious to me that I had parents and that I am a parent. And that every being I ever heard of was and is and will be like that. Some postulates are supposed to (ultimately formally) express the obvious. Like, \"two distinct points determine a straight line\" in Hilbert's axiomatization of Euclidean geometry. He didn't have to eliminate the possibility that one point determines a straight line.</p>\n</blockquote>\n<p>If these things are obvious to you, why do they not feature in your laws? All results of Euclidean geometry can be proved from Hilbert's axioms with no supplementary assertions of what is \"obvious\". One <em>can</em> eliminate using Hilbert's axioms the possibility that there is some point which lies on a unique line (which I presume is what you mean by \"determines\").</p>\n<blockquote>\n<p>Then again, the parallel postulate has not been so obvious, but it is a really good assumption for many deductions. Nor is my \"law\" that \"multiple-realizability is ubiquitous in Life and implies strong-emergence of purpose\" at all obvious, even if one had careful definitions of the key-terms (as yet there is no mathematical-microlect in which those key-terms are well-defined, but that is one objective of my work).</p>\n</blockquote>\n<p>The parallel postulate is \"obvious\" for an axiomatization that is intended to abstract plane geometry; it's just an observation about how lines behave in the plane. What's not obvious is that it is independent (not derivable from) the other axioms, and it took the discovery of other geometries to realize that. Your fifth law, on the other hand, doesn't seem like an intuitive property of life; it even seems superficially like a very strong assumption about the nature of life.</p>\n<blockquote>\n<blockquote>\n<p>If there was a first being, how did it arise other than spontaneous creation?</p>\n</blockquote>\n<p>The \"laws\" I propose are not about origins but about what is. Life is all beings, however it started. The axioms that define a topos, for example, tell you nothing about a \"first topos.\"</p>\n</blockquote>\n<p>Are you proposing that life has existed for all of time? If so, I expect this will be disputed. If not, then at some point in time, life was spontaneously created (replication not being an option). Given this initial case, how can you eliminate the possibility that this spontaneous creation event isn't still happening periodically? For example, if a scientist designs a strand of DNA, builds it and generates an organism from it, that organism has no parents. Is it not a being, then?<br>\nYou claim to be building a theory of biology, a scientific theory, so your ideas should correspond to reality (which is the source of your intuition about life, after all). Topos theory is not held to the same expectations of corresponding to reality.</p>\n<blockquote>\n<blockquote>\n<p>You also haven't imposed the constraint that there are finitely many beings, which leaves open the possibility that although each being has a finite existence, the length of that existence is unbounded: there could be an infinite number of beings starting life at the same time, such that being <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> lasts at least <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>n</mi></mrow><annotation encoding=\"application/x-tex\">n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">n</span></span></span></span> seconds, and that still satisfies infinite extent in time, even though each individual eventually dies.</p>\n</blockquote>\n<p>Right. How about this: \"In any finite interval of time there are at most a finite number of beings.\"</p>\n</blockquote>\n<p>Will this be your sixth law?</p>",
        "id": 294627830,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1661156885
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span> <br>\nMany thanks, Sir, for participating in this dialogue.<br>\nTHIRD TRY:</p>\n<p>World is a mathematical-structure with DATA: the set of all things, and the set of all encounters between things, in spacetime. CONDITIONS: (W1) The beginning of Life, i.e., creation of the first-beings, results from bond-making between things. (W2) Things do not die.</p>\n<p>Life is a mathematical-structure with DATA: the set of all beings and the set of all encounters between beings and things, and between beings and beings, in spacetime. CONDITIONS: (L1) All beings die with certainty. (L2) With positive probability, Life never ends. (L3) Subsequent to the first-beings, new beings result only from bond-breaking within a being. (L4) Every being has a Life-cycle based on  DNA macromolecules.</p>\n<p>\"Encounter,\" \"bond-making,\" and \"bond-breaking\" are events in spacetime. There does exist a topos-theoretic mathematical definition of \"event\" in \"spacetime\" but that may best be left aside for now (it is detailed in the draft Research Report, and in the Glossary). \"DNA macromolecule\" and \"Life-cycle\" are well-documented in the biology literature. </p>\n<p>Also for now it is best to leave aside philosopher terms such as \"multiple-realizability\" and \"strong-emergence,\" let alone distinctions between \"supervenience,\" \"theory reductionism,\" \"explanatory reductionism,\" and \"constitutive reductionism.\"</p>",
        "id": 294874378,
        "sender_full_name": "Ellis D. Cooper",
        "timestamp": 1661264196
    },
    {
        "content": "<p>For (W2), is this a consequence of semantics, that a thing must be alive at some point in order to \"die\"?<br>\nFor (L3), that doesn't address the example I gave of how spontaneous production could occur (via the same process that originated life or by artificial cloning/production of DNA).<br>\nThanks for labelling the assumptions, it makes referring to them a lot easier!<br>\nDo \"encounters\" affect the \"life-cycle\" of beings?</p>",
        "id": 294994729,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1661327028
    }
]