[
    {
        "content": "<p>I've been trying to learn ZX-calculus for a while. While the calculus itself is quite straightforwadd, I find it a bit confusing when I try to connect it with category theory that I already know. Sure, I know it's a string diagram-like language, but sometimes I find the structures in ZX-calculus a bit inadequately defined. Of course, some correspond directly to category theory, e.g. monoids and comonoids. But sometimes that is not the case e.g. when it comes to spiders, they seem to be kind of similar to but definitely not the same as operads, which leaves me kind of confused coming from a CT background.</p>\n<p>So, the question is, is there a sort of dictionary that translates structures in the ZX-caculus to standard category theory structures? I read in many places that the ZX-calculus basically corresponds to dagger-compact categories but most of it seems to be folklore.</p>",
        "id": 376870155,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1689837462
    },
    {
        "content": "<p>The ZX calculus is an <em>example</em> of a dagger-compact category, presented using generators and relations.  I wouldn't say it \"corresponds to dagger-compact categories\".</p>",
        "id": 376888621,
        "sender_full_name": "John Baez",
        "timestamp": 1689841982
    },
    {
        "content": "<p>The spiders in the ZX calculus, and their basic properties, arise from the fact that this dagger-compact category is a <a href=\"https://ncatlab.org/nlab/show/hypergraph%20category\">[[hypergraph category]]</a>.</p>",
        "id": 376889225,
        "sender_full_name": "John Baez",
        "timestamp": 1689842109
    },
    {
        "content": "<p>The nLab has a pretty good explanation of hypergraph categories, but I recommend Fong and Spivak's paper, the last reference on that page, for a deep conceptual explanation - which is also sketched on the nLab page.</p>",
        "id": 376890148,
        "sender_full_name": "John Baez",
        "timestamp": 1689842317
    },
    {
        "content": "<p>Hypergraph categories seem confusing at first, since every object is a <a href=\"https://ncatlab.org/nlab/show/Frobenius%20monoid\">[[Frobenius monoid]]</a> in a way <em>not</em> preserved by morphisms.  But they are extremely important in applications to networks, so it's good to see a conceptual explanation.</p>",
        "id": 376891229,
        "sender_full_name": "John Baez",
        "timestamp": 1689842550
    },
    {
        "content": "<p>I have trouble believing that the key facts concerning the ZX calculus are \"mostly folklore\" because there are a lot of nice papers and theses about it, leading up to the completenesd theorem, but I'm not an expert on these.  I vaguely imagine <span class=\"user-mention\" data-user-id=\"295673\">@Aleks Kissinger</span> wrote s useful thesis about this stuff.</p>",
        "id": 376910232,
        "sender_full_name": "John Baez",
        "timestamp": 1689846165
    },
    {
        "content": "<p>For example this should explain the point of \"spiders\" to some extent:</p>\n<p><a href=\"https://arxiv.org/abs/1406.5942\">https://arxiv.org/abs/1406.5942</a></p>",
        "id": 376927146,
        "sender_full_name": "John Baez",
        "timestamp": 1689849549
    },
    {
        "content": "<p>See for example Thm. 2.3, the \"spider theorem\".</p>",
        "id": 376956917,
        "sender_full_name": "John Baez",
        "timestamp": 1689855473
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/ZX-calculus.20for.20category.20theorists/near/376910232\">said</a>:</p>\n<blockquote>\n<p>I have trouble believing that the key facts concerning the ZX calculus are \"mostly folklore\" because there are a lot of nice papers and theses about it, leading up to the completenesd theorem, but I'm not an expert on these.  I vaguely imagine <span class=\"user-mention silent\" data-user-id=\"295673\">Aleks Kissinger</span> wrote s useful thesis about this stuff.</p>\n</blockquote>\n<p>or perhaps it's the opposite, there are just too many papers! in which case I'm having trouble maneuvering the literature... Thanks for the pointers though!</p>",
        "id": 376974374,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1689858872
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/251538-theory.3A-physics/topic/ZX-calculus.20for.20category.20theorists/near/376888621\">said</a>:</p>\n<blockquote>\n<p>The ZX calculus is an <em>example</em> of a dagger-compact category, presented using generators and relations.  I wouldn't say it \"corresponds to dagger-compact categories\".</p>\n</blockquote>\n<p>Ah, that makes more sense to me now, thanks. Coming from algebra I have no understanding of hypergraph categories at all and they indeed confuse me, I'll try Fong &amp; Spivak's paper</p>",
        "id": 376975239,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1689859039
    },
    {
        "content": "<p>but perhaps the ZX-calculus is not for me after all! I suppose a lot of it can just be done at the more general level of (arbitrary?) dagger-compact categories?</p>",
        "id": 376975864,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1689859149
    },
    {
        "content": "<p>The ZX calculus is a specific dagger-compact category, presented by generators and relations, which is useful in quantum computation: the various generators can in theory be implemented as 'quantum gates' and you can build bigger circuits from these by composing and tensoring them.  If you're not interested in applications of category theory to quantum computation or the math of finite-dimensional Hilbert spaces then the ZX calculus is probably not for you.... except perhaps as a nice example of many ideas like dagger-compact categories, Frobenius algebras, hypergraph categories, the spider theorem, etc.</p>",
        "id": 376986455,
        "sender_full_name": "John Baez",
        "timestamp": 1689861091
    },
    {
        "content": "<blockquote>\n<p>I suppose a lot of it can just be done at the more general level of (arbitrary?) dagger-compact categories?</p>\n</blockquote>\n<p>That depends on what \"it\" is.</p>",
        "id": 376986688,
        "sender_full_name": "John Baez",
        "timestamp": 1689861141
    },
    {
        "content": "<p>What are you trying to do, or understand?</p>",
        "id": 376987638,
        "sender_full_name": "John Baez",
        "timestamp": 1689861331
    },
    {
        "content": "<p>I'm trying to use quantum computation as a vehicle to test/flesh out some of my ideas relating to linear logic, and my understanding so far is that quantum programs can be written in some kind of linear logic-based language :-) Maybe I'm looking for something akin to QWIRE?</p>",
        "id": 376988747,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1689861568
    },
    {
        "content": "<p>so indeed I'm not trying to study FdHilb per se! I'm looking at it as an example of some class of \"nice\" symmetric monoidal categories</p>",
        "id": 376990286,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1689861843
    },
    {
        "content": "<p>Quantum programs are different than quantum circuits much as ordinary programs are different than ordinary electrical circuits.   </p>\n<p>You can think of the ZX calculus as describing a bunch of building blocks for quantum circuits, much as you might build ordinary circuits from resistors, capacitors, transistors etc.   To understand the general category theory concepts behind the ZX calculus I recommend studying hypergraph categories.</p>\n<p>If instead what you want is a \"quantum programming language\" inspired by category theory, you might look at <a href=\"https://arxiv.org/abs/1706.02630\">A categorical model for a quantum circuit description language</a>:</p>\n<blockquote>\n<p>Quipper is a practical programming language for describing families of quantum circuits. In this paper, we formalize a small, but useful fragment of Quipper called Proto-Quipper-M. Unlike its parent Quipper, this language is type-safe and has a formal denotational and operational semantics. Proto-Quipper-M is also more general than Quipper, in that it can describe families of morphisms in any symmetric monoidal category, of which quantum circuits are but one example. We design Proto-Quipper-M from the ground up, by first giving a general categorical model of parameters and state.</p>\n</blockquote>\n<p>There are also a lot of resources on <a href=\"https://www.mathstat.dal.ca/~selinger/quipper/\">Quipper</a>, but this language is more \"practical\" and - it seems to me - more complicated.</p>",
        "id": 377001734,
        "sender_full_name": "John Baez",
        "timestamp": 1689863644
    },
    {
        "content": "<p>If you're really focused on linear logic (which may not actually be optimal for studying quantum computation) you might try <a href=\"https://arxiv.org/abs/1210.0613\">On multiplicative linear logic, modality and quantum circuits</a>.</p>",
        "id": 377004262,
        "sender_full_name": "John Baez",
        "timestamp": 1689863932
    },
    {
        "content": "<p>Thanks, I'll take a look!</p>",
        "id": 377004552,
        "sender_full_name": "Xuanrui Qi",
        "timestamp": 1689863971
    },
    {
        "content": "<p>If you are interested in a more algebra-flavored string diagram calculus that involves spiders, you might take a look at <span class=\"user-mention\" data-user-id=\"281251\">@Pawel Sobocinski</span>'s <a href=\"https://graphicallinearalgebra.net\">Graphical Linear Algebra blog</a>.  That might help build some intuition that can be used with the ZX calculus.</p>",
        "id": 377125979,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1689892235
    },
    {
        "content": "<p>Though if you're not really interested in the ZX calculus after all, I think John's suggestions will be more on target for what your goals seem to be.</p>",
        "id": 377126056,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1689892275
    }
]