[
    {
        "content": "<p>Is there a way to thinkg about regular grammars, context-free grammars and context-sensitive grammars in terms of categories?</p>\n<p>A regular grammar is representered by a finite (weighted) automata which is ~= a group representation of the free monoid on a finite alphabet I think? <br>\nSo it might make sense taht context-sensitive grammars might be related to representations of categories maybe?<br>\nThankful for any pointers</p>",
        "id": 390054680,
        "sender_full_name": "Alexander Gietelink Oldenziel",
        "timestamp": 1694283052
    },
    {
        "content": "<p>This may not answer your question exactly, but this paper may contain some related ideas which interest you: <br>\n<a href=\"https://arxiv.org/abs/2212.09060\">Parsing as a lifting problem and the Chomsky-Schützenberger representation theorem</a> - Paul-André Melliès, Noam Zeilberger</p>",
        "id": 390056711,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1694285238
    },
    {
        "content": "<p>Eilenberg's work on category theory, grammars and automata, and subsequent followups, seem relevant.  <a href=\"https://math.stackexchange.com/questions/105091/eilenbergs-rational-hierarchy-of-nonrational-automata-languages\">David Lewis</a> wrote:</p>\n<blockquote>\n<p>In the preface to his very influential books <em>Automata, Languages and Machines</em> (Volumes A, B), Samuel Eilenberg tantalizingly promised a Volume C dealing with \"a hierarchy (called the rational hierarchy) of the nonrational phenomena... using rational relations as a tool for comparison. Rational sets are at the bottom of this hierarchy. Moving upward one encounters 'algebraic phenomena,'\" which lead to \"to the context-free grammars and context-free languages of Chomsky, and to several related topics.\"</p>\n</blockquote>\n<blockquote>\n<p>But Eilenberg never published volume C. He did leave preliminary handwritten notes for the first few chapters (<a href=\"http://www-igm.univ-mlv.fr/~berstel/EilenbergVolumeC.html\">http://www-igm.univ-mlv.fr/~berstel/EilenbergVolumeC.html</a>) complete with scratchouts, question marks, side notes and gaps.</p>\n</blockquote>\n<blockquote>\n<p>Finally, the question -- does anyone know of work along the same lines to possibly reconstruct what Eilenberg had in mind? If not, what material is likely closest to his ideas?</p>\n</blockquote>\n<p>J.-E. Pin replied:</p>\n<blockquote>\n<p>It would be hazardous to guess what Eilenberg had in mind, but a reasonable answer to your question </p>\n<blockquote>\n<p>What material is likely closest to his ideas?</p>\n</blockquote>\n<p>might be the theory of <a href=\"http://en.wikipedia.org/wiki/Cone_(formal_languages)\">cones</a> (also called <a href=\"http://en.wikipedia.org/wiki/Abstract_family_of_languages\">full trios</a>).  An excellent reference on the part of this theory related to context-free languages is Berstel's book <em><a href=\"http://www-igm.univ-mlv.fr/~berstel/LivreTransductions/Transductions_1979.djvu\">Transductions and Context-Free Languages</a></em>, Teuber 1979.</p>\n<p>An alternative answer (still for context-free languages) can be found in the little known but very inspiring article by J. Berstel and L. Boasson, <a href=\"http://www-igm.univ-mlv.fr/~berstel/Articles/1996AlgebraicTheory.pdf\">Towards an algebraic theory of context-free languages</a>, 1996, Fundamenta Informaticae, 25(3):217-239, 1996.</p>\n<p>To quote your introduction, the first reference is using \"rational relations as a tool for comparison\" and the second one really \"encounters algebraic phenomena which lead to the context-free grammars and context-free languages\".</p>\n</blockquote>",
        "id": 390056935,
        "sender_full_name": "John Baez",
        "timestamp": 1694285476
    },
    {
        "content": "<p>Micha&euml;l Cadilhac provided another reference:</p>\n<blockquote>\n<p>I recommend Behle, Krebs, and Reifferscheid's recent work on extending Eilenberg's fundamental theorem (that is, the correspondence between pseudovarieties of monoids and varieties of languages) to non-regular languages (<a href=\"https://doi.org/10.1007/978-3-642-21493-6_6\">link</a>).  They point out previous works in this line (in particular, Sakarovitch's on CFL).</p>\n</blockquote>",
        "id": 390057142,
        "sender_full_name": "John Baez",
        "timestamp": 1694285673
    },
    {
        "content": "<p>I would like to study this stuff sometime.</p>",
        "id": 390057166,
        "sender_full_name": "John Baez",
        "timestamp": 1694285713
    },
    {
        "content": "<p>Also possibly relevant is this paper on generalizations of regular grammars by <span class=\"user-mention\" data-user-id=\"277812\">@Matt Earnshaw</span>  and <span class=\"user-mention\" data-user-id=\"281251\">@Pawel Sobocinski</span>:<br>\n<a href=\"https://arxiv.org/abs/2207.00526\">https://arxiv.org/abs/2207.00526</a></p>",
        "id": 390078943,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1694306824
    }
]