[
    {
        "content": "<p>Can anyone recommend an introduction to category theory that emphasizes the perspective of categories as a kind of algebraic structure, generalizing groups, monoids, and posets?  This perspective is of course present to varying degrees in all introductions; but I'm looking for something that would be maximally accessible to a student with limited background in abstract mathematics, so that many of the \"usual\" examples of large categories would not be familiar.</p>",
        "id": 358770407,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1684251196
    },
    {
        "content": "<p>As someone with a limited background in abstract mathematics, I've found parts of these two fairly accessible:</p>\n<ul>\n<li>\"Notes on Category Theory with examples from basic mathematics\" by Perrone</li>\n<li>\"Seven Sketches in Compositionality: An Invitation to Applied Category Theory\" by Fong and Spivak</li>\n</ul>\n<p>Parts of these books talk about categories in the way you are describing.</p>\n<p>Also, the very first book on categories I looked at was \"Category Theory for Scientists\" by Spivak. This book did a great job at making category theory interesting to me, although the emphasis on \"ologs\" isn't to my preference.</p>\n<p>I haven't looked carefully at this book, but \"The Joy of Abstraction\" by Cheng I think has a few sections focused on examples along the lines you describe above.</p>\n<p>I should also mention \"Algebra: Chapter Zero\" by Aluffi. I find it hard reading, but very rewarding. I'm not sure I would call it \"maximally accessible\", but it does talk a bit about categories in the context of algebra.</p>",
        "id": 358776089,
        "sender_full_name": "David Egolf",
        "timestamp": 1684252408
    },
    {
        "content": "<p>My <a href=\"https://math.ucr.edu/home/baez/qg-winter2016/\">category theory lecture notes</a> has a section called \"Categories as mathematical objects\" on page 6, which is about algebraic gadgets like posets and monoids as categories.  It's very terse and skeletal, with typos, since some students created these notes and I haven't yet gotten around to polishing them. Someday I hope it will do more of what you want, <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>.</p>",
        "id": 358785514,
        "sender_full_name": "John Baez",
        "timestamp": 1684254466
    },
    {
        "content": "<p>But I want this book to ultimately play off the two perspectives against each other: \"categories of mathematical objects\" and \"categories as mathematical objects\".</p>",
        "id": 358787121,
        "sender_full_name": "John Baez",
        "timestamp": 1684254817
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229136-theory.3A-category-theory/topic/introduction.20to.20categories.20as.20algebraic.20gadgets/near/358787121\">said</a>:</p>\n<blockquote>\n<p>But I want this book to ultimately play off the two perspectives against each other: \"categories of mathematical objects\" and \"categories as mathematical objects\".</p>\n</blockquote>\n<p>That sounds interesting! <br>\nBy the way, I'd also be interested in the perspective \"mathematical objects as categories\", which would presumably involve discussing different strategies for constructing categories from mathematical objects, and then studying those objects from the resulting categories.</p>",
        "id": 358813581,
        "sender_full_name": "David Egolf",
        "timestamp": 1684260623
    },
    {
        "content": "<p>I like Part 0 of Lambek--Scott. It's a very efficient 40-page summary of basic category theory, organized by \"slogans\". Slogan II says that many mathematical objects -- such as sets, monoids, and preordered sets -- can be viewed as categories.</p>",
        "id": 358833557,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1684266549
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/stream/229136-theory.3A-category-theory/topic/introduction.20to.20categories.20as.20algebraic.20gadgets/near/358813581\">said</a>:</p>\n<blockquote>\n<p>By the way, I'd also be interested in the perspective \"mathematical objects as categories\", which would presumably involve discussing different strategies for constructing categories from mathematical objects, and then studying those objects from the resulting categories.</p>\n</blockquote>\n<p>There are a lot of results in that direction in various subfields of mathematics: Tannaka--Krein duality, Gabriel--Rosenberg reconstruction, Makkai duality, Grothendieck's Galois theory, ...</p>",
        "id": 358841436,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1684269034
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277503\">@David Egolf</span> As far as I know, the idea of associating to a space its category of sheaves also played a crucial role in the construction of étale cohomology, because it allowed one to use the formalism of derived functors. This in turn was used in the proof of the Weil conjectures. I don't know much about it, but it feels like this is the perfect example of category theory being used in mathematics to prove concrete statements about the number of solutions of polynomial equations (over finite fields).</p>",
        "id": 358844389,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1684270103
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"408864\">@Leopold Schlicht</span>! That's interesting to hear about! Most of the things you've just mentioned go largely over my head, but it's great to have a list of examples I can return to as I learn more.</p>",
        "id": 358845487,
        "sender_full_name": "David Egolf",
        "timestamp": 1684270449
    },
    {
        "content": "<p>They mostly go over my head as well. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> All I know is that your idea of \"constructing categories from mathematical objects, and then studying those objects from the resulting categories\" is used quite heavily in mathematics, and several people got Fields medals for exploiting it. <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 358846905,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1684270962
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277503\">David Egolf</span> <a href=\"#narrow/stream/229136-theory.3A-category-theory/topic/introduction.20to.20categories.20as.20algebraic.20gadgets/near/358813581\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229136-theory.3A-category-theory/topic/introduction.20to.20categories.20as.20algebraic.20gadgets/near/358787121\">said</a>:</p>\n<blockquote>\n<p>But I want this book to ultimately play off the two perspectives against each other: \"categories of mathematical objects\" and \"categories as mathematical objects\".</p>\n</blockquote>\n<p>That sounds interesting! <br>\nBy the way, I'd also be interested in the perspective \"mathematical objects as categories\", which would presumably involve discussing different strategies for constructing categories from mathematical objects, and then studying those objects from the resulting categories.</p>\n</blockquote>\n<p>That's what \"categories as mathematical objects\" was supposed to be about, actually.   Maybe I should say it the other way.   My idea, anyway, was to get people used to thinking of categories not only as \"universes\" like \"the category of all groups\" or \"the category of all posets\", but also as small manageable things just like individual groups and posets and equivalence relations... in part by noticing that groups and posets and equivalence relations <em>are categories!</em></p>",
        "id": 358870952,
        "sender_full_name": "John Baez",
        "timestamp": 1684283423
    }
]