[
    {
        "content": "<p>Hi,</p>\n<p>My name is Ben Sprott </p>\n<p>I was a member of The Perimeter Institute in 2003.  My advisor was Lucien Hardy.  I was a student of and research assistant to Prakash Panangaden in 2009.</p>\n<p>I am working on a derivation of a new form of quantum theory that is relevant to quantum gravity.  It requires a monad composition.  These are very tricky and we have seen Zwart et al. warn against going head on without real care.  I have shown my general framework to a major titan in category theory for probability and he says it is time for me to proceed with applying it to new physics, which is what this post is about.  I would like to invite the community to message me and help me with the monad composition.</p>\n<p>Thanks!</p>\n<p>Ben Sprott</p>",
        "id": 325861238,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1675531489
    },
    {
        "content": "<p>Do you have a specific question?</p>\n<p>Maaike Zwart's <a href=\"https://www.cs.ox.ac.uk/files/12453/MaaikeZwartDPhilThesis.pdf\">thesis</a> has quite a lot of information on how to compose monads from the algebraic perspective, and the references should have just as much on the categorical perspective.</p>\n<p>Another possible place to look is chapter 2 of Alexandre Goy's <a href=\"https://agoy.fr/publication/phd/phd.pdf\">thesis</a> and his <a href=\"https://agoy.fr/publication/goy-22/goy-22.pdf\">paper</a> just in case the monads you are studying do not compose \"perfectly\".</p>",
        "id": 325872071,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1675537567
    },
    {
        "content": "<p>Hey, I just want to keep it a bit secret for now.  I mean, I already have a math overflow about the composition and no one will answer it.  Now, I just want someone to take a personal interest in it and contact me.</p>",
        "id": 325875501,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1675539924
    },
    {
        "content": "<p>Here is the math overflow question:</p>\n<p><a href=\"https://mathoverflow.net/questions/391437/cyclic-lists-of-multisets\">https://mathoverflow.net/questions/391437/cyclic-lists-of-multisets</a></p>",
        "id": 325875597,
        "sender_full_name": "Ben Sprott",
        "timestamp": 1675539999
    }
]