[
    {
        "content": "<p>Hello! I'm brand new to this website and still figuring things out. I am a phd student working on philosophy of physics stuff.</p>",
        "id": 264792514,
        "sender_full_name": "James Possum",
        "timestamp": 1639443126
    },
    {
        "content": "<p>Hello! My name is Srikanth and I am a Ph.D student from India. I joined as a physics student but I am working with a mathematician now. I picked up most of the maths in the last two years.. My primary interests are quantum field theories. I am presently interested in Dijkgraff Witten theory and its applications to representation theory. </p>\n<p>It's great to see so many prolific math expositors at a single place. I wish to learn a lot from this place and try to contribute  whenever I can.</p>",
        "id": 267161016,
        "sender_full_name": "Srikanth Pai B",
        "timestamp": 1641542569
    },
    {
        "content": "<p>Hello all! I am a data guy at a municipal health department, though my bachelor's was in physics. As I have confronted my office's deficiencies in the modeling and control of the knowledge that underlies our work, my curiosity led me to read about categorical databases. This and some self-study rekindled my passion for mathematics, especially Statebox's dazzling introductory CT cram course, taught by the lovely <span class=\"user-mention\" data-user-id=\"276438\">@Fabrizio Genovese</span>  (thanks for the invite!). Roughly my biggest interests are the engineering, and the physics, of information (systems). I am not totally sure where this new phase of math study will take me (I have recently enrolled for part-time, non-degree study with NetMath at UIUC) but so far I have greatly enjoyed the fascinating discussions that take place here.</p>",
        "id": 267252859,
        "sender_full_name": "Samuel Steakley",
        "timestamp": 1641595535
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"452693\">@Samuel Steakley</span>, what a pleasant surprise to see you here!!! :)</p>\n<p>Hello everyone! I'm a PhD student in aerospace engineering. My research is in stochastic dynamical systems, and I'm trying to create <a href=\"https://github.com/drewmcneely/girypy\">a library</a> to represent control and estimation schemes using Markov categories. I asked <span class=\"user-mention\" data-user-id=\"276702\">@Tobias Fritz</span> for some help, and in our discussions he suggested I check this place out.</p>\n<p>There's a lot I want to do with this library, but I'm just starting to expose myself to the work that others have done in monoidal categories. I'm hoping I can utilize some of it!</p>",
        "id": 272350375,
        "sender_full_name": "Drew Allen McNeely",
        "timestamp": 1645149396
    },
    {
        "content": "<p>Nice to see you here, Drew!</p>",
        "id": 272367741,
        "sender_full_name": "Tobias Fritz",
        "timestamp": 1645167933
    },
    {
        "content": "<p>Hi Drew, I'm also interested in Markov categories and conditioning! Have you checked out my little implementation <a href=\"https://github.com/damast93/GaussianInfer\">here</a>? Feel free to let me know if you have specific things in mind with your library</p>",
        "id": 272457142,
        "sender_full_name": "Dario Stein",
        "timestamp": 1645218241
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"309295\">@Dario Stein</span> This is super interesting! Do you plan on extending to other Markov categories aside from <strong>Gauss</strong>? That's what I'm trying to do currently, but I often get stuck.</p>",
        "id": 273018474,
        "sender_full_name": "Drew Allen McNeely",
        "timestamp": 1645654176
    },
    {
        "content": "<p>Hi everyone, I'm a Postdoc in graph theory and computational complexity who's recently started to transition into applied category theory. </p>\n<p>I work on structural graph theory (mostly) and I study so called 'recursive graph decompositions' (i.e. tree-width, clique-width etc etc). Lately my work has started to focus on categorical characterizations and generalizations of these graph-theoretic notions. </p>\n<p>It's pretty cool that this community exists, so thanks for having me! I look forward to meeting you all :)</p>",
        "id": 273074085,
        "sender_full_name": "Benjamin Merlin Bumpus",
        "timestamp": 1645700310
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"481356\">@Benjamin Merlin Bumpus</span>. There was recently some discussion about if/how category theory might be applied to graph theory <a href=\"#narrow/stream/229199-learning.3A-questions/topic/enriched.20graphs\">here</a>. I'm sure people would be interested to hear your perspective.</p>",
        "id": 273080417,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1645704504
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481356\">Benjamin Merlin Bumpus</span> <a href=\"#narrow/stream/229111-general/topic/introduce.20yourself!/near/273074085\">said</a>:</p>\n<blockquote>\n<p>I work on structural graph theory (mostly) and I study so called 'recursive graph decompositions' (i.e. tree-width, clique-width etc etc). Lately my work has started to focus on categorical characterizations and generalizations of these graph-theoretic notions. </p>\n</blockquote>\n<p>Hi! If you don't know the recent paper \"Monoidal width\" (<a href=\"https://arxiv.org/abs/2202.07582\">https://arxiv.org/abs/2202.07582</a>), that's extremely relevant here</p>",
        "id": 273080599,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1645704648
    },
    {
        "content": "<p>Hi Graham, thanks for pointing that out; I'll give it a read!</p>",
        "id": 273083600,
        "sender_full_name": "Benjamin Merlin Bumpus",
        "timestamp": 1645706615
    },
    {
        "content": "<p>and, <span class=\"user-mention\" data-user-id=\"275901\">@Jules Hedges</span> ,  thanks for the link;  I saw this on Twitter last week and it seems rather interesting! <br>\nKocsis and I also considered a similar topic (although our methods are very different from Paweł and Elena's) by introducing 'Spined Categories' (which you can find here: <a href=\"https://arxiv.org/abs/2104.01841\">https://arxiv.org/abs/2104.01841</a>    &lt;---  a new version should hit the arXiv next week)</p>\n<p>(b.t.w. it's my first time using Zulip, so apologies if I'm using it wrong..  are there specific ways for replying to messages that are preferred here?<br>\n)</p>",
        "id": 273083949,
        "sender_full_name": "Benjamin Merlin Bumpus",
        "timestamp": 1645706840
    },
    {
        "content": "<p>Nope<br>\n<span class=\"user-mention silent\" data-user-id=\"481356\">Benjamin Merlin Bumpus</span> <a href=\"#narrow/stream/229111-general/topic/introduce.20yourself!/near/273083949\">said</a>:</p>\n<blockquote>\n<p>(b.t.w. it's my first time using Zulip, so apologies if I'm using it wrong..  are there specific ways for replying to messages that are preferred here?)</p>\n</blockquote>\n<p>No, don't worry, we don't constrain how people chat here for the most part. Welcome!! <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 273155920,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1645740371
    },
    {
        "content": "<p>Hi all! First time on Zulip :) I'm a PhD student in the CDT for Safe and Trusted @ King's &amp; Imperial College London and I'm working with category theory in geometric deep learning - trying to use CT for explainability techniques and finding safe ways of using AI. Generally trying to find out what neural nets are thinking most of the time :) Exciting to be here with the big names!</p>",
        "id": 273539545,
        "sender_full_name": "Mattia Villani",
        "timestamp": 1646075869
    }
]