[
    {
        "content": "<p>Hi everyone, I'm looking for \"popular science\" articles (or something similar) that talk about the Yoneda embedding. I naively assumed that there would be plenty, since it is the only meaningful categorical idea that I know how to convey to people with no math background at all (and in my experience it <em>does</em> tend to sound interesting to those people).</p>\n<p>However I haven't been able to find much along these lines. The only thing that comes to mind now is Eugenia Cheng's <em>The Joy of Abstraction</em>, an amazing book that I have only started reading. The first chapter seems to be very much in line with what I was looking for, but it doesn't tackle the Yoneda embedding heads-on, and of course I was looking for something shorter. I would really appreciate any help in finding this kind of resource!</p>",
        "id": 354474904,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1682788452
    },
    {
        "content": "<p>Emily Riehl gave a tutorial in ACT2020 about the Yoneda lemma using the category of matrices as a focal point. I don't think it's precisely what you're asking for, but it's good anyway.<br>\n<a href=\"https://www.youtube.com/watch?v=SsgEvrDFJsM&amp;ab_channel=AppliedCategoryTheory\">https://www.youtube.com/watch?v=SsgEvrDFJsM&amp;ab_channel=AppliedCategoryTheory</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"SsgEvrDFJsM\" href=\"https://www.youtube.com/watch?v=SsgEvrDFJsM&amp;ab_channel=AppliedCategoryTheory\"><img src=\"https://uploads.zulipusercontent.net/94ce49e77996e0ce8807cd65122afd993a2f814a/68747470733a2f2f692e7974696d672e636f6d2f76692f53736745767244464a734d2f64656661756c742e6a7067\"></a></div>",
        "id": 354478671,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1682789130
    },
    {
        "content": "<p>The best semi-pop explanation of the Yoneda embedding I've seen is this:</p>\n<ul>\n<li>Tai Danae-Bradley, <a href=\"https://www.math3ma.com/blog/the-yoneda-perspective\">The Yoneda perspective</a>.</li>\n</ul>",
        "id": 354481169,
        "sender_full_name": "John Baez",
        "timestamp": 1682789583
    },
    {
        "content": "<p>Quote:</p>\n<blockquote>\n<p>From one side, the sculpture looks like an elephant; from another, it looks like two giraffes. But neither angle gives a full description. To really understand the sculpture, we should view it from all possible vantage points. The same idea holds in category theory: more vantage points give more information. And here's the upshot: the Yoneda lemma implies:‍</p>\n</blockquote>\n<blockquote>\n<p><strong>all</strong> vantage points give <strong>all</strong>  information.</p>\n</blockquote>\n<p>This is the essence of the Yoneda perspective mentioned above, and is one reason why categorically-minded mathematicians place so much emphasis on morphisms, commuting diagrams, universal properties, and the like. (Have you noticed?) It's all about relationships!</p>",
        "id": 354481658,
        "sender_full_name": "John Baez",
        "timestamp": 1682789670
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Looking.20for.20popular.20accounts.20of.20Yoneda/near/354481169\">said</a>:</p>\n<blockquote>\n<p>The best semi-pop explanation of the Yoneda embedding I've seen is this:</p>\n<ul>\n<li>Tai Danae-Bradley, <a href=\"https://www.math3ma.com/blog/the-yoneda-perspective\">The Yoneda perspective</a>.</li>\n</ul>\n</blockquote>\n<p>Thanks for bringing this up! Earlier today I remembered having read this article (and finding it great), but when I went to look it up I was sort of disappointed that it was more mathematically oriented than I remembered. But now I see that I discarded it too quickly:  that passage you quoted is really good! I am writing something along the lines of what I wanted (in Spanish) and I think it might be a good idea to translate/paraphrase Tai-Danae there</p>",
        "id": 354496737,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1682792495
    },
    {
        "content": "<p>Still, I find it surprising that there doesn't seem to be any text online aimed at e.g. Philosophy students, trying to relate the \"Yoneda perspective\" to ideas about things being determined by their relationships to other things, or debates about the existence of intrinsic properties, or essences. Things that people have been talking about for millennia</p>",
        "id": 354512863,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1682795567
    },
    {
        "content": "<p>By \"aimed at Philosophy students\" I don't mean to say a text that engages with specifically philosophical problems, that would be too technical as well... I mean more like \"here, I translate part of what makes this cool to me into a language that philosophically minded people can enjoy and find interesting\" (without necessarily engaging with the problems that could arise from trying to do so rigorously)</p>",
        "id": 354513961,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1682795795
    },
    {
        "content": "<p>I hope you write such an account.</p>",
        "id": 354519685,
        "sender_full_name": "John Baez",
        "timestamp": 1682796856
    }
]