[
    {
        "content": "<p>Hi everyone, I'm looking for \"popular science\" articles (or something similar) that talk about the Yoneda embedding. I naively assumed that there would be plenty, since it is the only meaningful categorical idea that I know how to convey to people with no math background at all (and in my experience it <em>does</em> tend to sound interesting to those people).</p>\n<p>However I haven't been able to find much along these lines. The only thing that comes to mind now is Eugenia Cheng's <em>The Joy of Abstraction</em>, an amazing book that I have only started reading. The first chapter seems to be very much in line with what I was looking for, but it doesn't tackle the Yoneda embedding heads-on, and of course I was looking for something shorter. I would really appreciate any help in finding this kind of resource!</p>",
        "id": 354474904,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1682788452
    },
    {
        "content": "<p>Emily Riehl gave a tutorial in ACT2020 about the Yoneda lemma using the category of matrices as a focal point. I don't think it's precisely what you're asking for, but it's good anyway.<br>\n<a href=\"https://www.youtube.com/watch?v=SsgEvrDFJsM&amp;ab_channel=AppliedCategoryTheory\">https://www.youtube.com/watch?v=SsgEvrDFJsM&amp;ab_channel=AppliedCategoryTheory</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"SsgEvrDFJsM\" href=\"https://www.youtube.com/watch?v=SsgEvrDFJsM&amp;ab_channel=AppliedCategoryTheory\"><img src=\"https://uploads.zulipusercontent.net/94ce49e77996e0ce8807cd65122afd993a2f814a/68747470733a2f2f692e7974696d672e636f6d2f76692f53736745767244464a734d2f64656661756c742e6a7067\"></a></div>",
        "id": 354478671,
        "sender_full_name": "Joe Moeller",
        "timestamp": 1682789130
    },
    {
        "content": "<p>The best semi-pop explanation of the Yoneda embedding I've seen is this:</p>\n<ul>\n<li>Tai Danae-Bradley, <a href=\"https://www.math3ma.com/blog/the-yoneda-perspective\">The Yoneda perspective</a>.</li>\n</ul>",
        "id": 354481169,
        "sender_full_name": "John Baez",
        "timestamp": 1682789583
    },
    {
        "content": "<p>Quote:</p>\n<blockquote>\n<p>From one side, the sculpture looks like an elephant; from another, it looks like two giraffes. But neither angle gives a full description. To really understand the sculpture, we should view it from all possible vantage points. The same idea holds in category theory: more vantage points give more information. And here's the upshot: the Yoneda lemma implies:‍</p>\n</blockquote>\n<blockquote>\n<p><strong>all</strong> vantage points give <strong>all</strong>  information.</p>\n</blockquote>\n<p>This is the essence of the Yoneda perspective mentioned above, and is one reason why categorically-minded mathematicians place so much emphasis on morphisms, commuting diagrams, universal properties, and the like. (Have you noticed?) It's all about relationships!</p>",
        "id": 354481658,
        "sender_full_name": "John Baez",
        "timestamp": 1682789670
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Looking.20for.20popular.20accounts.20of.20Yoneda/near/354481169\">said</a>:</p>\n<blockquote>\n<p>The best semi-pop explanation of the Yoneda embedding I've seen is this:</p>\n<ul>\n<li>Tai Danae-Bradley, <a href=\"https://www.math3ma.com/blog/the-yoneda-perspective\">The Yoneda perspective</a>.</li>\n</ul>\n</blockquote>\n<p>Thanks for bringing this up! Earlier today I remembered having read this article (and finding it great), but when I went to look it up I was sort of disappointed that it was more mathematically oriented than I remembered. But now I see that I discarded it too quickly:  that passage you quoted is really good! I am writing something along the lines of what I wanted (in Spanish) and I think it might be a good idea to translate/paraphrase Tai-Danae there</p>",
        "id": 354496737,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1682792495
    },
    {
        "content": "<p>Still, I find it surprising that there doesn't seem to be any text online aimed at e.g. Philosophy students, trying to relate the \"Yoneda perspective\" to ideas about things being determined by their relationships to other things, or debates about the existence of intrinsic properties, or essences. Things that people have been talking about for millennia</p>",
        "id": 354512863,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1682795567
    },
    {
        "content": "<p>By \"aimed at Philosophy students\" I don't mean to say a text that engages with specifically philosophical problems, that would be too technical as well... I mean more like \"here, I translate part of what makes this cool to me into a language that philosophically minded people can enjoy and find interesting\" (without necessarily engaging with the problems that could arise from trying to do so rigorously)</p>",
        "id": 354513961,
        "sender_full_name": "Gabriel Goren Roig",
        "timestamp": 1682795795
    },
    {
        "content": "<p>I hope you write such an account.</p>",
        "id": 354519685,
        "sender_full_name": "John Baez",
        "timestamp": 1682796856
    },
    {
        "content": "<p>I've seen at least one instance of what you're describing <span class=\"user-mention\" data-user-id=\"278867\">@Gabriel Goren Roig</span>, but the author overcomplicated/mystified the content for dramatic effect in a way that I disapprove of, so I won't dig it up.</p>",
        "id": 354724275,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1682874707
    },
    {
        "content": "<p>When talking about the Yoneda perspective outside of mathematical contexts/to non-mathematicians, I think one important point to emphasize is that the lemma works when we can expect to know everything about the thing we are studying, when there is no “hidden information” that we might care about.</p>\n<p>This is a reasonable assumption in mathematics (in fact, it’s sort of the point of mathematics IMO), but less often in the real world. For instance, you probably would say that humans could not be fully characterized by their observable properties – no matter how detailed, comprehensive, or hypothetical your collection of properties/relationships for a human is. Humans _probably_ have some hidden state that’s never going to be externally visible (or is random, etc.).</p>\n<p>But this is just a small caveat, since the Yoneda perspective can be very useful when talking about observable parts of the real world and you just have to restrict your attention to that to be strictly in the spirit of the maths. (And perhaps this is just saying that isomorphism and equality of objects are different relations.) I just like to bring it up when talking about the philosophy of math.</p>",
        "id": 354837063,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1682936617
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276057\">Verity Scheel</span> <a href=\"#narrow/stream/229111-general/topic/Looking.20for.20popular.20accounts.20of.20Yoneda/near/354837063\">said</a>:</p>\n<blockquote>\n<p>For instance, you probably would say that humans could not be fully characterized by their observable properties – no matter how detailed, comprehensive, or hypothetical your collection of properties/relationships for a human is. Humans _probably_ have some hidden state that’s never going to be externally visible (or is random, etc.).</p>\n</blockquote>\n<p>Avoiding a debate on reductionism, I'd like to point out that the Yoneda lemma depends on the identity morphism. We're not just talking about \"externally visible\" states/properties: it also includes any \"internal\" states <em>which are included in the category</em>. The \"everything\" in question is \"everything that has been abstracted into the categorical model\", and Yoneda really does talk about that everything. The question of whether we can successfully model an informal 'everything' in a sufficiently rich categorical model is independent of the Yoneda perspective, but I suppose \"be aware of which details are captured in your model/the assumptions your model depends on\" is always a healthy thing to keep in mind.</p>",
        "id": 355088118,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1683019966
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229111-general/topic/Looking.20for.20popular.20accounts.20of.20Yoneda/near/355088118\">said</a>:</p>\n<blockquote>\n<p>I'd like to point out that the Yoneda lemma depends on the identity morphism. We're not just talking about \"externally visible\" states/properties: it also includes any \"internal\" states <em>which are included in the category</em>.</p>\n</blockquote>\n<p>A philosophical counterpart of this observation is that the principle of \"identity of indiscernibles\" becomes trivially true when the properties to which you can apply indiscernibility include haecceities (the property of being equal to X).</p>",
        "id": 355204722,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1683045013
    },
    {
        "content": "<p>I can't quite help with a 'pop' account, but I can point to a philosophical account. <a href=\"https://philpapers.org/rec/WALCHA-2\">Patrick Walsh writes</a>  about the justification of path induction in homotopy type theory, in response to a <a href=\"https://philpapers.org/rec/LADIIH\">pair</a> of <a href=\"https://philpapers.org/rec/LADIIH-3\">papers</a> by Ladyman &amp; Presnell; Walsh ties an account of Yoneda to the view of <em>inferentialism</em>, which is roughly the view that the meaning of expressions is given by how they are used (in inferences, assertions, and so on), and draws lessons about the admissibility of \"tonk\"-like logical connectives.</p>",
        "id": 355265575,
        "sender_full_name": "Evan Washington",
        "timestamp": 1683061606
    },
    {
        "content": "<p>\"\"tonk\"-like\"?</p>",
        "id": 355274435,
        "sender_full_name": "John Baez",
        "timestamp": 1683065554
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"276777\">Mike Shulman</span> <a href=\"#narrow/stream/229111-general/topic/Looking.20for.20popular.20accounts.20of.20Yoneda/near/355204722\">said</a>:</p>\n<blockquote>\n<p>A philosophical counterpart of this observation is that the principle of \"identity of indiscernibles\" becomes trivially true when the properties to which you can apply indiscernibility include haecceities (the property of being equal to X).</p>\n</blockquote>\n<p>Yeah, this is the better setting for what I said, sorry. If all of your properties are external (e.g. behavioral facts about particular beings in some system), implying that you don't have haecceities, then you don't have a setting to talk about internal properties of them, like identity of beings outside of their behavior. This is not surprising if you make this precise in a formal framework, but I think it's worth pointing out to non-mathematicians. Since I think if you phrase things like the Yoneda principle or identity of indiscernibles non-mathematically, the first intuition is skepticism, “why does a bunch of relationships/properties determine all you need to know about a thing?” (if your intuition for “thing” is not “mathematical object”). And then I get curious about what that says about the world mathematics versus the real world. Anyways, IANAPhilosopher.</p>",
        "id": 355276672,
        "sender_full_name": "Verity Scheel",
        "timestamp": 1683066663
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229111-general/topic/Looking.20for.20popular.20accounts.20of.20Yoneda/near/354481658\">said</a>:</p>\n<blockquote>\n<p>Quote:</p>\n<blockquote>\n<p>From one side, the sculpture looks like an elephant; from another, it looks like two giraffes. But neither angle gives a full description. To really understand the sculpture, we should view it from all possible vantage points. The same idea holds in category theory: more vantage points give more information. And here's the upshot: the Yoneda lemma implies:‍</p>\n</blockquote>\n<blockquote>\n<p><strong>all</strong> vantage points give <strong>all</strong>  information.</p>\n</blockquote>\n<p>This is the essence of the Yoneda perspective mentioned above, and is one reason why categorically-minded mathematicians place so much emphasis on morphisms, commuting diagrams, universal properties, and the like. (Have you noticed?) It's all about relationships!</p>\n</blockquote>\n<p>I was recently reading a book \"Seeing That Frees: Meditations on Emptiness and Dependent Arising\" where the author Rob Burbea gives a basically identical metaphor for the concept of <a href=\"https://en.wikipedia.org/wiki/%C5%9A%C5%ABnyat%C4%81\">emptiness</a> in buddhism.<br>\nHas anyone applied category theory to buddhism yet? <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>\n<p>By the way, Carlo Rovelli in his book \"Helgoland\" also underlined the link between his <a href=\"https://en.wikipedia.org/wiki/Relational_quantum_mechanics\">relational interpretation of quantum mechanics (RQM)</a> and emptiness. I don't know if Rovelli also applies category theory in RQM? I don't recall it mentioned in the book, even though the link to Yoneda seems obvious, at least on a superficial level...</p>",
        "id": 355286641,
        "sender_full_name": "Naso",
        "timestamp": 1683072089
    },
    {
        "content": "<p>I know Carlo Rovelli, so I know he doesn't know category theory and is probably not going to learn it in order to express his thoughts in that language.  Louis Crane has interesting ideas on relational physics and (n-)category theory.  For example</p>\n<ul>\n<li>Louis Crane, <a href=\"https://arxiv.org/abs/gr-qc/9504038\">Clock and category: is quantum gravity algebraic?</a></li>\n</ul>\n<p>influenced me a lot.</p>",
        "id": 355286940,
        "sender_full_name": "John Baez",
        "timestamp": 1683072278
    },
    {
        "content": "<p>Some principles stated in this paper:</p>\n<blockquote>\n<ol>\n<li>No observation is possible without an observer. Hence there is no Hilbert space associated with a closed universe. Any observer is part of a universe, hence occupies a 3-manifold with boundary, and makes observations on another such with a shared boundary.</li>\n</ol>\n</blockquote>\n<blockquote>\n<ol start=\"2\">\n<li>There is no observation at a distance. Thus the Hilbert spaces in the theory reflect the interface between observer and system. This means they are associated to surfaces.</li>\n</ol>\n</blockquote>",
        "id": 355287117,
        "sender_full_name": "John Baez",
        "timestamp": 1683072387
    }
]