[
    {
        "content": "<p>Hi everybody, I hope this isn't off-topic. I've been teaching a category theory class this semester in the computer science department at the University of Michigan (<a href=\"http://maxsnew.com/teaching/eecs-598-w22/\">http://maxsnew.com/teaching/eecs-598-w22/</a>) and for the last lecture I want to provide the students with some advertisements for different areas that they should now be empowered to explore on their own.</p>\n<p>In the course, I've focused on mostly \"programming language\" examples, such as simply typed lambda calculus, Lawvere's fixed point theorem, Hoare Logic, logical relations, and monads. For my final lecture I plan to put brief pointers to dependent/homotopy type theory, polymorphism using reflexive graph categories, linear/substructural logic as monoidal categories/multicategories and its influence on languages like Rust, probabilistic programming using sheaves, as well  as my own research on gradual typing and call-by-push-value.</p>\n<p>So are there any suggestions for other topics to briefly cover? Shameless self-promotion is completely encouraged!</p>",
        "id": 278891634,
        "sender_full_name": "Max New",
        "timestamp": 1649884531
    },
    {
        "content": "<p>Ok, shameless self-promotion then: Peio Borthelle, <span class=\"user-mention\" data-user-id=\"276696\">@Ambroise</span> Lafont, and I used category theory to prove <a href=\"https://hal.archives-ouvertes.fr/hal-02966439v5\">a general congruence theorem for applicative bisimilarity</a>, recasting and generalising Howe's standard format in terms of cellularity.</p>\n<p>There is also the literature on high-level constructions for syntax with variable binding. E.g., a recent, impressive achievement is <span class=\"user-mention\" data-user-id=\"358258\">@Daniel Gratzer</span> and <span class=\"user-mention\" data-user-id=\"297784\">@Jon Sterling</span>'s <a href=\"https://arxiv.org/abs/2012.10783\">method for presenting type theories</a>. Or the <a href=\"https://hal.archives-ouvertes.fr/hal-03633933\">preprint</a> I recently advertised here.</p>\n<p>Finally, let's ping <span class=\"user-mention\" data-user-id=\"275900\">@Stelios Tsampas</span>, who might have something to add.</p>",
        "id": 278940075,
        "sender_full_name": "Tom Hirschowitz",
        "timestamp": 1649926949
    },
    {
        "content": "<p>Thanks for the assist <span class=\"user-mention\" data-user-id=\"383799\">@Tom Hirschowitz</span>. </p>\n<p>Hey Max :). Since you're going to mention DTT and HTT, how about pointing them towards Agda, it's CT library and it's cubical version? And then coalgebras, they're a natural fit with computer science, right?</p>",
        "id": 278942527,
        "sender_full_name": "Stelios Tsampas",
        "timestamp": 1649928584
    }
]