[
    {
        "content": "<p>There are some hypothetical concerns about open review that have been expressed here; why don't we \"just\" try a specific version of this option next time, and see how it goes? If these problems actually do arise, we can adapt and improve in the next iteration. It's worth noting that even this time there were enough submissions (and enough variety in the submissions) that I would find it very surprising if everyone was not able to avoid a conflict of interest in the papers they review.</p>",
        "id": 356868377,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1683609940
    },
    {
        "content": "<p>I guess part of the question is: who is \"we\"?   There are a lot of people involved in running the ACT conference.  Only a small fraction are here on this Zulip.  Of them only a small fraction have expressed support for open review - maybe &lt; 5 people so far?  So reaching some sort of consensus that this is an experiment worth trying would take a lot of conversations.</p>",
        "id": 356869864,
        "sender_full_name": "John Baez",
        "timestamp": 1683610609
    },
    {
        "content": "<p>(I have no strong opinions one way or another myself, btw.)</p>",
        "id": 356869956,
        "sender_full_name": "John Baez",
        "timestamp": 1683610637
    },
    {
        "content": "<p>Maybe we should move this conversation to some other stream, like \"ACT2024\".</p>",
        "id": 356870093,
        "sender_full_name": "John Baez",
        "timestamp": 1683610686
    },
    {
        "content": "<p>(Btw, has anyone expressed interest in running ACT2024?   I feel I've heard something about this, but I can't remember what!)</p>",
        "id": 356870178,
        "sender_full_name": "John Baez",
        "timestamp": 1683610736
    },
    {
        "content": "<p>18 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"229141\" href=\"/#narrow/stream/229141-general.3A-events/topic/ACT.202023\">#general: events &gt; ACT 2023</a> by <span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span>.</p>",
        "id": 356886160,
        "sender_full_name": "Notification Bot",
        "timestamp": 1683615520
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/ACT.202024/near/356869864\">said</a>:</p>\n<blockquote>\n<p>I guess part of the question is: who is \"we\"? </p>\n</blockquote>\n<p>Entirely valid question, I made that proposal in spite of having a smaller stake in the results than many others. I hope this possibility gets discussed in the preparation of the next conference, though!</p>",
        "id": 356886480,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1683615640
    },
    {
        "content": "<p>I'll try to remember to bring it up.</p>",
        "id": 356887772,
        "sender_full_name": "John Baez",
        "timestamp": 1683616033
    },
    {
        "content": "<p>A possibly good option would be for some of the interested people to run a smaller (possibly affiliated) workshop with published proceedings and use that as an experimental testbed for alt-review</p>",
        "id": 357011776,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1683644349
    },
    {
        "content": "<p>I remember that last ACT I used my tiny bit of post-covid energy to say we need to have some smaller affiliated workshops to take pressure off ACT; I then completely forgot about it so I haven't actually organised anything this year</p>",
        "id": 357012068,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1683644407
    },
    {
        "content": "<p>There exist such smaller affiliated workshops: <a href=\"https://www.cl.cam.ac.uk/events/syco/11/\">SYCO</a>!   We even had one here in California.  These don't usually publish proceedings.  But someone could do SYCO with proceedings... and call it PSYCO.</p>",
        "id": 357014004,
        "sender_full_name": "John Baez",
        "timestamp": 1683644795
    }
]