[
    {
        "content": "<p>Hi everyone, I moved posts about the <a href=\"http://twitch.tv/binary_operation\">Binary Operation Twitch stream</a> to <a class=\"stream\" data-stream-id=\"229141\" href=\"/#narrow/stream/229141-general.3A-events\">#general: events</a> from the topic on <a href=\"#narrow/stream/274877-practice.3A-our-work/topic/Morgan.20Rogers\">my work</a>.  We now have a <a href=\"https://mathstodon.xyz/@binary_operation\">Mastodon account</a> and an <a href=\"https://www.instagram.com/binary2operation/\">Instagram account</a>, although we're still deciding how to use both of these; please follow if you're on these platforms!</p>\n<p>The next stream will be tomorrow (Sunday) from 9:30am Paris time. We'll be diving deeper into finding out what <strong>asymptotic invariance of the distribution of stuff in the universe</strong> would look like. If that's a strange enough sentence to make you curious, please do drop by... It will be a physics-inspired examination of how symmetry interacts with complexity classes/asymptotic behaviour of functions.</p>\n<p>If you don't have a Twitch account (you don't need one to watch, but you would need one to leave a comment during the stream), feel free to send questions either here or through the platforms mentioned above.</p>",
        "id": 347834988,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1680948785
    },
    {
        "content": "<p>Hi folks, the next stream will be tomorrow at 4pm Paris time, on the <a href=\"http://twitch.tv/binary_operation\">usual channel</a>.<br>\nLast time we talked about asymptotic equations, but when I tried to look these up on stream, the kinds of equation that came up were not of the form that we were considering. I wonder if anyone here has thought about asymptotic analysis and could lend us some insight?</p>",
        "id": 350189997,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1681576341
    },
    {
        "content": "<p>(starting soon)</p>",
        "id": 350320400,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1681653671
    }
]