[
    {
        "content": "<p>CATNIP stands for Categories Networking Project.</p>\n<p>The Universities of Aberdeen, Edinburgh, and Strathclyde are starting a network in category theory, funded by the Isaac Newton Institute. The aim is to create an arena for the dissemination and the discussion of cutting-edge research in category theory, bringing together a community of mathematicians and theoretical computer scientists using category theory in their research. There will be three day-long meetings a year.   The first meeting will be held in Edinburgh Wednesday 14th June.</p>\n<p>(This is all I know: <span class=\"user-mention\" data-user-id=\"301248\">@Chris Heunen</span> will eventually tell us more.)</p>",
        "id": 347260928,
        "sender_full_name": "John Baez",
        "timestamp": 1680732063
    },
    {
        "content": "<p>I'm so excited for this but I'm also going to miss the first one <span aria-label=\"tear\" class=\"emoji emoji-1f972\" role=\"img\" title=\"tear\">:tear:</span></p>",
        "id": 348509786,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1681230511
    },
    {
        "content": "<p>It is unclear if the message is a call for participation: in case it is, I saved the date!</p>",
        "id": 348642415,
        "sender_full_name": "fosco",
        "timestamp": 1681285640
    },
    {
        "content": "<p>It was a \"heads-up\" that I saw in my email, probably because I'm on some Edinburgh category theory mailing list.   I hope some clearer announcement will follow.</p>",
        "id": 348811130,
        "sender_full_name": "John Baez",
        "timestamp": 1681325912
    },
    {
        "content": "<p>We might only advertise to locals, to be decided still</p>",
        "id": 349044985,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1681376457
    },
    {
        "content": "<p>We can make it official now!</p>\n<p>Categories Networking Project (CATNIP) is a new scientific network between the University of Aberdeen, the University of Edinburgh and the University of Strathclyde; it is focused on category theory, both in its foundational aspects and in its interactions with computer science and with other areas of mathematics, such as topology, algebra, mathematical physics and applied mathematics.</p>\n<p><a href=\"https://sites.google.com/view/catniporg/home\">https://sites.google.com/view/catniporg/home</a></p>\n<p>The first meeting will be held at the</p>\n<p>University of Edinburgh<br>\n  on June 14.</p>\n<p>Invited speakers:</p>\n<ul>\n<li>Elena di Lavore (Tallinn University of Technology)</li>\n<li>Nicola Gambino (University of Manchester)</li>\n<li>Vanessa Miemitz (University of East Anglia)</li>\n</ul>\n<p>The programme will be announced shortly. The meeting is open to everybody. Participants from the three nodes may be offered travel reimbursement. We hope to be able to reimburse all staff and PhD students from the nodes, but if (depending on participants numbers) any budget issues arise priority will be given to PhD students and early career researchers. Please register at:</p>\n<p><a href=\"https://forms.gle/AxAuNQWqLM8fzWef7\">https://forms.gle/AxAuNQWqLM8fzWef7</a></p>",
        "id": 356988544,
        "sender_full_name": "Chris Heunen",
        "timestamp": 1683639687
    }
]