[
    {
        "content": "<blockquote>\n<p>Dear colleagues,</p>\n<p>The next International Category Theory Conference - CT2023 - will take place at the Universite catholique de Louvain in Louvain-la-Neuve (Belgium). The conference will start on Sunday, July 2 (with a welcome reception) and will end on Saturday, July 8, 2023.</p>\n<p>We are pleased to let you know that the following Invited Speakers have accepted to give a 50-minute plenary lecture:</p>\n<p>George Janelidze  (University of Cape Town)<br>\nSteve Lack (Macquarie University)<br>\nVanessa Miemietz (University of East Anglia)<br>\nPaolo Perrone (University of Oxford)<br>\nLuca Reggio (University College London)<br>\nChristina Vasilakopoulou (National Technical University of Athens)</p>\n<p>The members of the CT2023 Scientific Committee are:</p>\n<p>Richard Garner<br>\nSandra Mantovani (Chair)<br>\nJorge Picado<br>\nEmily Riehl<br>\nGiuseppe Rosolini<br>\nWalter Tholen<br>\nTim Van der Linden</p>\n<p>The information concerning the conference is available at the address <a href=\"https://sites.uclouvain.be/ct2023/\">https://sites.uclouvain.be/ct2023/</a> and it will be regularly updated.</p>\n<p>The abstract submission for the contributed talks will be possible (starting from February) until March 31st. The information concerning the registration will be available on the website of the conference in due time.</p>\n<p>If you wish to contact the organizers please write to the address <a href=\"mailto:ct2023-org@uclouvain.be\">ct2023-org@uclouvain.be</a></p>\n<p>We wish you all a Happy New Year and we look forward to seeing you in Louvain-la-Neuve!</p>\n<p>The members of the CT2023 Organizing Committee<br>\n</p>\n</blockquote>",
        "id": 320807463,
        "sender_full_name": "John Baez",
        "timestamp": 1673475204
    },
    {
        "content": "<p>(Here I'm just copying a post from Marino Gran on the category theory mailing list.)</p>",
        "id": 320807513,
        "sender_full_name": "John Baez",
        "timestamp": 1673475236
    }
]