[
    {
        "content": "<p>My friend Joshua Meyers, formerly a math student at U. C. Riverside, is trying to develop new scholarly institutions: alternatives to universities.  </p>\n<p>He's gotten money from Jaan Tallinn and the Survival and Flourishing Fund to run <a href=\"https://let-me-think.org/scholarshipworkshop.html\">Scholarship Workshop 2023</a> - a 2-month in-person incubator project.</p>\n<p>It'll happen this summer.    In a while you can apply to join.  There will be room for 20 people.   Read more about it at the link!</p>",
        "id": 326289669,
        "sender_full_name": "John Baez",
        "timestamp": 1675751057
    },
    {
        "content": "<p>Interesting... I followed a couple of links there and arrived at the <a href=\"https://let-me-think.org/index.html\">Let Me Think</a> homepage. I have several (somewhat critical) questions; <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span> is here a good place to pose those?</p>",
        "id": 326313368,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675761486
    },
    {
        "content": "<p>I'd love a conversation about it here, I'm not sure he visits this place often enough to make that an efficient way to reach him.  We'll see!</p>",
        "id": 326443990,
        "sender_full_name": "John Baez",
        "timestamp": 1675799096
    },
    {
        "content": "<p>He suggests that people contact him <a href=\"https://let-me-think.org/aboutus.html#sendmessage\">here</a>.</p>",
        "id": 326444245,
        "sender_full_name": "John Baez",
        "timestamp": 1675799186
    },
    {
        "content": "<p>But I've asked him to talk to you here, <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>.</p>",
        "id": 326488141,
        "sender_full_name": "John Baez",
        "timestamp": 1675818332
    },
    {
        "content": "<p>I'll wait for now. If nothing happens here I will send a message via the link you gave.</p>",
        "id": 326577146,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675859840
    },
    {
        "content": "<p>Here I am! What's up?</p>",
        "id": 326584454,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675862029
    },
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> This is very cool, I'd like to talk but I'll message you tomorrow when I'm not dying of teaching</p>",
        "id": 326593694,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1675864593
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"280784\">@Joshua Meyers</span>. My main question is about the \"Scholarly Loop\". While it is not such a constraint for mathematics, one typically finds that time spent studying something does not usually generate the resources required to create that thing. For instance, even if sitting on a bridge helped me to better understand how bridges are built, no amount of time there would generate the building materials required to build a bridge. So how do you intend to acquire the resources to actually build and run scholarly institutions?</p>\n<p>Further thoughts:</p>\n<ol>\n<li>you say that universities are not scholarly institutions because \"facilitating scholarly practices is just one purpose, on par with job training, holding space for children to become adults, making people \"cultured\", and transmission, growth, and maintenance of prestige.\" To me, this suggests that your proposed scholarly institutions will avoid doing these 'additional' things, but all of them seem to me to be interwoven with the motivation for pursuing scholarship in the first place, and you provide limited arguments for the pursuit of scholarship as an end in itself.</li>\n<li>The quote above is in conflict with other points made on the page: you mention teachers' and doctors' (mis)education affecting the public, but the scholarship of teachers and doctors is explicitly directed towards the end of job training!</li>\n<li>Under \"scholarly institutions must ensure that scholars' needs are met\", you list four items. To me, these are all things that a university is supposed to provide, although I understand your complaints that they fail in one or more of the categories. How <em>exactly</em> is a scholarly institution supposed to be different from a university?</li>\n<li>I find the fact that Neoliberalism is in your provisional list of subjects to study in the pursuit of building scholarly institutions somewhat concerning. Not wanting to presume too much, what is the relationship between neoliberalism and your project?</li>\n</ol>",
        "id": 326614126,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675869406
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"277473\">@Morgan Rogers (he/him)</span>, thanks for the feedback!</p>\n<p>So for your main question, \"learning about how to build scholarly institutions\" includes learning about how to acquire the resources necessary to build scholarly institutions.  Of course, even this will not automatically generate the resources, but it will help you find them once you go about trying to build a scholarly institution.</p>\n<p>To your further thoughts:</p>\n<ol>\n<li>They won't avoid doing these 'additional' things, but they won't specifically aim to do these 'additional' things either.  I don't see how these things are interwoven with the motivation for pursuing scholarship in the first place.  I should put more on the website about the value of scholarship --- I see it as valuable to the society because it will help people act more wisely, which we need more than ever given the perilous times and the dangerously advanced technology.</li>\n<li>Yeah that's a good point.  Not sure what to say right now, but I'll think about it.</li>\n<li>A university is not a scholarly institution because it is not expressly designed to facilitate scholarly practices, it has tons of other purposes at the same time.  A scholarly institution is.  (I know you think these purposes are inextricably interwoven, but I don't see how, see 1.)  So I don't think that universities are not meeting the needs of scholars because Oops, I think it's because it's simply not a priority for them --- in scholarly institutions it will be a priority.  The details of what scholarly institutions will look like exactly should be the result of scholarly work, they are not something I know at the moment (though I have provisional ideas).</li>\n<li>I hear people saying  that Neoliberalism is part of what led to the managerial takeover of universities (in the 80s or 90s, I think?)  That's why I think it might be important to study.</li>\n</ol>",
        "id": 326626805,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675872540
    },
    {
        "content": "<p>Just wanted to say that I appreciate that people are thinking about this!</p>",
        "id": 326630893,
        "sender_full_name": "David Egolf",
        "timestamp": 1675873627
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326626805\">said</a>:</p>\n<blockquote>\n<p>So for your main question, \"learning about how to build scholarly institutions\" includes learning about how to acquire the resources necessary to build scholarly institutions.  Of course, even this will not automatically generate the resources, but it will help you find them once you go about trying to build a scholarly institution.</p>\n</blockquote>\n<p>That's not really a sufficient answer. The \"Scholarly Loop\" graphic asserts that learning how to build SIs will directly enable more building of SIs, and your answer doesn't give a basis to this claim. At the moment it's like a proof by induction without a base case (that is, it's still very much falsifiable).</p>\n<blockquote>\n<p>They won't avoid doing these 'additional' things, but they won't specifically aim to do these 'additional' things either.  I don't see how these things are interwoven with the motivation for pursuing scholarship in the first place.</p>\n</blockquote>\n<p>The vast majority of people who pursue 'optional' higher education do so because it is a prerequisite to their preferred profession; note that this includes becoming a researcher in any field. Of the minority not accounted for by that, young people go to university to claim their independence and mature (I find the phrasing \"holding space for children to become adults\" in reference to this function of universities quite condescending), and a non-disjoint proportion go to expand the horizon of their knowledge, which is what I assume you mean by 'making people \"cultured\"'. Meanwhile, people choose their institution on the basis of the perceived quality of the education provided there, which is the \"prestige\" you mention. All of the scholarly practices you mention are inextricable from culture. What motivation for engaging in scholarship am I missing?</p>\n<blockquote>\n<p>I don't think that universities are not meeting the needs of scholars because Oops, I think it's because it's simply not a priority for them.</p>\n</blockquote>\n<p>I agree that there is a systematic disparity between the priorities of university administration and the expected priorities of a university; the failures of universities are not an accident. This doesn't change the fact that the ideals you're proposing for SIs are the things that students expect (and complain about not receiving) from their universities. Moreover, if your SIs are competing with universities for either participants/students or resources, then independence from the established university system won't protect you from having to prioritize the same flawed proxies for success that universities are, which ultimately points to the same problems arising.</p>\n<p>It's very well to say \"we won't have the flaws of universities\", but until you can explain how you will systematically resist the external pressures that created these flaws in the university system (many of them political), any advantage will be temporary. I expect your answer will be that this is one of the things you need to study, which is fine, but it again leaves open the possibility that you will simply not get past the ideation stage.</p>\n<blockquote>\n<p>I hear people saying  that Neoliberalism is part of what led to the managerial takeover of universities (in the 80s or 90s, I think?)  That's why I think it might be important to study.</p>\n</blockquote>\n<p>I read that as saying \"the flaws of universities might be attributable in part to neoliberalism\", which is a relief (I agree; I was worried that you were proposing neoliberalism as a model for how to establish SIs, along the lines of claiming that the problems with universities stem from excessive regulation etc etc, which I would have objected to).</p>",
        "id": 326638663,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675875600
    },
    {
        "content": "<p>My other fear if you rely on private funding is that you are at risk of SIs becoming party to intellectual whitewashing (I was tempted to call this \"brainwashing\" because it's a funny pun, but this is kind of serious). At one extreme I am referring to a lack of scrutiny towards donors who might gain credibility or clout by association with your SIs, and at the other extreme you risk being the delivery method of an agenda not aligned with your intended ideals for SIs. Under the former I'm thinking of phenomena such as greenwashing of fossil fuel companies by their funding of environmental research or climate awareness public installations. Under the latter I'm thinking of institutions such as Prager U which ostensibly provide educational materials (certainly a component of \"scholarship\"), but which are riddled by misinformation in service of the political agenda of the organisations supporting them.<br>\nI saw somewhere on the site that you want to ensure donor involvement in projects, but I didn't understand how that would mitigate the problems I'm pointing out here. Have you thought about this?</p>",
        "id": 326641556,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675876384
    },
    {
        "content": "<p>Hi, I already thought some times ago that a solution for a scholarly institution would be to really imitate monasteries. They are the main people I know who are able to live independently while caring about their own business for a good part of their time. It means that scholars would have to use part of their time next to their scholar work to generate some funds. Most of the time I think that monks sell lot of food like cheese, alcohol (like beers!) or other products. Maybe they also produce some of their food with big gardens but probably less today than in the past because it really requires a huge area of land to produce your own food. One could also produce some wood for saving cost for heating. But it would probably be easier in a region with hot climate. I think that such a community would have to take advantage of this situation to live ethically and control their ecological impact. They could try to produce their own energy by using solar panels, wind turbines or geothermal energy. They should avoid flying to conferences also. In any way, they would not have enough money to pay the flight bills. But they could probably use the internet to organize virtual conferences. Hopefully if they succeed to produce new knowledge while respecting the planet, they would get funds by various organizations to help them grow because they would be a good example of how to use intelligence to live virtuously and would help the whole humanity by finding good ways of living on our planet. I think that they really should use some of their scholarship expertise to work on the ecological side.</p>",
        "id": 326646614,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1675877734
    },
    {
        "content": "<p>Also, I think that most of the research would be in fields that don't require lot of expensive equipment, like mathematics, philosophy and practical ecology, maybe a little bit of psychology or literature etc... Not particle physics or genetic engineering sadly.</p>",
        "id": 326647586,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1675878027
    },
    {
        "content": "<p>The fields of research would be imposed by what is doable in pretty rough conditions and what can possibly help to live in these pretty rough conditions. The scholars would live rather modestly probably but they could be satisfied of this life because they could chose the subjects they prefer, not have to seek all the time for funding etc...</p>",
        "id": 326647817,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1675878097
    },
    {
        "content": "<blockquote>\n<p>That's not really a sufficient answer. The \"Scholarly Loop\" graphic asserts that learning how to build SIs will directly enable more building of SIs, and your answer doesn't give a basis to this claim. At the moment it's like a proof by induction without a base case (that is, it's still very much falsifiable).</p>\n</blockquote>\n<p>Sorry I don't really understand this.  Learning to build SIs will help you build SIs, just the same way that learning to do anything will help you do that thing.  This is the whole point of learning.  You learn (about) X to help you do X (better, more wisely, etc.)  What part of this is unclear?  If you are looking for a base case for the loop, well the base case is Let Me Think and Scholarship Workshop.  I want to make a better diagram at some point but I am not sure how yet.</p>\n<blockquote>\n<p>The vast majority of people who pursue 'optional' higher education do so because it is a prerequisite to their preferred profession; note that this includes becoming a researcher in any field. Of the minority not accounted for by that, young people go to university to claim their independence and mature (I find the phrasing \"holding space for children to become adults\" in reference to this function of universities quite condescending), and a non-disjoint proportion go to expand the horizon of their knowledge, which is what I assume you mean by 'making people \"cultured\"'. Meanwhile, people choose their institution on the basis of the perceived quality of the education provided there, which is the \"prestige\" you mention. All of the scholarly practices you mention are inextricable from culture. What motivation for engaging in scholarship am I missing?</p>\n</blockquote>\n<p>The motivation you are missing is the burning passion for learning.  This is often motivated by a concern for truth, justice, goodness, expansion of the self, etc.</p>\n<blockquote>\n<p>Moreover, if your SIs are competing with universities for either participants/students or resources...</p>\n</blockquote>\n<p>SIs will only compete with universities for students who are passionate about learning.  They will not be attractive to the many students who attend universities for other reasons.</p>\n<blockquote>\n<p>I expect your answer will be that this is one of the things you need to study, which is fine, but it again leaves open the possibility that you will simply not get past the ideation stage.</p>\n</blockquote>\n<p>Yes that is my answer.  As for not getting past the ideation stage, I think we've already gotten past it!  We're doing this workshop right?</p>\n<blockquote>\n<p>My other fear if you rely on private funding...</p>\n</blockquote>\n<p>Yes I have thought about this.  I think the solution is to diversify funding sources.  That way an SI is not beholden to any particular funder.  This diminishes funder influence, and also means that the SI is in a position to decline an unsavory funder.</p>\n<blockquote>\n<p>I saw somewhere on the site that you want to ensure donor involvement in projects, but I didn't understand how that would mitigate the problems I'm pointing out here.</p>\n</blockquote>\n<p>I think donor influence is somewhat inevitable, so I don't want that influence to be implicit, I want it spelled out so everyone sees it right in front of them.</p>",
        "id": 326657339,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675880798
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326646614\">said</a>:</p>\n<blockquote>\n<p>Hi, I already thought some times ago that a solution for a scholarly institution would be to really imitate monasteries. They are the main people I know who are able to live independently while caring about their own business for a good part of their time. It means that scholars would have to use part of their time next to their scholar work to generate some funds. Most of the time I think that monks sell lot of foods like cheese, alcohol (like beers!) or other products. Maybe they also produce some of their food with big gardens but probably less today than in the past because it really requires a huge area of land to produce your own food. One could also produce some wood for saving cost for heating. But it would probably be easier in a region with hot climate. I think that such a community would have to take advantage of this situation to live ethically and control their ecological impact. They could try to produce their own energy by using solar panels, wind turbines or geothermal energy. They should avoid flying to conference also. In any way, they would not have enough money to pay the flight bills. But they could probably use the internet to organize virtual conferences. Hopefully if they succeed to produce new knowledge wile respecting the planet, they would get funds by various organizations to help them grow because they would be a good example of how to use intelligence to live virtuously and would help the whole humanity by finding good ways of living on our planet. I think that they really should use some of their scholarship expertise to work on the ecological side.</p>\n</blockquote>\n<p>Yes, imitating monasteries is my thought as well.  Scholarly practice (as long as it doesn't involve expensive laboratory equipment) is really one of the cheapest things, requiring only good health, community, and cheap equipment like books, computers, internet access, etc.  As for generating funds, there are many options.  Small local businesses (e.g. cheese, alcohol, etc.), remote work (e.g. programming, consulting), rent from visitors, research grants and scholarships, etc.  I think that a monastic lifestyle could be made very cheap (maybe ~$500 per person per month after some practice) while retaining good health and leisure time for scholarly practice, and then it wouldn't be hard to put together some diversified (and hence stable) combination of funding sources to support it.</p>",
        "id": 326659299,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675881392
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428716\">Jean-Baptiste Vienney</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326647586\">said</a>:</p>\n<blockquote>\n<p>Also, I think that most of the research would be in fields that don't require lot of expensive equipment, like mathematics, philosophy and practical ecology, maybe a little bit of psychology or literature etc... Not particle physics or genetic engineering sadly.</p>\n</blockquote>\n<p>Yes for sure.  I have the uninformed opinion that even in fields that require expensive equipment, like biology, there is plenty of great work waiting to be done simply reading the multitudes of papers produced by these fields and consolidating it into coherent narratives.  And I can also see the possibility of collaborations between SIs and existing laboratories with independent funding (at universities or not).</p>",
        "id": 326659887,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675881575
    },
    {
        "content": "<p>Here's an interesting thing about biology.  About 50% of grant money goes to fund the university, so universities want to hire and promote people who get big grants.  So, academic biologists advance their careers by getting grants - especially big grants.  You can't get big grants for doing work that just requires reading, thinking, writing or even small-scale computer programming.  So theoretical biology is systematically underdeveloped compared to experimental biology and heavy-duty data analysis that requires supercomputers.   Biologists know this.  Well, some actually think theoretical biology is a hopeless subject - but many I talk to (a biased sample) say that there's a surfeit of data in biology and not enough good conceptual frameworks to make use of this data.</p>",
        "id": 326665627,
        "sender_full_name": "John Baez",
        "timestamp": 1675883526
    },
    {
        "content": "<p>So I think this is an example - one of many, I suppose - of how the pressure on scientists to fund their universities by getting big grants warps scientific priorities.</p>",
        "id": 326665843,
        "sender_full_name": "John Baez",
        "timestamp": 1675883599
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326657339\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>That's not really a sufficient answer.</p>\n</blockquote>\n<p>Sorry I don't really understand this.  Learning to build SIs will help you build SIs...</p>\n</blockquote>\n<p>Learning is <em>necessary</em> but not <em>sufficient</em> for achieving your stated goal. This is the discrepancy I'm pointing out.</p>\n<blockquote>\n<blockquote>\n<p>The vast majority of people who pursue 'optional' higher education do so because it is a prerequisite to their preferred profession... What motivation for engaging in scholarship am I missing?</p>\n</blockquote>\n<p>The motivation you are missing is the burning passion for learning.  This is often motivated by a concern for truth, justice, goodness, expansion of the self, etc.</p>\n</blockquote>\n<p>That's a nice story, but it's in conflict with the values of inclusivity you mention elsewhere. People have families and communities which push them to prioritize pragmatic ends to their education over their \"passion for learning\". If you have to support others with your income or you are expected to pursue a vocation by those around you, it doesn't sound like a SI will fit the bill. Since such pressures are unevenly distributed through society, this is an external constraint you'll need to address!</p>\n<blockquote>\n<blockquote>\n<p>I expect your answer will be that this is one of the things you need to study, which is fine, but it again leaves open the possibility that you will simply not get past the ideation stage.</p>\n</blockquote>\n<p>Yes that is my answer.  As for not getting past the ideation stage, I think we've already gotten past it!  We're doing this workshop right?</p>\n</blockquote>\n<p>It's still just ideas for the time being, so no (unless you consider this workshop to fit your definition of SI?), but I'm hopeful you'll end up with solid counters to my scepticism.</p>",
        "id": 326666358,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675883782
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326626805\">said</a>:</p>\n<blockquote>\n<p>I should put more on the website about the value of scholarship --- I see it as valuable to the society because it will help people act more wisely, which we need more than ever given the perilous times and the dangerously advanced technology.</p>\n</blockquote>\n<p>This is a pretty bold claim.  What prevents scholarship for scholarship's sake from devolving into an elite group of people sitting in ivory towers?History is not devoid of atrocities committed in the advancement of knowledge (which didn't start or end in the 1930s or 1940s, though that is an easy era to point to).  I think a prerequisite to helping people act more wisely is to give the <em>general populace</em> the education and critical thinking skills, which is a major failure point in (US) public schools.  Otherwise, scholars helping people engage in wise behaviors becomes a form of (well-intentioned) oppression.</p>",
        "id": 326669249,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1675884743
    },
    {
        "content": "<p>That would not be more ivory towers that the places where scholars live today (not because of them but because of the lack of tenure track jobs). If I understand one of the goal is to allow more people being scholars and people in SIs could be closer to the \"general populace\" because of this ease of access (and probably people in SIs would not use the word \"populace\" that sounds a little bit close to \"lettuce\" to my ears).</p>",
        "id": 326671273,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1675885461
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326666358\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326657339\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>That's not really a sufficient answer.</p>\n</blockquote>\n<p>Sorry I don't really understand this.  Learning to build SIs will help you build SIs...</p>\n</blockquote>\n<p>Learning is <em>necessary</em> but not <em>sufficient</em> for achieving your stated goal. This is the discrepancy I'm pointing out.</p>\n</blockquote>\n<p>Sure, that's true.</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>The vast majority of people who pursue 'optional' higher education do so because it is a prerequisite to their preferred profession... What motivation for engaging in scholarship am I missing?</p>\n</blockquote>\n<p>The motivation you are missing is the burning passion for learning.  This is often motivated by a concern for truth, justice, goodness, expansion of the self, etc.</p>\n</blockquote>\n<p>That's a nice story, but it's in conflict with the values of inclusivity you mention elsewhere. People have families and communities which push them to prioritize pragmatic ends to their education over their \"passion for learning\". If you have to support others with your income or you are expected to pursue a vocation by those around you, it doesn't sound like a SI will fit the bill. Since such pressures are unevenly distributed through society, this is an external constraint you'll need to address!</p>\n</blockquote>\n<p>This seems like a insuperable upper bound on the inclusivity possible to an SI.  Of course, if someone is pressured into spending all their time towards pragmatic ends, they won't be able to pursue a love of learning.  We can only hope to maximize inclusivity within this upper bound!  One way to do this is through SIs which allow for part-time, or virtual participation.  That way one's scholarly inclination can be supported even if one does not have the freedom to devote all their time to it.</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>I expect your answer will be that this is one of the things you need to study, which is fine, but it again leaves open the possibility that you will simply not get past the ideation stage.</p>\n</blockquote>\n<p>Yes that is my answer.  As for not getting past the ideation stage, I think we've already gotten past it!  We're doing this workshop right?</p>\n</blockquote>\n<p>It's still just ideas for the time being, so no (unless you consider this workshop to fit your definition of SI?), but I'm hopeful you'll end up with solid counters to my scepticism.</p>\n</blockquote>\n<p>Actually I do think my workshop fits the definition of SI, although it is an unusual case as it will only exist for 2-months, rather than an indefinite lifetime.  This is intentional as I don't currently know the best way to run a scholarly institution and I don't want to lock in any choices made in a state of ignorance.</p>",
        "id": 326673633,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675886275
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"309257\">Jason Erbele</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326669249\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"280784\">Joshua Meyers</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326626805\">said</a>:</p>\n<blockquote>\n<p>I should put more on the website about the value of scholarship --- I see it as valuable to the society because it will help people act more wisely, which we need more than ever given the perilous times and the dangerously advanced technology.</p>\n</blockquote>\n<p>This is a pretty bold claim.  What prevents scholarship for scholarship's sake from devolving into an elite group of people sitting in ivory towers? ...</p>\n</blockquote>\n<p>The aim of this whole project is to broaden access to scholarly practice.  A young person who wants to be a scholar shouldn't have to go into massive debt in order to go to college, where they discover that they have to take 4+ classes at once while working a part-time job, and are rewarded not on the basis of the quality of their scholarship but on their diligence in keeping up with all their variegated responsibilities to at least a low standard of quality. An adult who wants to be a scholar shouldn't have to go into financial precarity in order to be an adjunct professor only to find that they don't have time for scholarship, all they have time for is their large teaching load, and most of their students don't even want to be there...</p>",
        "id": 326675152,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675886753
    },
    {
        "content": "<p>Alright, I look forward to hearing what you come up with. As a more positive contribution, I'd like to draw your attention to <a href=\"https://nesinkoyleri.org/en/introduction-to-nesin-villages/\">this village</a> in Turkey, which I think qualifies as an example of an SI.</p>",
        "id": 326675432,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1675886835
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"277473\">Morgan Rogers (he/him)</span> <a href=\"#narrow/stream/229141-general.3A-events/topic/Developing.20new.20scholarly.20institutions/near/326675432\">said</a>:</p>\n<blockquote>\n<p>Alright, I look forward to hearing what you come up with. As a more positive contribution, I'd like to draw your attention to <a href=\"https://nesinkoyleri.org/en/introduction-to-nesin-villages/\">this village</a> in Turkey, which I think qualifies as an example of an SI.</p>\n</blockquote>\n<p>Yes it does!  I really want to go there</p>",
        "id": 326675501,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675886864
    },
    {
        "content": "<p>Another already-existing-scholarly-institution I know of is Mimbres School: <a href=\"https://weirdeconomies.com/contributions/what-good-is-education\">https://weirdeconomies.com/contributions/what-good-is-education</a></p>\n<p>(Note: I haven't watched this video or read this essay but I've taken multiple (virtual) Mimbres classes)<br>\n(Update: Now I have watched the video and read the essay and confirm that they are very cool and very much on-topic.)</p>",
        "id": 326678054,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675887870
    },
    {
        "content": "<p>Just want to throw in a working example that I know of (and I'm not affiliated with) of an institution that is trying to break the mold, and I think doing ok at it, in its little niche. <a href=\"https://signumuniversity.org/about/mission/\">https://signumuniversity.org/about/mission/</a> It focuses on liberal arts, specifically the humanities/literature/languages, which are—like much of mathematics—relatively cheap and don't need labs/hardware/equipment/etc.</p>",
        "id": 326695167,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1675894509
    },
    {
        "content": "<p>Wow this is great!</p>",
        "id": 326703733,
        "sender_full_name": "Joshua Meyers",
        "timestamp": 1675898087
    },
    {
        "content": "<p>I'm not sure if this is in scope, but I would urge you to broaden your notion of institution beyond \"place where people go to learn\", to also include things like communication mechanisms and support technologies.</p>\n<p>When I think of scholarly institutions in need of reform, a web/interaction-friendly replacement for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mtext>LaTeX</mtext></mrow><annotation encoding=\"application/x-tex\">\\LaTeX</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8988em;vertical-align:-0.2155em;\"></span><span class=\"mord text\"><span class=\"mord textrm\">L</span><span class=\"mspace\" style=\"margin-right:-0.36em;\"></span><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.6833em;\"><span style=\"top:-2.905em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"mord\"><span class=\"mord textrm mtight sizing reset-size6 size3\">A</span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:-0.15em;\"></span><span class=\"mord text\"><span class=\"mord textrm\">T</span><span class=\"mspace\" style=\"margin-right:-0.1667em;\"></span><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.4678em;\"><span style=\"top:-2.7845em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\"><span class=\"mord textrm\">E</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2155em;\"><span></span></span></span></span><span class=\"mspace\" style=\"margin-right:-0.125em;\"></span><span class=\"mord textrm\">X</span></span></span></span></span></span> is near the top of my list</p>",
        "id": 326709233,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1675901084
    }
]