[
    {
        "content": "<p>Announcing a new Topos seminar series: Intercats</p>",
        "id": 268053749,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1642185210
    },
    {
        "content": "<p>INTERCATS: SEMINAR ON CATEGORICAL INTERACTION<br>\n=============================================</p>\n<p>ANNOUNCEMENT</p>\n<hr>\n<p>Intercats is a new seminar series on the mathematics of interacting systems, their composition, and their behaviour. Split in equal parts theory and applications, we are particularly interested in category-theoretic tools to make sense of information-processing or adaptive systems, or those that stand in a 'bidirectional' relationship to some environment. We aim to bring together researchers from different communities, who may already be using similar-but-different tools, in order to improve our own interaction.</p>\n<p>Seminars will be held every other Tuesday at 17:00 UTC, beginning on the 25th of January.</p>\n<p>Website: <a href=\"https://topos.site/intercats\">https://topos.site/intercats</a></p>\n<p>FIRST MEETING</p>\n<hr>\n<p>Speaker:  David Spivak</p>\n<p>Date: 2022 / 01 / 25</p>\n<p>Time: 17:00 UTC</p>\n<p>INTERCATS SCOPE</p>\n<hr>\n<p>Although by no means an exhaustive or prescriptive list, Intercats seminar topics are likely to be related to the following mathematical topics:</p>\n<ul>\n<li>Generalized lenses, optics, and related structures, such as Chu spaces or Dialectica categories;</li>\n<li>polynomial functors, and their associated ecosystem;</li>\n<li>applications of the foregoing to:<ul>\n<li>bidirectional processes,</li>\n<li>dynamical systems,</li>\n<li>wiring diagrams,</li>\n<li>open games,</li>\n<li>database theory,</li>\n<li>automatic differentiation,</li>\n<li>computational statistics,</li>\n<li>machine learning.</li>\n</ul>\n</li>\n</ul>\n<p>ORGANIZERS</p>\n<hr>\n<p>Jules Hedges, University of Strathclyde<br>\nDavid Spivak, Topos Institute<br>\nToby St Clere Smithe, Topos Institute</p>",
        "id": 268053767,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1642185221
    },
    {
        "content": "<p>First Intercats seminar in 30 minutes!</p>",
        "id": 269282725,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1643128236
    },
    {
        "content": "<p>David Spivak (Topos Institute)</p>\n<p>Abstract: Category theory offers an elegant, compositional, and well-interoperating framework in which to formalize many different sorts of interacting systems, including database, dynamical, software, learning, and game-playing systems.</p>\n<p>In this talk I'll start by giving a bird's-eye view of these applications. I'll then discuss polynomial functors and the associated framed bicategory Cat# of comonoids. I'll say a bit about how Cat# fits into the above stories and spend the remainder of the time trying to give a hint as to the astounding amount of structure this category has.</p>\n<p>One might think of Cat# like the complex numbers: simultaneously extremely useful in applications and extremely mathematically well-behaved, the combination of which gives a sense of its being more \"part of nature\" than \"human-made\".</p>",
        "id": 269282775,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1643128267
    }
]