[
    {
        "content": "<p>I've just been advertising the deadlines for the LICS 2023 conference (Logic In Computer Science) and I thought to mention them here too. <br>\nThe abstracts/papers are due 18/23 Jan 2023. There's also a call for workshop proposals, deadline 30 November. </p>\n<p>There are several people from this Zulip on the LICS programme committee, and it seems a good venue for applied category theory, although LICS is more general than that. </p>\n<p><a href=\"https://lics.siglog.org/lics23/\">https://lics.siglog.org/lics23/</a></p>\n<p>(Is there a separate stream for conference adverts etc? Sorry if so.)</p>",
        "id": 308364437,
        "sender_full_name": "Sam Staton",
        "timestamp": 1667818342
    },
    {
        "content": "<p>(moved to <a class=\"stream\" data-stream-id=\"229141\" href=\"/#narrow/stream/229141-general.3A-events\">#general: events</a>)</p>",
        "id": 308372350,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667821562
    },
    {
        "content": "<p>It's not very important but I think the topics in LICS are both more <em>and less</em> general than applied category theory: i.e., they overlap but neither is a subset of the other.</p>",
        "id": 308397777,
        "sender_full_name": "John Baez",
        "timestamp": 1667830940
    },
    {
        "content": "<p>Sorry yes, you're quite right. Although having said that, there actually aren't many talks at ACT 2022 that seem totally off topic for LICS. I think if anyone wants to submit a paper, and is using techniques that are relevant to LICS (e.g. category theory), then that might be ok topic-wise. It's up to the programme committee I guess.</p>",
        "id": 308467096,
        "sender_full_name": "Sam Staton",
        "timestamp": 1667852586
    },
    {
        "content": "<p>Right, the impression I have is that a significant minority of the LiCS PC inherently dislike category theory, or possibly think that only Theory A methods are in-scope, so for us it seems to be even more of a lottery than you'd reasonably expect for such an important conference</p>",
        "id": 308784818,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1668000019
    },
    {
        "content": "<p>I submitted to LICS a few years ago and my experience was extremely discouraging. I got a +3 review, but also a -2 review, the substance of which was:</p>\n<blockquote>\n<p>The paper is very well written, the results are clearly outlined, and these appear to be interesting results for category theorists. This said, I do not quite see what the connection to computer science is or could possibly be, and I wish the authors had made some attempt in the introduction to connect this work to some part of CS; there is a short paragraph in which the authors speculate about a possible connection to relational databases, but the link appears tenuous at best; the conclusion does not help much either as it states various possible future avenues of research in category theory. I find it difficult to recommend acceptance under the circumstances.</p>\n</blockquote>\n<p>I don't think I'll be submitting any more theoretical work to LICS. Prestigious or not, it feels like a waste of time.</p>",
        "id": 308788951,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668001326
    },
    {
        "content": "<p>... I do think my work is computer science. I work in a computer science department.</p>",
        "id": 308789386,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668001491
    },
    {
        "content": "<p>(Posting this in support of the idea that it's a lottery)</p>",
        "id": 308791396,
        "sender_full_name": "Chad Nester",
        "timestamp": 1668002042
    },
    {
        "content": "<p>I'm sorry you experienced this. I think it's bad for everybody if newcomers get discouraged like that. I'm actually on the steering committee, and I agree this can sometimes be a problem, and we're looking into some new initiatives for avoiding this right now. Happy to also hear any suggestions. There are several ACT people on the PC this year, so maybe things would be better this year from that perspective.  </p>\n<p>For anyone, I'm happy to have a look at a draft in advance if you are worried about getting these kinds of reviews from a non-expert, in case that might help (not that I'm claiming to be magic in any way!).</p>",
        "id": 308824809,
        "sender_full_name": "Sam Staton",
        "timestamp": 1668011717
    }
]