[
    {
        "content": "<hr>\n<p>CALL FOR SUBMISSIONS<br>\nNINTH SYMPOSIUM ON COMPOSITIONAL STRUCTURES (SYCO 9)</p>\n<p>Como, Italy<br>\n8-9 September 2022</p>\n<p>Submission deadline:  Monday 1 August 2022<br>\n<a href=\"https://www.cl.cam.ac.uk/events/syco/9/\">https://www.cl.cam.ac.uk/events/syco/9/</a></p>\n<hr>\n<p>The Symposium on Compositional Structures (SYCO) is an interdisciplinary series of meetings aiming to support the growing community of researchers interested in the phenomenon of compositionality, from both applied and abstract perspectives, and in particular where category theory serves as a unifying common language. Previous SYCO events have been held in Birmingham, Strathclyde, Oxford, Chapman, Leicester and Tallinn.</p>\n<p>We welcome submissions from researchers across computer science,<br>\nmathematics, physics, philosophy, and beyond, with the aim of<br>\nfostering friendly discussion, disseminating new ideas, and spreading<br>\nknowledge between fields. Submission is encouraged for both mature<br>\nresearch and work in progress, and by both established academics and<br>\njunior researchers, including students. Submissions is easy, with no formatting or page restrictions. The meeting does not have proceedings, so work can be submitted even if it has been submitted or published elsewhere. You could submit work-in-progress, or a recently completed paper, or even a PhD or Masters thesis.</p>\n<p>While no list of topics could be exhaustive, SYCO welcomes submissions<br>\nwith a compositional focus related to any of the following areas, in<br>\nparticular from the perspective of category theory:</p>\n<ul>\n<li>\n<p>logical methods in computer science, including classical and<br>\nquantum programming, type theory, concurrency, natural language<br>\nprocessing and machine learning;</p>\n</li>\n<li>\n<p>graphical calculi, including string diagrams, Petri nets and<br>\nreaction networks;</p>\n</li>\n<li>\n<p>languages and frameworks, including process algebras, proof nets,<br>\ntype theory and game semantics;</p>\n</li>\n<li>\n<p>abstract algebra and pure category theory, including monoidal<br>\ncategory theory, higher category theory, operads, polygraphs, and<br>\nrelationships to homotopy theory;</p>\n</li>\n<li>\n<p>quantum algebra, including quantum computation and representation<br>\ntheory;</p>\n</li>\n<li>\n<p>tools and techniques, including rewriting, formal proofs and proof<br>\nassistants, and game theory;</p>\n</li>\n<li>\n<p>industrial applications, including case studies and real-world<br>\nproblem descriptions.</p>\n</li>\n</ul>\n<p><strong> IMPORTANT DATES </strong></p>\n<p>All deadlines are 23:59 Anywhere on Earth.</p>\n<p>Submission deadline: Monday 1 August<br>\nAuthor notification: Monday 8 August 2022<br>\nSymposium dates: Thursday 8 and Friday 9 September 2022</p>\n<p><strong> SUBMISSION INSTRUCTIONS </strong></p>\n<p>Submissions are by EasyChair, via the SYCO 9 submission page:<br>\n<a href=\"https://easychair.org/my/conference?conf=syco9\">https://easychair.org/my/conference?conf=syco9</a></p>\n<p>Submission is easy, with no format requirements or page restrictions.<br>\nThe meeting does not have proceedings, so work can be submitted even<br>\nif it has been submitted or published elsewhere. Think creatively:<br>\nyou could submit a recent paper, or notes on work in progress, or even<br>\na recent Masters or PhD thesis.</p>\n<p>In the event that more good-quality submissions are received than can<br>\nbe accommodated in the timetable, the programme committee may choose<br>\nto <em>defer</em> some submissions to a future meeting, rather than reject<br>\nthem. Deferred submissions can be re-submitted to any future SYCO<br>\nmeeting, where they will not need peer review, and where they will be<br>\nprioritised for inclusion in the programme. Meetings will be held<br>\nsufficiently frequently to avoid a backlog of deferred papers.</p>\n<p>If you have a submission which was deferred from a previous SYCO<br>\nmeeting, it will not automatically be considered for SYCO 9; you still<br>\nneed to submit it again through EasyChair. When submitting, append the<br>\nwords \"DEFERRED FROM SYCO X\" to the title of your paper, replacing \"X\"<br>\nwith the appropriate meeting number. There is no need to attach any<br>\ndocuments.</p>\n<p><strong> PROGRAMME COMMITTEE </strong></p>\n<p>The PC chair is John van de Wetering, Radboud University. The Programme Committee will be announced soon.</p>\n<p><strong> STEERING COMMITTEE </strong></p>\n<p>Ross Duncan, University of Strathclyde<br>\nChris Heunen, University of Edinburgh<br>\nDominic Horsman, University of Oxford<br>\nAleks Kissinger, University of Oxford<br>\nSamuel Mimram, École Polytechnique<br>\nSimona Paoli, University of Aberdeen<br>\nMehrnoosh Sadrzadeh, University College London<br>\nPawel Sobocinski, Tallinn University of Technology<br>\nJamie Vicary, University of Cambridge</p>",
        "id": 288194042,
        "sender_full_name": "Elena Di Lavore",
        "timestamp": 1656692829
    },
    {
        "content": "<p>It doesn't say anything <em>here</em>, but on the webpage it says the meeting is hybrid:</p>\n<blockquote>\n<p>The meeting will have an online component and all talks will be broadcast on Zoom. Registered online participants will be contacted by e-mail, closer to the meeting date, with the virtual coordinates.</p>\n</blockquote>",
        "id": 288196066,
        "sender_full_name": "John Baez",
        "timestamp": 1656693613
    },
    {
        "content": "<p>So, I can try to give a talk.</p>",
        "id": 288196117,
        "sender_full_name": "John Baez",
        "timestamp": 1656693647
    },
    {
        "content": "<p>I'm a bit unclear by the phrasing. So just to confirm: is there a possibility to give talks virtually? Or only in person talks (that they will broadcast?)</p>",
        "id": 288616182,
        "sender_full_name": "JS PL (he/him)",
        "timestamp": 1657075487
    },
    {
        "content": "<p>The usual rule for SYCO is to avoid online talks but to allow online participation, so we will try to broadcast or record the talks. Of course, we are aware of the uncertainties related to covid and we are ready to adapt if necessary.</p>",
        "id": 288798661,
        "sender_full_name": "Elena Di Lavore",
        "timestamp": 1657196731
    }
]