[
    {
        "content": "<p><a href=\"/user_uploads/21317/CivcM_n2QRdcWlbQzKGdJmKs/image.png\">image.png</a> <br>\nHow to understand what he calls \"hypersets\"? Is it self-reference that he talks about? How to understand this topic better? It seems like he's touching some fundamental problems of mathematics. Link to document: <a href=\"https://hal.archives-ouvertes.fr/hal-03779948/document\">https://hal.archives-ouvertes.fr/hal-03779948/document</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/CivcM_n2QRdcWlbQzKGdJmKs/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/CivcM_n2QRdcWlbQzKGdJmKs/image.png\"></a></div>",
        "id": 307607676,
        "sender_full_name": "Peiyuan Zhu",
        "timestamp": 1667419039
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"394227\">@Peiyuan Zhu</span>, this is not an answer to your question (or your previous one), but more of an observation that will hopefully help you to ask questions that more people are more willing to answer.  You will probably get better participation and engagement if your questions are self-contained.  Links and excerpts are good for pointing to supplementary things, but if someone has to click on a link or picture to even know what you're talking about, most of the time most people won't bother, even when they could have helped.</p>\n<p>To use your previous question as an example, compare:<br>\n\"Is there a way I can understand this development better in details? [image]\"<br>\nwith:<br>\n\"In [paper], [author] develops the idea of [idea].  Is there a way I can understand this development better in details? [image]\"</p>\n<p>In the first case there's nothing to indicate whether I might have anything constructive to add until I click the image.  The second case gives context.  Now the image is a convenient reference.  If I know something about the topic, I'm more likely to click on the image in the second case.</p>",
        "id": 307616324,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1667422326
    },
    {
        "content": "<p>Your latest question is a little better – I know you're talking about what someone calls hypersets, but I don't know who \"he\" is.  I can see you left a link to a french website, so should I even bother going there if I don't speak French?  If that's a link to the full document, \"The full document can be found here: [link]\" provides useful context.</p>",
        "id": 307616335,
        "sender_full_name": "Jason Erbele",
        "timestamp": 1667422334
    },
    {
        "content": "<p>It's a document written in English and that's the link to the full document</p>",
        "id": 307617692,
        "sender_full_name": "Peiyuan Zhu",
        "timestamp": 1667422934
    },
    {
        "content": "<p>I think he's discussing a history of Bourbaki group that went on with only binary relations, but there's more about multinary relations, and I think he's implying that it's not contained in category theory</p>",
        "id": 307618234,
        "sender_full_name": "Peiyuan Zhu",
        "timestamp": 1667423153
    },
    {
        "content": "<p>He did give a self-referrential definition of hyperset, but I'm confused about the definition by itself</p>",
        "id": 307618332,
        "sender_full_name": "Peiyuan Zhu",
        "timestamp": 1667423190
    },
    {
        "content": "<p>Here's the definition <a href=\"/user_uploads/21317/4E_lxkdJb5cxVZ2HraE6aR9H/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/4E_lxkdJb5cxVZ2HraE6aR9H/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/4E_lxkdJb5cxVZ2HraE6aR9H/image.png\"></a></div>",
        "id": 307618386,
        "sender_full_name": "Peiyuan Zhu",
        "timestamp": 1667423219
    }
]