[
    {
        "content": "<p>How is category theory in Canada, and in Montreal in particular? I am currently browsing through their for PhD programs there. I recently found out about Montreal's CT group, specially at McGill, but some sources suggests it's defunct right now.</p>\n<p>edit: I know that Western has a few HoTT oriented faculty, and I know that at least Theo Freyd from Dalhousie/Perimeter uses higher categories in his work.  Also Joyal is emeritus at UdeM. But McGill/UToronto/Concordia (and others) have immense departments, so it's hard to browse through their faculty</p>",
        "id": 263159424,
        "sender_full_name": "Daniel Teixeira",
        "timestamp": 1638285522
    },
    {
        "content": "<p>I believe it's been defunct for a while; this was already effectively the case when I contacted Marta Bunge 4 years ago inquiring about PhD opportunities in category theory there (that was her assessment at the time, since she was retiring, or at least no longer in a position to take on PhD students).</p>",
        "id": 263159948,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1638285767
    },
    {
        "content": "<p>There is still category theory going on in Canada.  From the computer science side of things, there is the conference FMCS which is attended by category theorists in Canada and their colleauges.  Here is the 2019 program if you want to see who is active: <a href=\"https://pages.cpsc.ucalgary.ca/~robin/FMCS/FMCS2019/schedule.html\">https://pages.cpsc.ucalgary.ca/~robin/FMCS/FMCS2019/schedule.html</a></p>",
        "id": 263160652,
        "sender_full_name": "Cole Comfort",
        "timestamp": 1638286033
    },
    {
        "content": "<p><a href=\"https://www.cs.mcgill.ca/~prakash/\">Prakash Panangaden</a> from McGill is still very active in category theory applied to CS (especially machine learning).</p>",
        "id": 263162030,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1638286578
    },
    {
        "content": "<p>Dorette Pronk and collaborators are doing category theory in Nova Scotia</p>",
        "id": 263195215,
        "sender_full_name": "Jade Master",
        "timestamp": 1638300181
    },
    {
        "content": "<p>At uOttawa there's Pieter Hofstra and Simon Henry, (and Phil Scott &amp; Rick Blute with emeritus status, both still active) + their students and me with a temporary position.</p>",
        "id": 263195815,
        "sender_full_name": "Martti Karvonen",
        "timestamp": 1638300466
    },
    {
        "content": "<p>The most active person I know in category theory at McGill is <a href=\"https://www.cs.mcgill.ca/~prakash/\">Prakash Panagaden</a>:</p>\n<blockquote>\n<p>I have three research areas: (a) semantics and logics for probabilistic systems and languages (b) theoretical aspects of machine learning (c) quantum information theory. I work on approximation of continuous-state systems and associated metrics and logics. I am working on a quantitative extension of equational logic which allows one to carry out approximate reasoning equationally. I have been working on Stone duality for Markov processes and completeness theorems for Markovian logics. I am also interested in duality for automata and using it for minimization. Recently I have begun working on diffusion and similar continuous-time Markov processes . I have not been active in quantum information theory for a while but I have just started working on it again.</p>\n</blockquote>",
        "id": 263218338,
        "sender_full_name": "John Baez",
        "timestamp": 1638311412
    },
    {
        "content": "<p>Andre Joyal is quite active in a way, for example he's been working on infinity-topos theory with Damien Calaque and Mathieu Anel, but he's probably not taking students.</p>",
        "id": 263218680,
        "sender_full_name": "John Baez",
        "timestamp": 1638311607
    },
    {
        "content": "<p>At Dalhousie <a href=\"https://www.mathstat.dal.ca/~selinger/\">Peter Selinger</a> has built up a big group working on quantum programming languages, with a firm foundation in category theory.  I think he's getting millions of dollars from DARPA or some other US agency.</p>",
        "id": 263219074,
        "sender_full_name": "John Baez",
        "timestamp": 1638311813
    },
    {
        "content": "<p>This topic was moved by <span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span> to <a class=\"stream-topic\" data-stream-id=\"245502\" href=\"/#narrow/stream/245502-general.3A-positions/topic/CT.20in.20Canada\">#general: positions &gt; CT in Canada</a></p>",
        "id": 263273138,
        "sender_full_name": "Notification Bot",
        "timestamp": 1638356331
    }
]