[
    {
        "content": "<p>Hello all, in a neverending effort to get a more intuitive grasp of formal content, I just noticed something and I'm wondering if there is a deeper notion behind it.</p>\n<p>The pentagon and triangle diagrams for the associative and unital coherence properties of a monoidal category are of course 5-sided and 3-sided. Moving up one  \"dimension\" to monoidal functors, however, the coherence diagrams become 6-sided and 4-sided, respectively. </p>\n<p>Meaningless coincidence, trivial answer which I just don't see, or something more? Thanks</p>",
        "id": 378183457,
        "sender_full_name": "Kyle Wilkinson",
        "timestamp": 1690212305
    },
    {
        "content": "<p>So, I imagine this has seemed like a silly question. At least for me it is not an important question, just a curiousity. </p>\n<p>But, I have found papers discussing the combinatoric (digraph) properties of commutative diagrams (conditions under which gluing diagrams can maintain commutative structures), related to the work of A. Ehressman, who takes a different approach to applying category theory (primarily cone limits of concrete diagrams rather than monoidal categories).</p>\n<p>Closer to answering my question though is probably the idea of associahedra: <a href=\"https://en.wikipedia.org/wiki/Associahedron#Examples\">https://en.wikipedia.org/wiki/Associahedron#Examples</a><br>\n\"The two-dimensional associahedron K4 represents the five parenthesizations of four symbols, or the five triangulations of a regular pentagon. It is itself a pentagon and is related to the pentagon diagram of a monoidal category.\"</p>\n<p>I don't yet understand enough to follow much in homotopy theory, which is evidently where this takes you. </p>\n<p>Anyway, just pointing out it may not be an entirely silly question!</p>",
        "id": 378796228,
        "sender_full_name": "Kyle Wilkinson",
        "timestamp": 1690377131
    },
    {
        "content": "<p>I was going to say: I think it's a coincidence that the  pentagon and triangle diagrams for the associative and unital coherence properties of a monoidal category are 5-sided and 3-sided, while the coherence diagrams for monoidal functors are 6-sided and 4-sided, respectively.  There <em>might</em> be some deep reason for it, but I can't see one.</p>",
        "id": 378851910,
        "sender_full_name": "John Baez",
        "timestamp": 1690385946
    },
    {
        "content": "<p>There are a lot of nice patterns as go from monoidal categories to monoidal bicategories to monoidal tricategories and son: the pentagon gets replaced by the 3d associahedron:</p>\n<p><a href=\"/user_uploads/21317/E2Z8zIuQOmzCjttrT58_o7Da/800px-Associahedron_K5_front.svg.jpg\">.</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/E2Z8zIuQOmzCjttrT58_o7Da/800px-Associahedron_K5_front.svg.jpg\" title=\".\"><img src=\"/user_uploads/21317/E2Z8zIuQOmzCjttrT58_o7Da/800px-Associahedron_K5_front.svg.jpg\"></a></div><p>and then the 4d associahedron and so on.</p>",
        "id": 378853037,
        "sender_full_name": "John Baez",
        "timestamp": 1690386128
    },
    {
        "content": "<p>You don't need to know any homotopy theory to study the patterns here.  </p>\n<ul>\n<li><a href=\"https://www.maths.dur.ac.uk/users/anna.felikson/Projects/assoc/assoc-res.html\">Associahedra: some (mostly on-line) resources</a>.</li>\n</ul>",
        "id": 378853290,
        "sender_full_name": "John Baez",
        "timestamp": 1690386174
    },
    {
        "content": "<p>The patterns for the unit laws are less well studied (but see '<a href=\"https://math.ucr.edu/home/baez/trimble/polyhedra.html\">monoidahedra</a>' and '<a href=\"https://arxiv.org/abs/1110.1959\">unital associahedra</a>', and the laws for monoidal functors, monoidal natural transformations, monoidal perturbations etc. are even less well studied I think.</p>",
        "id": 378853983,
        "sender_full_name": "John Baez",
        "timestamp": 1690386285
    },
    {
        "content": "<p>So there's a lot to do in this realm.</p>",
        "id": 378854053,
        "sender_full_name": "John Baez",
        "timestamp": 1690386298
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"407556\">@Carlos Zapata-Carratala</span> I think these diagrams / diagram patterns are right up your alley.</p>",
        "id": 378856901,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1690386845
    },
    {
        "content": "<p>I'd like to temporarily \"unresolve\" this just to point out that a lot of ideas underlying the connection were explored by Ross Street and Iain Aitchison around 40 years ago. In particular, lurking within Street's paper The Algebra of Oriented Simplexes is the combinatorics of associahedra, and the combinatorics of the polyhedral shapes associated with higher-order monoidal functors is lurking within a companion work The Geometry of Oriented Cubes by Aitchison. There are \"Aitchison-Pascal\" triangles which give rules for generating these polytopes. This is also connected with some old ideas of Dominic Verity for deriving parity structures on these polytopes in terms of some surface diagram theory he developed (and which I might be able to recall if I think enough about it). The PhD thesis of Sjoerd Crans is also relevant here, I believe. </p>\n<p>I have to apologize for being so vague here; the trouble is, I've forgotten a lot of how this works and I doubt I can lay my hands on those handwritten notes by Aitchison (who is no longer in academe) that displays his Pascal triangle and his recursive rules. But it seems worth pointing out in case someone wants to take up the thread, and mining some treasure troves of all but lost ideas. My suggestion would be to get in touch with Street, who is much more organized than I am and surely still has a copy of Aitchison's diagrams. Meanwhile, if you guys know about certain secret tunnels of the \"Russian underground\", a doi for one of Street's papers which describes some of these ideas is doi:10.1007/BF00872948 (I'd link to it directly, but I don't know how this Zulip feels about such links). </p>\n<p>So, it may be appropriate to mark this as unresolved after all, until I or someone else can revive the fading embers of such old thoughts...</p>",
        "id": 380507291,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1690842109
    },
    {
        "content": "<p>It's sad that one might need to resort to the \"Russian underground\" to get ahold of a paper published by Springer, but in this case it's not necessary since it's on Street's website:</p>\n<ul>\n<li>Ross Street, <a href=\"http://maths.mq.edu.au/~street/48.pdf\">Higher categories, strings, cubes and simplex equations</a>.</li>\n</ul>",
        "id": 380514235,
        "sender_full_name": "John Baez",
        "timestamp": 1690845011
    },
    {
        "content": "<p>The mention of combinatorics of the Gray tensor product has made me want to start going through a recent paper I saw <a href=\"https://arxiv.org/pdf/2206.13725v1.pdf\">on the combinatorics of the Gray cylinder</a> by Paul Roy Lessard. There is also Christoph Dorn's thesis on <a href=\"https://arxiv.org/pdf/1812.10586.pdf\">associative n-categories</a> that defines fully combinatorial models of higher categories, and conjectures that associative n-categories are the appropriate generalization of Gray categories. </p>\n<p>Nick Gurski has also suggested to me the idea of operadic methods for categorical coherence problems. My response to this notion was to first find an appropriate decorated tree structure for things like transformations and modifications (utilizing work by Andrew Tonks, Stephan Forcey, and others). I thought it might be neat to turn some of the axioms from Gurski's book on tricategorical coherence into decorated tree versions, and included some below:</p>\n<p><a href=\"/user_uploads/21317/CPb-O0U1ruwlY-uyz8qekpOM/1.jpeg\">an axiom for trimodification</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/CPb-O0U1ruwlY-uyz8qekpOM/1.jpeg\" title=\"an axiom for trimodification\"><img src=\"/user_uploads/21317/CPb-O0U1ruwlY-uyz8qekpOM/1.jpeg\"></a></div><p><a href=\"/user_uploads/21317/3vrXh-aHZkLQKUFZjHoovOI9/2.jpeg\">an axiom for tritransformation, part 1</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/3vrXh-aHZkLQKUFZjHoovOI9/2.jpeg\" title=\"an axiom for tritransformation, part 1\"><img src=\"/user_uploads/21317/3vrXh-aHZkLQKUFZjHoovOI9/2.jpeg\"></a></div><p><a href=\"/user_uploads/21317/DCQUFeaeL-TVQYGiXZWbx-vX/3.jpeg\">an axiom for tritransformation, part 2</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/DCQUFeaeL-TVQYGiXZWbx-vX/3.jpeg\" title=\"an axiom for tritransformation, part 2\"><img src=\"/user_uploads/21317/DCQUFeaeL-TVQYGiXZWbx-vX/3.jpeg\"></a></div>",
        "id": 380524215,
        "sender_full_name": "Christopher Tapo",
        "timestamp": 1690849830
    }
]