[
    {
        "content": "<p>I guess I'd want to start by talking about what counts as \"fascinating\".   It's a very subjective term and I try to analyze things in a bit more fine-grained way that's hopefully a bit more useful than mere \"fascination\".  I can be fascinated by something for a week and then stop being fascinated by it.</p>\n<p>Some theorems are fascinating because the result is surprising.  Some are fascinating because the result is really beautiful even if the proof not very pretty or easy to understand.  Some theorems are fascinating because the proofs are really worthwhile - bringing in new concepts that make perfect sense once you get them.  And so on.  </p>\n<p>Also, I don't tend to focus on \"theorems\" so much as subjects, which are usually bundles of examples, definitions and theorems.</p>",
        "id": 277183452,
        "sender_full_name": "John Baez",
        "timestamp": 1648663143
    },
    {
        "content": "<p>For example, for the last month I've been fascinated by this subject: <a href=\"https://en.wikipedia.org/wiki/Abelian_variety\">abelian varieties</a>.  Lange and Birkenhake's book <em>Complex Abelian Varieties</em> is the book I want to understand.  The Appell-Humbert theorem classifies line bundles on abelian varieties, and this theorem sits near the heart of this subject.  But there are a whole bunch of other connected theorems and definition, and it's probably the <em>examples</em> that make this subject fun for me. </p>\n<p>Why am I fascinated by this subject?  One reason is that at first it seems scary - I'd never studied algebraic geometry very much, and \"principally polarized abelian variety\" is the kind of buzzword I associated with scary people - yet in the end it turns out to be not so bad.  It's a lot like linear algebra, but linear algebra where your vector spaces come with lattices inside them.  So it's like bumping into a branch of linear algebra that I'd never gotten around to thinking about!</p>",
        "id": 277184760,
        "sender_full_name": "John Baez",
        "timestamp": 1648663709
    },
    {
        "content": "<p>Another reason it's fascinating is that everyone talks a lot about elliptic curves - in a way they're the simplest really interesting example of algebraic varieties, so I started by trying to learn a bunch about those, years ago - and elliptic curves are exactly the same as <em>1-dimensional</em> abelian varieties.</p>",
        "id": 277186385,
        "sender_full_name": "John Baez",
        "timestamp": 1648664508
    },
    {
        "content": "<p>So, it's a lot like having studied 1-variable calculus for years and then suddenly reading about multi-variable calculus.    The perspective broadens; some things stay the same but some change.</p>",
        "id": 277186799,
        "sender_full_name": "John Baez",
        "timestamp": 1648664661
    },
    {
        "content": "<p>Yet another reason this subject is fascinating is that I'm thinking a lot about 2-rigs (basically categorified rings), and working on them with <span class=\"user-mention\" data-user-id=\"275914\">@Joe Moeller</span> and <span class=\"user-mention\" data-user-id=\"277611\">@Todd Trimble</span>, and this subject is a source of really interesting examples.</p>",
        "id": 277187393,
        "sender_full_name": "John Baez",
        "timestamp": 1648664932
    },
    {
        "content": "<p>I think the <a href=\"https://en.wikipedia.org/wiki/PCP_theorem\">PCP theorem</a> from complexity theory is utterly mind-blowing.</p>",
        "id": 277202900,
        "sender_full_name": "Graham Manuell",
        "timestamp": 1648673801
    }
]