[
    {
        "content": "<p>The usual proof to obtain any limit out of products and equalizers relies on the axiom of choice (to choose the products, since we only need existence of the equalizer, we don't need to choose one). Can we prove this without the axiom of choice?</p>",
        "id": 307010565,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1667166052
    },
    {
        "content": "<p>This question confuses me. The result you're quoting is the construction of the limit of a given diagram as an equalizer of a pair of arrows between products determined by the diagram (assuming the latter exist). If the choice you're talking about it the choice of a specific representative of the product in order to form the equalizer diagram, how could the construction possibly avoid such a choice? But moreover, how does that depend on the axiom of choice?</p>",
        "id": 307010951,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667166432
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"284005\">Ralph Sarkis</span> <a href=\"#narrow/stream/229199-learning.3A-questions/topic/Limits.20from.20products.20and.20equalizsers.20without.20choice/near/307010565\">said</a>:</p>\n<blockquote>\n<p>Can we prove this without the axiom of choice?</p>\n</blockquote>\n<p>I was using \"this\" (rather clumsily) to refer to the statement: If <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>C</mi></mrow><annotation encoding=\"application/x-tex\">C</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07153em;\">C</span></span></span></span> has products and equalizers, then it is complete. The usual way to prove this is by giving a construction (the one you described) that uses choice. Is there another way to prove existence of the limits without necessarily constructing them?,  or constructing them without choice?</p>",
        "id": 307012419,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1667167744
    },
    {
        "content": "<p>But in a constructive setting, \"having products and equalizers\" means \"having specified products and equalizers\"; there's no choice involved</p>",
        "id": 307014342,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667169212
    },
    {
        "content": "<p>I see. Thanks!</p>",
        "id": 307015091,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1667169955
    },
    {
        "content": "<p>I said that rather authoritatively, but it's true that there's some subtlety here: in Set we need choice to assert that we can construct an element of a product, but the \"construction\" of the product itself is choice free. On the other hand, when we construct one category from another, the new category may inherit structure such as products but without inheriting a specified choice, and so asserting that it \"has products\" in the sense of specified products requires some form of choice. I don't have good examples to hand, but Johnstone discusses this at some point in Sketches of an Elephant (if it's of interest I can find the ref tomorrow)</p>",
        "id": 307015957,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1667170684
    },
    {
        "content": "<p>It's ok, I was just wondering whether I should point out the choice we make when I teach this proof, but I think this subtlety goes too far.</p>",
        "id": 307017349,
        "sender_full_name": "Ralph Sarkis",
        "timestamp": 1667172048
    }
]