[
    {
        "content": "<p>I have been thinking about categories more as abstract objects in their own right, where you do not need to interpret their objects and arrows as some underlying mathematical objects like sets, topologies, etc.</p>\n<p>This has made me wonder if it is mathematically rigorous to even say that the objects and arrows of a category “are” anything, other than, abstractly, something called “objects” and “arrows”.</p>\n<p>If we say that the arrows are actually group homomorphisms, for example, couldn’t we have some technical apparatus declaring like, a correspondence, first, between objects in group theory, and the abstract elements of a category in category theory, before we go ahead and start to use concepts in category theory to prove, or describe, things in group theory?</p>",
        "id": 383326711,
        "sender_full_name": "Julius",
        "timestamp": 1691594601
    },
    {
        "content": "<p>You can prove theorems about abstract categories where you don't say what the objects and morphisms are, but you can also start in some framework (like traditional set theory, or type theory, etc.) and define (say) \"groups\" and \"homomorphisms\" between them, and then prove they form a category, and then prove theorems about that category, where you get to use properties of groups and homomorphisms.   Both approaches are extremely common, and they interact nicely.</p>",
        "id": 383341148,
        "sender_full_name": "John Baez",
        "timestamp": 1691597068
    },
    {
        "content": "<p>Ok, thanks.<br>\nThis is sort of interesting, <a href=\"https://mathoverflow.net/questions/82526/does-there-exist-a-name-for-a-nonassociative-category-without-identities\">https://mathoverflow.net/questions/82526/does-there-exist-a-name-for-a-nonassociative-category-without-identities</a> , wondering why associativity is so important, if useful structures only emerge with it present. But here it seems there is a whole theory of non-associative categories.</p>",
        "id": 383375663,
        "sender_full_name": "Julius",
        "timestamp": 1691603658
    },
    {
        "content": "<p>Well, I don't know that it's such a big theory. I guess about the same size theory as for <a href=\"https://ncatlab.org/nlab/show/magma\">magmas</a>, which are \"structures without properties\", hence useful for some purposes. </p>\n<p>Category theory is much bigger, and associativity and identities really are important. One way (just one way) of thinking about associativity is that it guarantees that hom-functors <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>hom</mi><mo>⁡</mo><mo stretchy=\"false\">(</mo><mi>A</mi><mo separator=\"true\">,</mo><mo>−</mo><mo stretchy=\"false\">)</mo><mo separator=\"true\">,</mo><mi>hom</mi><mo>⁡</mo><mo stretchy=\"false\">(</mo><mo>−</mo><mo separator=\"true\">,</mo><mi>A</mi><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">\\hom(A, -), \\hom(-, A)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mop\">hom</span><span class=\"mopen\">(</span><span class=\"mord mathnormal\">A</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord\">−</span><span class=\"mclose\">)</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mop\">hom</span><span class=\"mopen\">(</span><span class=\"mord\">−</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\">A</span><span class=\"mclose\">)</span></span></span></span> actually are functors (preserve composition). And associativity together with units are crucial to the proof of the Yoneda lemma, in all of its glory and manifestations. It is to my mind is <em>the</em> most fundamental result of category theory (although it takes time to appreciate why it's so fundamental: it brings together many themes surrounding universal properties and representable functors and adjunctions and so much more).</p>",
        "id": 383382483,
        "sender_full_name": "Todd Trimble",
        "timestamp": 1691605231
    },
    {
        "content": "<p>Another perspective regarding whether objects \"are \"something: <br>\nAs far as I understand, the data describing an object in a category only has impact on the mathematical structure of that category if it has some impact on what morphisms exist in that category and how they compose. For example, I could define a category where the objects are groups, and the morphisms are all functions between the underlying sets of these groups. This category is a lot like a category where the objects are sets and the morphisms are functions between them. If, however, we require these functions between groups to preserve the group structure (so the functions describe group homomorphisms), then the resulting category becomes very different from the category of sets with functions between them.</p>\n<p>I think this perspective is especially relevant when trying to think about how to apply categories. I suspect it's probably good to call an object in some category by some intuitive name relating to an application, and to associate some application-relevant data to that object. However, unless this data has some impact on the morphisms of the category being used to model an application, that application data is not really being reflected in the mathematical structure of the category.</p>",
        "id": 383391654,
        "sender_full_name": "David Egolf",
        "timestamp": 1691607424
    },
    {
        "content": "<p>There's nothing particularly special about category theory here: <em>all</em> structures in mathematics can be studied either abstractly, where the constituents of the structure have no known internal identity other than their \"places\" in the structure, or concretely using specific examples where the elements have other identity.  For instance, in an abstract group the elements aren't assumed to \"be\" anything other than \"the elements of the underlying set of the group\", but in a concrete group these elements may be numbers, matrices, permutations, etc.</p>",
        "id": 383392400,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1691607607
    },
    {
        "content": "<p>Yes, organizing transformations of some set, vector space, etc. into a group and saying that the abstract group is what really matters is a distillation which involves a choice of opinion about what \"really matters\", much as organizing some structured sets and structure-preserving maps into a category and saying the abstract category is what \"really matters\" - in fact it's a special case.</p>",
        "id": 383431514,
        "sender_full_name": "John Baez",
        "timestamp": 1691622062
    },
    {
        "content": "<p>Luckily, category theory has ways of recording the concreteness of such situations if we want to: we're not stuck in abstractness.   See <a href=\"https://ncatlab.org/nlab/show/concrete%20category\">[[concrete category]]</a>, for example.</p>",
        "id": 383431731,
        "sender_full_name": "John Baez",
        "timestamp": 1691622172
    }
]