[
    {
        "content": "<p>[Beginner Question]: I am working through Spivak's textbook, <em>Category Theory for the Sciences</em>, and am learning about Ontology Logs (ologs). There was a practice problem in the text book that went like this:</p>\n<blockquote>\n<p>Create an olog for human nuclear biological families that includes the concepts of person, man, woman, parent, father, mother, and child. Make sure to label all the arrows and that each arrow indicates a valid aspect in the sense of Section 2.3.2.1. Indicate with check marks the diagrams that are intended to commute. If the 2-dimensionality of the page prevents a check mark from being unambiguous, indicate the intended commutativity with an equation.</p>\n</blockquote>\n<p>For an initial first pass, I left out the check marks but came up with this diagram. <a href=\"/user_uploads/21317/NZ1zUN0fbZWySPoZPtZzl7gQ/family_olog.png\">family_olog.png</a>.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/NZ1zUN0fbZWySPoZPtZzl7gQ/family_olog.png\" title=\"family_olog.png\"><img src=\"/user_uploads/21317/NZ1zUN0fbZWySPoZPtZzl7gQ/family_olog.png\"></a></div>",
        "id": 287400905,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1656117718
    },
    {
        "content": "<p>When I compared my answer to his, he had something quite different: <a href=\"/user_uploads/21317/sP2Kqc_ugvUp7Y0iNhDuCyyU/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/21317/sP2Kqc_ugvUp7Y0iNhDuCyyU/image.png\" title=\"image.png\"><img src=\"/user_uploads/21317/sP2Kqc_ugvUp7Y0iNhDuCyyU/image.png\"></a></div>",
        "id": 287400954,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1656117748
    },
    {
        "content": "<p>His answer made sense after I reviewed it.<br>\nIt seems that with ologs, one should really only box together objects only when absolutely necessary.<br>\nIn mine, I tried using compound boxes to denote morphisms between objects all at once.<br>\nI am just somewhat surprised that I didn't think to keep things as independent as possible.<br>\nDoes anyone have any tips or thoughts about constructing ologs in general or additional practice problems to think more categorically?<br>\nTrying to build my category theory intuition but it seems like I certainly need more practice here!<br>\nThank you!</p>",
        "id": 287401050,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1656117876
    }
]