[
    {
        "content": "<p>One way of defining (coloured) props, (coloured) properads and symmetric polycategories is as structures with the same type of underlying data — morphisms with \"multiple inputs\" and \"multiple outputs\" — but different classes of \"composable string diagrams\":</p>\n<ul>\n<li>in a prop, you can compose all well-formed string diagrams;</li>\n<li>in a properad, you can compose only the <em>connected</em> string diagrams;</li>\n<li>in a polycategory, you can compose only the <em>simply connected</em> string diagrams.</li>\n</ul>\n<p>So given a prop, you can always get a properad and a polycategory by restricting the composition operations, and conversely you can ask whether it is possible to consistently extend the compositions of a polycategory to that of a properad or prop, or the compositions of a properad to those of a prop.</p>\n<p>While there is plenty of natural examples of polycategories that do not extend to properads/props (for example those arising from \"nondegenerate\" models of linear logic), I realised I do not know any particularly natural examples of properads that are not restrictions of props.<br>\n(By \"natural\" I mean ones that are not free, or do not somehow have \"connected graphs\" built in the definition).</p>\n<p>Can someone teach me some examples?</p>",
        "id": 295003923,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1661331068
    },
    {
        "content": "<blockquote>\n<p>there are plenty of natural examples of polycategories that do not extend to properads/props (for example those arising from \"nondegenerate\" models of linear logic)</p>\n</blockquote>\n<p>I certainly believe there are polycategories that can't be embedded <em>fully and faithfully</em> in props; I think you can argue for this using traces among other ways.  But are there polycategories that can't be embedded <em>faithfully</em> in any prop?  I have wondered this for a while but haven't found an answer.</p>",
        "id": 295092581,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1661361919
    },
    {
        "content": "<p>I don't know the answer to that question but I'd also like to know!</p>\n<p>I realise the phrasing “do not extend to” was ambiguous; I only meant “they are not in the essential image of the forgetful functor from (props) to (polycategories)”.</p>\n<p>So my first constraint is to exclude </p>\n<ul>\n<li>the properads in the essential image of the forgetful functor from (props),</li>\n</ul>\n<p>while one attempt to phrase the “natural example” constraint in a slightly more specific way is to exclude</p>\n<ul>\n<li>the properads such that the “free prop” on them is, arguably, the “more natural” mathematical object (or at least “equally natural”).</li>\n</ul>\n<p>This, for example, rules out the “properad of connected d-cobordisms” that somebody suggested to me elsewhere, since the free prop it generates is equivalent to the prop of <em>all</em> d-cobordisms, arguably more/equally “natural”.</p>",
        "id": 295109598,
        "sender_full_name": "Amar Hadzihasanovic",
        "timestamp": 1661368356
    },
    {
        "content": "<p>I think \"in the essential image of the forgetful functor from (props) to (polycategories)” is the same as saying \"embeds fully-faithfully in a prop\"?</p>",
        "id": 295116220,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1661370859
    }
]