[
    {
        "content": "<p>My hope was that the knowledgeable people here could tell me that the reflection principle I stated has a model (which also satisfies TG), which would exclude the first interpretation anyway. :P</p>",
        "id": 251454151,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1630441836
    },
    {
        "content": "<p>I did a bit of reading and the closest I found is the theory ZMC/S from Mike's <em>Set theory for category theory</em>. But it seems TG + the reflection principle I stated is stronger.</p>",
        "id": 251456300,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1630442694
    },
    {
        "content": "<p>A weaker reflection principle which would still be satisfactory is the existence of arbitrarily large Grothendieck universes reflecting all formulas.</p>",
        "id": 251456975,
        "sender_full_name": "Leopold Schlicht",
        "timestamp": 1630442963
    },
    {
        "content": "<p>It seems unlikely to me that it would be possible to model a reflection principle saying that <em>all</em> Grothendieck universes reflect the theory of the entire universe, which is what your original version seems to claim.  The existence of arbitrarily large Grothendieck universes with this property seems more likely to me to be consistent relative to some large cardinal axiom.  Just as ZMC/S is equiconsistent with \"the universe is Mahlo\", I would guess that maybe your reflection principle is equiconsistent with something like \"there is a proper class of Mahlo cardinals\" or perhaps \"the universe is 1-Mahlo\".  But you'll probably get better answers to a question like that on a forum that includes more set theorists.  I don't know if there is a set theory Zulip, but you could try MathOverflow.</p>",
        "id": 251458481,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1630443487
    },
    {
        "content": "<p>You should probably also notify <span class=\"user-mention\" data-user-id=\"416301\">@Zhen Lin Low</span>, who may be able to answer your question about the cited preprint.</p>",
        "id": 251458614,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1630443544
    }
]