[
    {
        "content": "<p>I seem to be confused about module objects (over a monoid object) in a monoidal category, and the monoidal (tensor) product of these. <br>\nWorking in the cartesian category of sets, \"modules\" are monoid actions, and tensoring these involves copying, aka the coproduct. This story seems to carry over to the linear case, which is about modules over a bimonoid (or Hopf algebra). I'm hoping this is all correct so far, and includes some other important examples, such as tensoring of algebras over a monad. (This is part of my (foolish) mission to rewrite all of mathematics using string diagrams, and all this monoid business seems to be the \"killer app\" of string diagrams...) <br>\nMy confusion arises because there is <a href=\"https://ncatlab.org/nlab/show/tensor+product+of+modules#definition\">another definition</a> of tensor product of modules, which uses a coequalizer to force the action of the monoid object on the two tensor factors to be equal. I'm hoping there is some slick explanation of why there are these two definitions: one using the coproduct, and one using a coequalizer, and why/why don't they result in the same tensor product. Is it something to do with enriched categories?</p>",
        "id": 292358147,
        "sender_full_name": "Simon Burton",
        "timestamp": 1659930848
    },
    {
        "content": "<p>I don't know of any definition of tensor product that only involves the coproduct. It is a theorem that in the category of commutative rings (and more generally commutative monoids), the underlying object (i.e. abelian group in the case of rings) of the coproduct is the monoidal product of the underlying objects.</p>",
        "id": 292388721,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1659957715
    },
    {
        "content": "<p>The enriched category theory perspective is that the tensor product of (bi)modules is a special case of a weighted colimit of base-valued functors ... a.k.a. profunctors. The tensor product is profunctor composition.</p>",
        "id": 292389794,
        "sender_full_name": "Zhen Lin Low",
        "timestamp": 1659958445
    }
]