[
    {
        "content": "<p>To tell the truth, I don't really understand what all the presheaf stuff tells us about the geometric side of things? Can we actually go from meaningful statements about logics to meaningful statements about topological/geometric structures through topoi? <br>\nLike can we go from Lindstrom's theorem to something meaningful about topologies maybe?</p>\n<p>so i haven't really gone far enough into topos theory to have a satisfactory answer to this question but<br>\nfirst of all like the reason topos theory was invented is that the category of sheaves over a space contains a lot of information about it, not just from a theoretical point of view that you can practically reconstruct it but from the practical point of view that sheaf cohomology, which is a crucial algebraic invariant which tells you a lot of stuff, already requires you in some sense to pass through the topos. so the fact that this category has a rich internal logic should be helpful somehow.</p>\n<p>Second, it is sometimes less important that topos logic is an intuitionistic logic than that it is a modal logic. It is a kind of modal logic with respect to the Kripke frame of open subsets of the topological space, and it is naturally equipped with a certain modal operator , \"locally\", i.e. it is locally the case that P<br>\nI think that historical arguments in geometry about a \"generic point\" in a variety can likely be interpreted as a kind of forcing argument in the sheaf of functions over the stalk<br>\nbut this is a very broad statement with a lot of details missing and I don't have a lot of examples<br>\n<a href=\"https://rawgit.com/iblech/internal-methods/master/notes.pdf\">https://rawgit.com/iblech/internal-methods/master/notes.pdf</a><br>\nIngo Blechschmidt's PhD thesis is the main work i know of in applications of logic to geometry through topos theory</p>\n<p>so anyone have an to answer this question?</p>",
        "id": 301350945,
        "sender_full_name": "Racky Dichminky",
        "timestamp": 1664411640
    }
]