[
    {
        "content": "<p>Begin with the following:</p>\n<p>a) (X, x ∈ X) is pointed sets, fibered over Set by first projection.<br>\nb) (X, S ⊆ X) is propositions on sets, fibered over Set by first projection.</p>\n<p>Now, consider the category given by objects (X, L ⊆ P(X)), for some class of Ls. Morphisms are given by set functions f which act pulling back sets in L' to sets in L given as their preimage in f.</p>\n<p>My question is: under what conditions is (X, L ⊆ P(X)), \"pre-covers on sets\" fibered over Set by first projection?</p>\n<p>By conditions, I'm thinking along the lines of: \"L is closed under intersection\" or \"L, when viewed as a partially ordered set by inclusion is a distributive lattice\" or simply \"L contains the empty and maximal sets\", etc.</p>",
        "id": 302953741,
        "sender_full_name": "Gershom",
        "timestamp": 1665190081
    },
    {
        "content": "<p>As long as Ls pull back to Ls, you're fine. This condition is better given for families of morphisms than for families of objects though. See <a href=\"https://ncatlab.org/nlab/show/display%20map\">[[display map]]</a>.</p>",
        "id": 303048022,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1665252075
    },
    {
        "content": "<p>Also you might want to check out <a href=\"https://ncatlab.org/nlab/show/Grothendieck%20coverage\">[[Grothendieck coverage]]</a>, which formalizes this idea of 'covering'</p>",
        "id": 303048063,
        "sender_full_name": "Matteo Capucci (he/him)",
        "timestamp": 1665252113
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"266967\" href=\"/#narrow/stream/266967-general.3A-mathematics/topic/When.20is.20.28X.2CS.20.E2.8A.86.20P.28X.29.29.20-.3E.20X.20a.20fibration.3F\">#general: mathematics &gt; When is (X,S ⊆ P(X)) -&gt; X a fibration?</a> by <span class=\"user-mention silent\" data-user-id=\"275932\">Matteo Capucci (he/him)</span>.</p>",
        "id": 303048121,
        "sender_full_name": "Notification Bot",
        "timestamp": 1665252129
    },
    {
        "content": "<p>Nice, thanks! The displayed perspective is helpful here.</p>",
        "id": 303093921,
        "sender_full_name": "Gershom",
        "timestamp": 1665294262
    },
    {
        "content": "<p>Related question: what can be said about classes of morphisms that \"push forward\" Ls or indeed classes that do both?</p>",
        "id": 303094270,
        "sender_full_name": "Gershom",
        "timestamp": 1665294666
    },
    {
        "content": "<p>Additionally, a grothondieck coverage is i thought just another name for the topos generalization of a topology, no? So that has a bunch of conditions on it that amount to, when you're giving it on a discrete category (i.e. a set) that it is closed under certain operations. Note that what I'm asking about puts _no conditions_ on the collection of \"pre-covers\" and instead is asking what if any conditions must be there to get a (cartesian) fibration. Examples of \"set systems\" I have in mind that are not going to satisfy the conditions for topologies include greedoids, antimatroids, convexity spaces, etc.</p>",
        "id": 303094966,
        "sender_full_name": "Gershom",
        "timestamp": 1665295347
    }
]