[
    {
        "content": "<p>Come spend the summer at the Topos Institute! For early-career researchers, we’re excited to open up applications for our summer research associate (RA) program.</p>",
        "id": 274211404,
        "sender_full_name": "John Baez",
        "timestamp": 1646444439
    },
    {
        "content": "<p>Summer RAs are an important part of life at Topos — they help explore new directions relevant to Topos projects, and they bring new ideas, energy, and expertise to our research groups. This year we’ll welcome a new cohort of RAs to our offices in Berkeley, CA, with the program running from June to August.</p>",
        "id": 274211410,
        "sender_full_name": "John Baez",
        "timestamp": 1646444445
    },
    {
        "content": "<p>RAs will be responsible for performing an in-depth research or teaching project, mentored by a Topos faculty mentor or advisor. This year possible mentors may include Conal Elliott, Valeria de Paiva, Evan Patterson, Dana Scott, David Spivak, and others. RAs will work closely with their mentor to define and pursue a research project.</p>",
        "id": 274211428,
        "sender_full_name": "John Baez",
        "timestamp": 1646444476
    },
    {
        "content": "<p>Along the way, RAs will also participate in our weekly lunches and seminars, blog about their time here, and produce papers, books, software, or policy, according to the parameters of their project.</p>",
        "id": 274211432,
        "sender_full_name": "John Baez",
        "timestamp": 1646444480
    },
    {
        "content": "<p>Applications are now open. The position is full-time (~40 hours per week) and paid hourly starting at $30/hour. Unfortunately, Topos is not able to sponsor US work visas for participants.</p>\n<p>Please apply by Sunday March 27th. Offers of positions will be made in early April.</p>",
        "id": 274211513,
        "sender_full_name": "John Baez",
        "timestamp": 1646444560
    },
    {
        "content": "<p>For some more information, and to apply, <a href=\"https://topos.site/blog/2022/03/call-for-2022-summer-research-associates/\">go here</a>.</p>",
        "id": 274211535,
        "sender_full_name": "John Baez",
        "timestamp": 1646444593
    },
    {
        "content": "<p>Out of curiosity, are there any plans to host RAs in the Oxford office?</p>",
        "id": 274238893,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1646481013
    },
    {
        "content": "<p>That's an interesting idea, but I think not: Brendan Fong said </p>\n<blockquote>\n<p>Good: Dana Scott is excited about mentoring a project! He's suggested a project about a recent preprint of Peter Hines 'On strict reflexive extensionality in compact closed categories', but seems open to other topics too. So you could get paid to spend a summer learning from Dana Scott!</p>\n</blockquote>\n<blockquote>\n<p>Bad: We can't sponsor US work visas, so it's mostly an opportunity for people already based in the US in some way.</p>\n</blockquote>",
        "id": 274255239,
        "sender_full_name": "John Baez",
        "timestamp": 1646501409
    }
]