[
    {
        "content": "<p>Come spend the summer at the Topos Institute! For early-career researchers, we’re excited to open up applications for our summer research associate (RA) program.</p>",
        "id": 274211404,
        "sender_full_name": "John Baez",
        "timestamp": 1646444439
    },
    {
        "content": "<p>Summer RAs are an important part of life at Topos — they help explore new directions relevant to Topos projects, and they bring new ideas, energy, and expertise to our research groups. This year we’ll welcome a new cohort of RAs to our offices in Berkeley, CA, with the program running from June to August.</p>",
        "id": 274211410,
        "sender_full_name": "John Baez",
        "timestamp": 1646444445
    },
    {
        "content": "<p>RAs will be responsible for performing an in-depth research or teaching project, mentored by a Topos faculty mentor or advisor. This year possible mentors may include Conal Elliott, Valeria de Paiva, Evan Patterson, Dana Scott, David Spivak, and others. RAs will work closely with their mentor to define and pursue a research project.</p>",
        "id": 274211428,
        "sender_full_name": "John Baez",
        "timestamp": 1646444476
    },
    {
        "content": "<p>Along the way, RAs will also participate in our weekly lunches and seminars, blog about their time here, and produce papers, books, software, or policy, according to the parameters of their project.</p>",
        "id": 274211432,
        "sender_full_name": "John Baez",
        "timestamp": 1646444480
    },
    {
        "content": "<p>Applications are now open. The position is full-time (~40 hours per week) and paid hourly starting at $30/hour. Unfortunately, Topos is not able to sponsor US work visas for participants.</p>\n<p>Please apply by Sunday March 27th. Offers of positions will be made in early April.</p>",
        "id": 274211513,
        "sender_full_name": "John Baez",
        "timestamp": 1646444560
    },
    {
        "content": "<p>For some more information, and to apply, <a href=\"https://topos.site/blog/2022/03/call-for-2022-summer-research-associates/\">go here</a>.</p>",
        "id": 274211535,
        "sender_full_name": "John Baez",
        "timestamp": 1646444593
    },
    {
        "content": "<p>Out of curiosity, are there any plans to host RAs in the Oxford office?</p>",
        "id": 274238893,
        "sender_full_name": "Jules Hedges",
        "timestamp": 1646481013
    },
    {
        "content": "<p>That's an interesting idea, but I think not: Brendan Fong said </p>\n<blockquote>\n<p>Good: Dana Scott is excited about mentoring a project! He's suggested a project about a recent preprint of Peter Hines 'On strict reflexive extensionality in compact closed categories', but seems open to other topics too. So you could get paid to spend a summer learning from Dana Scott!</p>\n</blockquote>\n<blockquote>\n<p>Bad: We can't sponsor US work visas, so it's mostly an opportunity for people already based in the US in some way.</p>\n</blockquote>",
        "id": 274255239,
        "sender_full_name": "John Baez",
        "timestamp": 1646501409
    },
    {
        "content": "<p>Hi everyone, the call for applications for the 2023 Summer Research Associate program at Topos Institute is now open: <a href=\"https://topos.site/files/2023_Topos_Summer_RA_Announcement.pdf\">https://topos.site/files/2023_Topos_Summer_RA_Announcement.pdf</a></p>\n<p>This is a paid opportunity to do ACT research under the mentorship of research staff at Topos Institute. The position is in-person in Berkeley, CA. To get a sense of what people have done in the past, check out this website: <a href=\"https://topos.site/summer/\">https://topos.site/summer/</a></p>\n<p>The application deadline is <strong>February 15, 2023.</strong> If you have questions, feel free to ask!</p>",
        "id": 309069085,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1668110709
    },
    {
        "content": "<p>\"Topos is not able to sponsor visas for applicants.\" means that this is only open to US candidates?</p>",
        "id": 309135812,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1668147848
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"275965\">@Evan Patterson</span></p>",
        "id": 309136171,
        "sender_full_name": "Bryce Clarke",
        "timestamp": 1668148123
    },
    {
        "content": "<p>AFAIU, it means that non-US candidates would have to already possess US work rights or get them through their own devices. If you'd like further clarification, I could put you in touch with someone in Topos Institute admin who is more qualified to answer this question.</p>",
        "id": 309261922,
        "sender_full_name": "Evan Patterson",
        "timestamp": 1668201619
    },
    {
        "content": "<p>By the way, someone on Mathstodon asked why \"geometry of interaction\" is listed as a possible research topic.   Who is doing that?   (I associate it with French mathematicians, linear logic, etc.)</p>",
        "id": 311025655,
        "sender_full_name": "John Baez",
        "timestamp": 1668867751
    },
    {
        "content": "<p>Among non French people, I know Phil Scott and Abramsky who worked on that. As far as I understand GoI is something advanced based on linear logic such as Ludics which is even more obscure to me, or differential linear logic that nobody know unfortunately and yet other things, so the people who work on them obviously know well linear logic. At Topos, maybe <span class=\"user-mention\" data-user-id=\"276656\">@Valeria de Paiva</span> ?</p>",
        "id": 311026828,
        "sender_full_name": "Jean-Baptiste Vienney",
        "timestamp": 1668868294
    },
    {
        "content": "<p>hi <span class=\"user-mention\" data-user-id=\"428716\">@Jean-Baptiste Vienney</span>  I'm afraid nothing to do with me. But you're right, I'm interested in the Geometry of Interaction as well as Differential Linear Logic and Automatic Differentiation amongst others.</p>",
        "id": 311035935,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1668872904
    }
]