[
    {
        "content": "<p>I thought it might be easier if people could write down questions they had about the <a href=\"https://www.youtube.com/watch?v=hJrJSZlO-Ic\">video</a> that I've posted in the MRC wiki here.  </p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"hJrJSZlO-Ic\" href=\"https://www.youtube.com/watch?v=hJrJSZlO-Ic\"><img src=\"https://uploads.zulipusercontent.net/f927296fe8c3b817c70bd257ca8d2438f3428bf3/68747470733a2f2f692e7974696d672e636f6d2f76692f684a724a535a6c4f2d49632f64656661756c742e6a7067\"></a></div><p>I still have several questions myself, but I thought it would be nice to see the things that were not clear to you! <br>\nSo to get the ball rolling let me ask two questions:</p>\n<ol>\n<li>Can we do Dial (Cat) instead of Dial (Set) ?</li>\n<li>If we do Dial (Set) but have objects (U,X, alpha) mapping to 1, instead of 2, what happens to the structure I described in chapter 1 of <a href=\"https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-213.pdf\">https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-213.pdf</a>?</li>\n</ol>",
        "id": 280675028,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1651258902
    },
    {
        "content": "<p>More questions:</p>\n<ol start=\"3\">\n<li>Tim Hosgood wanted to know if  people had worked out other dialectica categories that were not  over Sets. In particular he wanted to know about categories of spaces—but see <a href=\"https://ncatlab.org/nlab/show/nice+category+of+spaces\">https://ncatlab.org/nlab/show/nice+category+of+spaces</a>. Nice categories of spaces are rare. if one likes topology one might want to do the Dialectica construction over \"sequential topological spaces\" (https://ncatlab.org/nlab/show/sequential+topological+space)--a \"nice\" category of spaces described  by Escardo in the Topos Colloquium this week.</li>\n<li>Dialectica objects have a mapping from a double object into a simplified category, a lineale, L.  So we can write it as Dial_L(C) and we can vary both C and L and how they interact. The  (minor)  generalization I've done is described in the preprint <a href=\"http://researchgate.net/publication/2822237_Categorical_Multirelations_Linear_Logic_and_Petri_Nets\">Categorical Multirelations, Linear Logic and Petri Nets</a>, which was not published, but it was  explored a little in the  paper with Elena di Lavore and Wilmer Leal on <a href=\"https://arxiv.org/abs/2105.12801\">Dialectica Petri Nets</a>. Relationships to \"dynamical systems\" have not been studied: is there anything interesting to say here?</li>\n</ol>",
        "id": 280773759,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1651379747
    },
    {
        "content": "<p>hi all, </p>\n<p>we had our first contents meeting of the MRC-Dialectica group today.</p>\n<p>It started well, with Charlotte asking \"what are the motivations for the dialectica construction?\"<br>\nMotivations are always hard to share, but we had a beginning of a conversation about left-handed-side of an object proves things, <br>\nright-handed-side provides counter-examples: this is where the bidirectionality of the Dialectica construction comes from.</p>\n<p>We have a schedule for subgroups in the  4 weeks, along the lines of:</p>\n<ol>\n<li>\n<p>Dialectica and Games -- Jeremie Koenig leading (was today at 8 am Pacific time)<br>\nValeria recommends <a href=\"https://www.youtube.com/watch?v=10u7hbEYcCk&amp;t=3800s\">Jeremie's talk</a> at the ACT2021 and Glynn <a href=\"https://www.youtube.com/watch?v=ywHNG6DYAGg&amp;t=3s\">Winskel talk</a> at Topos Colloquium </p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ywHNG6DYAGg\" href=\"https://www.youtube.com/watch?v=ywHNG6DYAGg&amp;t=3s\"><img src=\"https://uploads.zulipusercontent.net/be2102488e7cc446574d73912144e56764ef1ba8/68747470733a2f2f692e7974696d672e636f6d2f76692f7977484e473644594147672f64656661756c742e6a7067\"></a></div><div class=\"youtube-video message_inline_image\"><a data-id=\"10u7hbEYcCk\" href=\"https://www.youtube.com/watch?v=10u7hbEYcCk&amp;t=3800s\"><img src=\"https://uploads.zulipusercontent.net/d0bb19402e66435497e69ebb91494eb3f29152ec/68747470733a2f2f692e7974696d672e636f6d2f76692f313075376862455963436b2f64656661756c742e6a7067\"></a></div></li>\n<li>\n<p>Dialectica and Poly --  Nelson Niu leading (next week) </p>\n</li>\n<li>\n<p>Dialectica and Lenses -- Bruno Gravanovic+Matteo Capucci leading (see some above)</p>\n</li>\n<li>\n<p>Dialectica implementations -- Eric Bond leading</p>\n</li>\n</ol>\n<p>but this is all subject to confirmation on email, shortly, we hope. </p>\n<p>NOTE: Everyone in the group is supposed to try to sort themselves into one of the subgroups, tentatively.<br>\nOr to propose another subgroup, if they feel this is most appropriate.</p>\n<p>Questions here or by email to the whole group are highly appreciated: this is how we make progress.</p>",
        "id": 281057379,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1651602879
    },
    {
        "content": "<p>Complementing my message above: </p>\n<ol>\n<li>we also discussed the difference between tensor products and cartesian products in the original Dialectica categories.</li>\n</ol>\n<p>Tensor product of A=(U, X, alpha) and B= (V, Y, beta) is A\\otimesB= (U\\times V, X\\times Y, alpha\\times\\beta), while the cartesian product <br>\nis A&amp;B=(U\\times V, X+ Y, choose(alpha,\\beta)).<br>\nthe tensor product is the multiplicative conjunction, while the cartesian product is the additive conjunction. Hence A&amp;B has projections and diagonals, while A\\otimes B has neither.</p>\n<ol start=\"2\">\n<li>\n<p>I thought it would be very helpful if people tried to prove the theorem in slide 5 of <a href=\"https://drive.google.com/file/d/1i1rvGIf2fqGlUnfN-j9gvSRtD3ayUIqn/view?usp=sharing\">this</a>, as they would appreciate better  CT's ability to hide many calculations behind sleek diagrams.</p>\n</li>\n<li>\n<p>Please ask questions if the proof  of Theorem 1 does not make sense to you, we want to generalize it. a lot.</p>\n</li>\n</ol>",
        "id": 281069756,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1651608599
    }
]