[
    {
        "content": "<p>I thought it might be easier if people could write down questions they had about the <a href=\"https://www.youtube.com/watch?v=hJrJSZlO-Ic\">video</a> that I've posted in the MRC wiki here.  </p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"hJrJSZlO-Ic\" href=\"https://www.youtube.com/watch?v=hJrJSZlO-Ic\"><img src=\"https://uploads.zulipusercontent.net/f927296fe8c3b817c70bd257ca8d2438f3428bf3/68747470733a2f2f692e7974696d672e636f6d2f76692f684a724a535a6c4f2d49632f64656661756c742e6a7067\"></a></div><p>I still have several questions myself, but I thought it would be nice to see the things that were not clear to you! <br>\nSo to get the ball rolling let me ask two questions:</p>\n<ol>\n<li>Can we do Dial (Cat) instead of Dial (Set) ?</li>\n<li>If we do Dial (Set) but have objects (U,X, alpha) mapping to 1, instead of 2, what happens to the structure I described in chapter 1 of <a href=\"https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-213.pdf\">https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-213.pdf</a>?</li>\n</ol>",
        "id": 280675028,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1651258902
    },
    {
        "content": "<p>More questions:</p>\n<ol start=\"3\">\n<li>Tim Hosgood wanted to know if  people had worked out other dialectica categories that were not  over Sets. In particular he wanted to know about categories of spaces—but see <a href=\"https://ncatlab.org/nlab/show/nice+category+of+spaces\">https://ncatlab.org/nlab/show/nice+category+of+spaces</a>. Nice categories of spaces are rare. if one likes topology one might want to do the Dialectica construction over \"sequential topological spaces\" (https://ncatlab.org/nlab/show/sequential+topological+space)--a \"nice\" category of spaces described  by Escardo in the Topos Colloquium this week.</li>\n<li>Dialectica objects have a mapping from a double object into a simplified category, a lineale, L.  So we can write it as Dial_L(C) and we can vary both C and L and how they interact. The  (minor)  generalization I've done is described in the preprint <a href=\"http://researchgate.net/publication/2822237_Categorical_Multirelations_Linear_Logic_and_Petri_Nets\">Categorical Multirelations, Linear Logic and Petri Nets</a>, which was not published, but it was  explored a little in the  paper with Elena di Lavore and Wilmer Leal on <a href=\"https://arxiv.org/abs/2105.12801\">Dialectica Petri Nets</a>. Relationships to \"dynamical systems\" have not been studied: is there anything interesting to say here?</li>\n</ol>",
        "id": 280773759,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1651379747
    }
]