[
    {
        "content": "<p>Great, thanks a lot <span class=\"user-mention\" data-user-id=\"276656\">@Valeria de Paiva</span></p>",
        "id": 284805122,
        "sender_full_name": "Jonathan Weinberger",
        "timestamp": 1654204191
    },
    {
        "content": "<p>FWIW, Cambridge Apollo is back up now</p>",
        "id": 284805184,
        "sender_full_name": "Jonathan Weinberger",
        "timestamp": 1654204212
    },
    {
        "content": "<p><a href=\"https://www.repository.cam.ac.uk/handle/1810/280672\">https://www.repository.cam.ac.uk/handle/1810/280672</a></p>",
        "id": 284805192,
        "sender_full_name": "Jonathan Weinberger",
        "timestamp": 1654204215
    },
    {
        "content": "<p>typical, eh?</p>",
        "id": 284805350,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654204312
    },
    {
        "content": "<p>Not sure yet if (directly) relevant to us but I just saw that Bryce Clarke's thesis is now online, The Double Category of Lenses: <a href=\"https://t.co/PVab0D3Roo\">https://t.co/PVab0D3Roo</a></p>",
        "id": 286842707,
        "sender_full_name": "Jonathan Weinberger",
        "timestamp": 1655762774
    },
    {
        "content": "<p>at one point I was considering whether Dialectica morphisms are squares in some appropriately defined double category but I didn’t get too far</p>",
        "id": 286845958,
        "sender_full_name": "Nelson Niu",
        "timestamp": 1655765830
    },
    {
        "content": "<p>There’s almost certainly a generalization of the charts/lenses double category with for Dialectica though</p>",
        "id": 286845972,
        "sender_full_name": "Nelson Niu",
        "timestamp": 1655765857
    },
    {
        "content": "<p>To get the Dialectica construction going on a category you need finite products and pullbacks so you can also get the contravariant sub-object functor. However, it seems that you just need products and a contravariant functor P into POS. I like this perspective because any intuitionistic first-order theory gives a free such functor P where its internal logic satisfies exactly T. Then one can take Dial(P) and then the objects are exactly (equivalence classes modulo T) of formulas (in context) p(u,x) and q(v,y) and morphisms are pairs of terms (I am simplifying, each could be a list of terms) (f(u), F(u,y)) such that p(u, F(u,y)) proves q(f(u), y) intuitionistically. Is this the generalization by Hyland? (Modulo using indexed categories instead of fibrations and partial orders instead of preorders) My apologies if this construction is being investigated by one of the groups (lenses?) and I am just catching up on basic definitions!</p>",
        "id": 297790365,
        "sender_full_name": "Colin Bloomfield",
        "timestamp": 1662645969
    }
]