[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276875\">@Bruno Gavranovic</span>  can you copy here a bit of your GitHub directory <a href=\"https://github.com/bgavran/Lens_Resources\">https://github.com/bgavran/Lens_Resources</a> that you think is most accessible to  people who haven't seen any of this material before? Say only 3 references or thereabouts? Thanks in advance!!</p>",
        "id": 280678648,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1651260934
    },
    {
        "content": "<p>Absolutely. I'm actually trying to think about which of these resources has the most comprehensive and pedagogical introduction to lenses, and quite frankly I'm not sure <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span><br>\nFor lenses specifically, I believe <a href=\"https://arxiv.org/abs/1908.02202\">Generalised Lens Categories</a> is great. This includes monomorphic, bimorphic and dependent lenses, and various other exotic examples. Of course, dependent lenses are morphisms of polynomial functors, so all the Poly references might be useful as well.<br>\n For optics, one has <a href=\"https://arxiv.org/abs/1809.00738\">Categories of Optics</a> and <a href=\"https://arxiv.org/abs/2001.07488\">Profunctor Optics: A Categorical Update</a>. But all of these topics overlap with one another, and it depends what one's background is, and where one wants to go.<br>\nI think that I personally got the most mileage out of these three references.</p>\n<p>It's also good to look at the applications section, or the blog post section in my github repo. I'd say that most of the papers in the application section present a very motivated view on lenses/optics, and they might be worth checking out. Likewise, sometimes the very readable way some of the blog posts are written can help with getting some intuitions before diving deep into the technical papers.<br>\nI shamelessly recommend some of my own  posts for a very down-to-earth graphical way of thinking about lenses/optics :)</p>",
        "id": 280702689,
        "sender_full_name": "Bruno Gavranovic",
        "timestamp": 1651275958
    }
]