[
    {
        "content": "<p>The first proposition in the Poly book, page 13, states:</p>\n<p>Proposition1.20. Poly has all products and coproducts and is completely distributive. Poly also has exponential objects, making it a bicartesian closed category. It therefore supports the simply typed lambda calculus.</p>\n<p>Can you state a corresponding proposition for the dialectica categories and prove it with the material already at your disposal? send me email with your answers!</p>",
        "id": 284362506,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1653914662
    },
    {
        "content": "<p>my answer would be<br>\nProposition1: LDial has all products and coproducts and is completely distributive. LDial also has exponential objects, making it a symmetric monoidal closed category. It therefore supports the simply typed linear lambda calculus.<br>\nProposition2: Dial has all products and  weak coproducts and is completely distributive. Dial also has exponential objects, making it a symmetric monoidal closed category. It therefore supports the simply typed linear lambda calculus.</p>",
        "id": 284539901,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654032733
    },
    {
        "content": "<p>The second proposition in the Poly book, page 14, states:<br>\nProposition1.21. Beyond the cocartesian and cartesian monoidal structures (0,+)and (1, ×), the category Poly has two additional monoidal structures, denoted (y, ⊗) and (y, ◦), which are together duoidal. Moreover ⊗ is a closed monoidal structure that distributes over coproducts, while ◦ is a left coclosed monoidal structure that preserves connected limits.</p>\n<p>What is the dialectica corresponding proposition?</p>",
        "id": 284551056,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654040690
    },
    {
        "content": "<p>Answering puzzle 2:<br>\nProposition3. Beyond the cocartesian and cartesian monoidal structures (0,+) and (1, ×), the category LDial has two additional monoidal structures, denoted (I, ⊗) and (I, cross-product), which are together duoidal. Moreover ⊗ is a closed monoidal structure that distributes over coproducts.<br>\n(I don't know about connected limits)</p>",
        "id": 284777524,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654190798
    },
    {
        "content": "<p>puzzle 4. the proposition corresponding to</p>\n<blockquote>\n<p>Proposition 1.25. The category Comon(Dial) has finite coproducts and products, and<br>\ncoproducts in Comon(Poly) agree with those in Cat.</p>\n</blockquote>",
        "id": 284781662,
        "sender_full_name": "Valeria de Paiva",
        "timestamp": 1654192785
    }
]