[
    {
        "content": "<p>here's a vague question: bicategories look globular, and double categories look cubical; we could think of bicategories as double categories but where vertical morphisms (I'll call these proarrows to avoid horizontal/vertical confusion) are only allowed to be identities; is there some intermediary notion that looks simplicial? i.e. a double category where the only cells are those whose \"internal\" source (or target, but pick one of the two and fix it, I think) is an identity proarrow?</p>",
        "id": 314280544,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1670346227
    },
    {
        "content": "<p>visually: if i pinch both vertical sides of a square then i get a circle, but if i just pinch one then i get a triangle</p>",
        "id": 314280652,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1670346247
    },
    {
        "content": "<p>How would you compose them?</p>",
        "id": 314280739,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1670346280
    },
    {
        "content": "<p>no idea, that's what i've been stuck on!</p>",
        "id": 314280759,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1670346288
    },
    {
        "content": "<p>That seems like an indication the answer is no...</p>",
        "id": 314280787,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1670346298
    },
    {
        "content": "<p>I mean, you could just say \"I have a double category in which the horizontal target of every 2-cell is an identity\"</p>",
        "id": 314280868,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1670346324
    },
    {
        "content": "<p>hmm, that could be true, but it seems mysterious to me that there are nice globular and cubical structures, but no simplicial-looking one</p>",
        "id": 314280875,
        "sender_full_name": "Tim Hosgood",
        "timestamp": 1670346327
    },
    {
        "content": "<p>It makes sense to me.  To have a composition structure in any direction, you need both sources and targets.</p>",
        "id": 314281157,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1670346404
    }
]