[
    {
        "content": "<p>i updated this draft book on arxiv:<br>\n<a href=\"https://arxiv.org/abs/2208.03817\">https://arxiv.org/abs/2208.03817</a><br>\nthe TITLE CHANGED to:<br>\n<em>Programs as Diagrams: From Categorical Computability to Computable Categories</em><br>\ni think i improved the text, not just the grammar but also the explanations. i am not a good writer, but i am doing my best. the story deserves it. </p>\n<p>maybe i should mention that this string diagram approach evolved through <em>teaching</em>. it makes it possible to prepare students to study crypto within a term. the standard approach takes at least 3, at most places 4 terms of prerequisites.</p>\n<p>the last two chapters are not for teaching, but the POINT of it all. while computability is normally presented as the Church-Turing equivalence of the various computer <em>structures</em> (abacus, turing machines, lambda calculus, etc), computability in a monoidal category becomes a <em>property</em>. and then the categories themselves become computable.</p>\n<p>ok, i hate to advertise, but i keep coming back to advertise this not as my work, but as a law of nature.</p>",
        "id": 298666166,
        "sender_full_name": "dusko",
        "timestamp": 1663102618
    },
    {
        "content": "<p>I'm only ~2 1/2 chapters in, but I'm loving it! The pictures clarify some of the diagonalization that is hard to keep track of in substitution-based syntax. I am working with an undergrad at UMD this semester who will be tackling (part of) it.</p>",
        "id": 298687730,
        "sender_full_name": "Spencer Breiner",
        "timestamp": 1663116724
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"278008\">Spencer Breiner</span> <a href=\"#narrow/stream/274877-practice.3A-our-work/topic/dusko.3A.20computable.20categories/near/298687730\">said</a>:</p>\n<blockquote>\n<p>I'm only ~2 1/2 chapters in, but I'm loving it! The pictures clarify some of the diagonalization that is hard to keep track of in substitution-based syntax. I am working with an undergrad at UMD this semester who will be tackling (part of) it.</p>\n</blockquote>\n<p>nice! if it is useful, i can send a link to the version with exercises and background. and pointing me to the places where things are still not clear or don't come across would be great.</p>",
        "id": 298903817,
        "sender_full_name": "dusko",
        "timestamp": 1663219854
    }
]