[
    {
        "content": "<p>Creating this small thread to discuss the work I am attempting and thinking about doing in applied category theory.</p>",
        "id": 317764720,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1671915571
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"276037\">@Jade Master</span> , following up on your question here from over in <a class=\"stream-topic\" data-stream-id=\"241990\" href=\"/#narrow/stream/241990-general.3A-values/topic/Mathematics.20for.20humanity\">#general: values &gt; Mathematics for humanity</a> ! Going to repost it here for context:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"483329\">Jacob Zelko</span> <a href=\"#narrow/stream/241990-general.3A-values/topic/Mathematics.20for.20humanity/near/312509555\">said</a>:</p>\n<blockquote>\n<p>Hey <span class=\"user-mention silent\" data-user-id=\"275920\">John Baez</span> , not sure how how well this fits but I’m leading an international collaboration involving 80+ million patients to assess health disparities in chronic mental illness and their care across factors such geographic location, race, gender, age, costs, etc. Currently working with AlgebraicJulia folks on tooling that combines aspects of directed wiring diagrams and workflows together to enable more effective multi-site and intercontinental collaboration. Also beginning work to identify equitable representation in disease definitions.</p>\n</blockquote>\n<blockquote>\n<p>Interesting. Can you tell me more? I am sort of surprised that CT is useful for this</p>\n</blockquote>",
        "id": 317764989,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1671915792
    },
    {
        "content": "<p>It'll take me a little bit to respond to this Jade (holiday season here where I am at -- family craziness ensuing accordingly). Would you mind sharing a bit more about your surprise and thoughts in the interim? To give a first pass at an answer, this is more an attempt at exploring how this could be useful in the context of my work and research. It's an open question that I am pursuing at the moment.</p>",
        "id": 317765429,
        "sender_full_name": "Jacob Zelko",
        "timestamp": 1671916191
    },
    {
        "content": "<p>I think I am just curious about what you do. It's not urgent</p>",
        "id": 317772571,
        "sender_full_name": "Jade Master",
        "timestamp": 1671921753
    }
]