[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"277611\">@Todd Trimble</span> recently told me a slick proof of a cool fact he learned from Charles Rezk on <a href=\"https://mathoverflow.net/questions/10635/why-are-the-characters-of-the-symmetric-group-integer-valued\">MathOverflow</a>.</p>\n<p>First a warmup fact.  Suppose Ï is a representation of a group G on a finite-dimensional complex vector space.   If g âˆˆ G then tr(Ï(g)) is a finite sum of nth roots of unity, where n is the order of g: that is, the smallest integer n &gt; 0 with ğ‘”â¿ = 1.</p>\n<p>Why?  Well, we have Ï(g)â¿  = 1.  You can always diagonalize a complex matrix whose nth power is 1.   (See why?)   So do that.  Then its diagonal entries have to be nth roots of unity.    So tr(Ï(g)) is a sum of nth roots of unity.</p>\n<p>Now for the cool part.  If G is a symmetric group, then tr(Ï(g)) is an integer!   </p>\n<p>This is harder, but still quick.  Let F be the field consisting of all rational linear combinations of nth roots of unity.  If k is relatively prime to n there's an automorphism of F sending each nth root of unity to its kth power.   Applying this automorphism to the entries of our diagonalized matrix Ï(g) we get the matrix Ï(g)áµ.</p>\n<p>But for a permutation with gâ¿ = 1, gáµ has the same cycle structure as g whenever k is relatively prime to n.  (Draw some examples).  So gáµ is conjugate to g.    So Ï(g)áµ is conjugate to Ï(g).  But the trace of a matrix doesn't change when you conjugate that matrix by something, so tr(Ï(g)áµ) = tr(Ï(g)).</p>\n<p>We've learned that tr(Ï(g)) is a sum of nth roots of unity, but it also doesn't change when we apply the automorphism of F sending any nth root of unity to its kth power, whenever k is relatively prime to n.   By some Galois theory, this forces tr(Ï(g)) to be an integer!  </p>\n<p>(Charles Rezk said this much faster since he assumed you know all the background.  I've tried to minimize the amount of jargon.  But we still need some Galois theory at the end - basically, the only algebraic integers in F invariant under the Galois group of F over â„š are ordinary integers.  Maybe there's some easy way to see this fact in the special case at hand.)</p>",
        "id": 388805205,
        "sender_full_name": "John Baez",
        "timestamp": 1693734318
    }
]