[
    {
        "content": "<p>Originally, Lie Groups arose out of the study of symmetries of PDEs, and they remain quite useful for integrating them and for finding \"good coordinate systems\" in which to study a given PDE. Then they (Lie Groups) took on a life of their own.</p>\n<p>My question: is there a similar story for Lie Groupoids and PDEs? Or Lie Groupoids and X, where X somehow generalizes PDEs? I feel like I've actually asked that question before, but I can't dig it up. I don't think it got an answer that made me go 'aha, that makes sense!'.</p>",
        "id": 272156564,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1645035464
    },
    {
        "content": "<p>One big use of Lie groupoids has been to study \"gauge theories\", which are PDE with infinite-dimensional groups of \"gauge symmetries\" - roughly, symmetries such that two solutions related by a symmetry are considered \"physically equivalent\".</p>",
        "id": 272159359,
        "sender_full_name": "John Baez",
        "timestamp": 1645036738
    },
    {
        "content": "<p>An example is the PDE saying that a connection on a bundle is flat.   There's a \"stack\" of solutions of this equation - that is, roughly, a <em>Lie groupoid of solutions!</em></p>",
        "id": 272159524,
        "sender_full_name": "John Baez",
        "timestamp": 1645036820
    },
    {
        "content": "<p>The morphisms in this Lie groupoid are the gauge symmetries.</p>",
        "id": 272159603,
        "sender_full_name": "John Baez",
        "timestamp": 1645036864
    },
    {
        "content": "<p>I chose a relatively simple example of how Lie groupoids show up in PDE, and there's a lot you can read about them here:</p>\n<ul>\n<li><a href=\"https://www.google.com/search?client=firefox-b-1-d&amp;q=moduli+stack+of+flat+connections\">moduli stacks of flat connections</a>.</li>\n</ul>",
        "id": 272159818,
        "sender_full_name": "John Baez",
        "timestamp": 1645036987
    },
    {
        "content": "<p>In this work, you can think of stacks as a particular <em>attitude</em> toward working with Lie groupoids - sometimes informed by algebraic geometry (rather than merely differential geometry), and taking a careful attitude toward what count as the correct <em>morphisms</em> between Lie groupoids.</p>",
        "id": 272160006,
        "sender_full_name": "John Baez",
        "timestamp": 1645037084
    },
    {
        "content": "<p>That google search gives me lots of things on <em>moduli spaces of flat connections</em> (notice the stack -&gt; space switch, done by Google). What I don't find is any mention of PDEs, or of the use of symmetries to 'integrate'. [I have no doubts you're right, I just couldn't connect the dots given this material.] </p>\n<p>Plus, in the classical methods, you get a Lie group of symmetries, not of solutions. So that's got me quite puzzled.</p>",
        "id": 272182328,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1645047302
    }
]