[
    {
        "content": "<p>There's a new paper that compares the category of sets and relations to the category of Hilbert spaces and bounded linear operators:</p>\n<ul>\n<li>Andre Kornell, <a href=\"https://arxiv.org/abs/2302.14153\">Axioms for the category of sets and relations</a>.</li>\n</ul>\n<p>This paper lists a bunch of axioms that these categories both obey, and then give extra axioms that uniquely characterize the category of sets and relations, on the one hand, and the category of (real or complex) Hilbert spaces and bounded linear operators, on the other.</p>",
        "id": 339475889,
        "sender_full_name": "John Baez",
        "timestamp": 1677893837
    },
    {
        "content": "<p>So, we're getting better at seeing how quantum mechanics is and is not like \"possibilistic\" mechanics where operators are replaced by relations!</p>",
        "id": 339475977,
        "sender_full_name": "John Baez",
        "timestamp": 1677893919
    },
    {
        "content": "<p>I contacted Andre about that paper, since he didn't mention (and apparently didn't know about) <em>allegories</em>, the axiomatization of categories of relations for regular categories. His characterization looks simpler than the definition of <em>power allegory</em>, which is the axiomatization of the category of relations of a topos (of which Rel is, of course, a special case), so I'm curious to see whether this is just because Rel is very special (quite likely) or because that characterization can be simplified somewhat.</p>",
        "id": 339498972,
        "sender_full_name": "Morgan Rogers (he/him)",
        "timestamp": 1677913629
    },
    {
        "content": "<p>I was also put in mind of <span class=\"user-mention\" data-user-id=\"276777\">@Mike Shulman</span>'s <a href=\"https://ncatlab.org/nlab/show/SEAR\">[[SEAR]]</a>, but that's a first-order axiomatisation, not a category-theoretic one.</p>",
        "id": 339507478,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1677918675
    },
    {
        "content": "<p>I do like Kornell's paper very much, though!</p>",
        "id": 339507553,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1677918708
    },
    {
        "content": "<p>Lol, I thought \"Wait didn't Chris Heunen do something similar in the past?\" and then it turns out that they indeed coauthored the paper about the axiomatization of Hilb</p>",
        "id": 339557243,
        "sender_full_name": "Fabrizio Genovese",
        "timestamp": 1677937062
    },
    {
        "content": "<p>Right, this is sort of an extension of those ideas to Rel.</p>",
        "id": 339579760,
        "sender_full_name": "John Baez",
        "timestamp": 1677945824
    }
]